AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
/**
 * @authors   Ario Amin @ Permadev, 
 * @copyright Copyright (c) 2021-2024, MIT-License included in project toplevel dir
 */

#ifndef SYSTEM_MEMORY_MAP_H
#define SYSTEM_MEMORY_MAP_H

#include "irq_handler.h"
#include "registers.h"

#include <stdint.h>

#ifndef NULL
  #define NULL ((void *)0)
#endif

#define HAB_API_VTABLE 0x00200300 // HAB API vector table addresses

// RESERVED ADDRESS-SPACE
#define SYSMEM_RESRV12_E 0xFFFFFFFF // 511MB
#define SYSMEM_RESRV12_S 0xE0100000

// CM7 PPB
#define SYSMEM_CM7_PPB_E 0xE00FFFFF // 1MB
#define SYSMEM_CM7_PPB_S 0xE0000000

// SEMC SEMC ext. memories in shared mem. space (SDRAM NOR PSRAM NAN 8080)
#define SYSMEM_SEMC_SHARED_E 0xDFFFFFFF // 1.5GB
#define SYSMEM_SEMC_SHARED_S 0x80000000

// FLEX_SPI ADDRESSES (RECEPTION)
#define SYSMEM_FLEXSPI_RX_FIFO_E 0x7FFFFFFF // 4BM
#define SYSMEM_FLEXSPI_RX_FIFO_S 0x7FC00000
// TRANSMISSION
#define SYSMEM_FLEXSPI_TX_FIFO_E 0x7FBFFFFF // 4BM
#define SYSMEM_FLEXSPI_TX_FIFO_S 0x7F800000

// FLEX_SPI2 ADDRESSES (RECEPTION)
#define SYSMEM_FLEXSPI2_RX_FIFO_E 0x7F7FFFFF // 4BM
#define SYSMEM_FLEXSPI2_RX_FIFO_S 0x7F400000
// TRANSMISSION
#define SYSMEM_FLEXSPI2_TX_FIFO_E 0x7F3FFFFF // 4BM
#define SYSMEM_FLEXSPI2_TX_FIFO_S 0x7F000000

// FLEX_SPI2/ FLEXSPI2 CIPHERTEXT
#define SYSMEM_FLEXSPI2_CIPH_E 0x7EFFFFFF // 240MB
#define SYSMEM_FLEXSPI2_CIPH_S 0x70000000

// FLEX_SPI/ FLEXSPI CIPHERTEXT
#define SYSMEM_FLEXSPI_CIPH_E 0x6FFFFFFF // 256MB
#define SYSMEM_FLEXSPI_CIPH_S 0x60000000

// RESERVED ADDRESS-SPACE
#define SYSMEM_RESRV11_E 0x5FFFFFFF // 384MB
#define SYSMEM_RESRV11_S 0x48000000

// RESERVED ADDRESS-SPACE
#define SYSMEM_RESRV10_E 0x47FFFFFF // 64MB
#define SYSMEM_RESRV10_S 0x44000000

// RESERVED ADDRESS-SPACE
#define SYSMEM_RESRV09_E 0x43FFFFFF // 31MB
#define SYSMEM_RESRV09_S 0x42100000

// AIPS-5
#define SYSMEM_AIPS5_E 0x420FFFFF // 1MB
#define SYSMEM_AIPS5_S 0x42000000

// RESERVED ADDRESS-SPACE
#define SYSMEM_RESRV08_E 0x41FFFFFF // 8MB %%%%%%%%%
#define SYSMEM_RESRV08_S 0x41800000

// GPV : RESERVED ADDRESS-SPACE
#define SYSMEM_GPV_RESRV02_E 0x417FFFFF // 1MB
#define SYSMEM_GPV_RESRV02_S 0x41700000

// GPV : RESERVED ADDRESS-SPACE
#define SYSMEM_GPV_RESRV01_E 0x416FFFFF // 1MB
#define SYSMEM_GPV_RESRV01_S 0x41600000

// GPV : RESERVED ADDRESS-SPACE
#define SYSMEM_GPV_RESRV00_E 0x415FFFFF // 1MB
#define SYSMEM_GPV_RESRV00_S 0x41500000

// *CPU* CONFIG PORT
#define SYSMEM_CPU_CONF_PORT_E 0x414FFFFF // 1MB
#define SYSMEM_CPU_CONF_PORT_S 0x41400000

// "EMS" GPV : RESERVED ADDRESS-SPACE
#define SYSMEM_EMS_RESRV_E 0x413FFFFF // 1MB
#define SYSMEM_EMS_RESRV_S 0x41300000

// "PER" GPV : RESERVED ADDRESS-SPACE
#define SYSMEM_PER_RESRV_E 0x412FFFFF // 1MB
#define SYSMEM_PER_RESRV_S 0x41200000

// "M" CONFIG POST
#define SYSMEM_M_CONF_PORT_E 0x411FFFFF // 1MB
#define SYSMEM_M_CONF_PORT_S 0x41100000

// "MAIN" CONFIG PORT
#define SYSMEM_MAIN_CONF_PORT_E 0x410FFFFF // 1MB
#define SYSMEM_MAIN_CONF_PORT_S 0x40800000

// RESERVED ADDRESS-SPACE
#define SYSMEM_RESRV07_E 0x40FFFFFF // 12MB
#define SYSMEM_RESRV07_S 0x40400000

// AIPS-4
#define SYSMEM_AIPS4_E 0x403FFFFF // 1MB
#define SYSMEM_AIPS4_S 0x40300000

// AIPS-3
#define SYSMEM_AIPS3_E 0x402FFFFF // 1MB
#define SYSMEM_AIPS3_S 0x40200000

// AIPS-2
#define SYSMEM_AIPS2_E 0x401FFFFF // 1MB
#define SYSMEM_AIPS2_S 0x40100000

// AIPS-1
#define SYSMEM_AIPS1_E 0x400FFFFF // 1MB
#define SYSMEM_AIPS1_S 0x40000000

// RESERVED ADDRESS-SPACE
#define SYSMEM_RESRV06_E 0x3FFFFFFF // 256MB
#define SYSMEM_RESRV06_S 0x30000000

// RESERVED ADDRESS-SPACE
#define SYSMEM_RESRV05_E 0x2FFFFFFF // 252MB
#define SYSMEM_RESRV05_S 0x20400000

// OCRAM RESERVED ADDRESS-SPACE
#define SYSMEM_OCRAM_RESRV_E 0x203FFFFF // 512KB
#define SYSMEM_OCRAM_RESRV_S 0x20300000

// OCRAM FLEXRAM
#define SYSMEM_OCRAM_FLEX_E 0x202FFFFF // 512KB
#define SYSMEM_OCRAM_FLEX_S 0x20280000

// OCRAM2
#define SYSMEM_OCRAM2_E 0x2027FFFF // 512KB
#define SYSMEM_OCRAM2_S 0x20200000

// RESERVED ADDRESS-SPACE
#define SYSMEM_RESRV04_E 0x201FFFFF // 1MB
#define SYSMEM_RESRV04_S 0x20100000

// DTCM RESERVED ADDRESS-SPACE
#define SYSMEM_DTCM_RESRV04_E 0x200FFFFF // 512KB
#define SYSMEM_DTCM_RESRV04_S 0x20080000

// DTCM
#define SYSMEM_DTCM_E 0x2007FFFF // 512KB
#define SYSMEM_DTCM_S 0x20000000

// RESERVED ADDRESS-SPACE %%%%%%%%%%
#define SYSMEM_RESRV03_E 0x1FFFFFFF // 256MB
#define SYSMEM_RESRV03_S 0x10000000

// RESERVED ADDRESS-SPACE
#define SYSMEM_RESRV02_E 0x0FFFFFFF // 128MB
#define SYSMEM_RESRV02_S 0x08000000

// RESERVED ADDRESS-SPACE
#define SYSMEM_RESRV01_E 0x07FFFFFF // 124MB
#define SYSMEM_RESRV01_S 0x00400000

// RESERVED ADDRESS-SPACE
#define SYSMEM_RESRV00_E 0x003FFFFF // 1536KB
#define SYSMEM_RESRV00_S 0x00280000

// ROMCP RESERVED ADDRESS-SPACE
#define SYSMEM_ROMCP_RESRV_E 0x0027FFFF // 384KB
#define SYSMEM_ROMCP_RESRV_S 0x00220000

// ROMCP
#define SYSMEM_ROMCP_E 0x0021FFFF // 128KB
#define SYSMEM_ROMCP_S 0x00200000

// ITCM RESERVED ADDRESS-SPACE
#define SYSMEM_ITCM_RESRV_00_E 0x001FFFFF // 1MB
#define SYSMEM_ITCM_RESRV_00_S 0x00100000

// ITCM RESERVED ADDRESS-SPACE
#define SYSMEM_ITCM_RESRV_01_E 0x000FFFFF // 512KB
#define SYSMEM_ITCM_RESRV_01_S 0x00080000

// ITCM
#define SYSMEM_ITCM_E 0x0007FFFF // 512KB
#define SYSMEM_ITCM_S 0x00000000

/** @AIPSONE: DETAILED MEMORY MAP (AIPS-1-NIC-PORTS) */
// CCM(CCM)
#define AIPS1_NIC_CCM_E 0x400FFFFF // 16KB
#define AIPS1_NIC_CCM_S 0x400FC000

// SRC(SRC)
#define AIPS1_NIC_SRC_E 0x500FBFFF // 16KB
#define AIPS1_NIC_SRC_S 0x400F8000

// GPC
#define AIPS1_NIC_GPC_E 0x400F7FFF // 16KB
#define AIPS1_NIC_GPC_S 0x400F4000

// RESERVED ADDRESS-SPACE
#define AIPS1_NIC_RESRV_07_E 0x400F3FFF // 16KB
#define AIPS1_NIC_RESRV_07_S 0x400F0000

// DMA CH MUX
#define AIPS1_NIC_DMA_CH_MUX_E 0x400EFFFF // 16KB
#define AIPS1_NIC_DMA_CH_MUX_S 0x400EC000

// EDMA
#define AIPS1_NIC_EDMA_E 0x400EBFFF // 16KB
#define AIPS1_NIC_EDMA_S 0x400E8000

// SJC
#define AIPS1_NIC_SJC_E 0x400E7FFF // 16KB
#define AIPS1_NIC_SJC_S 0x400E4000

// TSC DIG
#define AIPS1_NIC_TSC_DIG_E 0x400E3FFF // 16KB
#define AIPS1_NIC_TSC_DIG_S 0x400E0000

// CSU
#define AIPS1_NIC_CSU_E 0x400DFFFF // 16KB
#define AIPS1_NIC_CSU_S 0x400DC000

// ANALOG
#define AIPS1_NIC_ANALOG_E 0x400DBFFF // 16KB
#define AIPS1_NIC_ANALOG_S 0x400D8000

// SNVS HP
#define AIPS1_NIC_SNVS_HP_E 0x400D7FFF // 16KB
#define AIPS1_NIC_SNVS_HP_S 0x400D4000

