AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
// WDOG 2
#define AIPS1_NIC_WDOG2_E 0x400D3FFF // 16KB
#define AIPS1_NIC_WDOG2_S 0x400D0000

// TRNG
#define AIPS1_NIC_TRNG_E 0x400CFFFF // 16KB
#define AIPS1_NIC_TRNG_S 0x400CC000

// ADC2
#define AIPS1_NIC_ADC2_E 0x400CBFFF // 16KB
#define AIPS1_NIC_ADC2_S 0x400C8000

// ADC1
#define AIPS1_NIC_ADC1_E 0x400C7FFF // 16KB
#define AIPS1_NIC_ADC1_S 0x400C4000

// GPIO5
#define AIPS1_NIC_GPIO5_E 0x400C3FFF // 16KB
#define AIPS1_NIC_GPIO5_S 0x400C0000

// WDOG3
#define AIPS1_NIC_WDOG3_E 0x400BFFFF // 16KB
#define AIPS1_NIC_WDOG3_S 0x400BC000

// WDOG1
#define AIPS1_NIC_WDOG1_E 0x400BBFFF // 16KB
#define AIPS1_NIC_WDOG1_S 0x400B8000

// EWM
#define AIPS1_NIC_EWM_E 0x400B7FFF // 16KB
#define AIPS1_NIC_EWM_S 0x400B4000

// CM7 MXRT (FLEXRAM)
#define AIPS1_NIC_CM7MXRT_FLEXRAM_E 0x400B3FFF // 16KB
#define AIPS1_NIC_CM7MXRT_FLEXRAM_S 0x400B0000

// IO MUXC - GPR
#define AIPS1_NIC_IOMUXC_GPR_E 0x400AFFFF // 16KB
#define AIPS1_NIC_IOMUXC_GPR_S 0x400AC000

// IO MUXC - SNVS
#define AIPS1_NIC_IOMUXC_SNVS_E 0x400ABFFF // 16KB
#define AIPS1_NIC_IOMUXC_SNVS_S 0x400A8000

// IO MUXC - SNVS GPR
#define AIPS1_NIC_IOMUXC_SNVS_GPR_E 0x400A7FFF // 16KB
#define AIPS1_NIC_IOMUXC_SNVS_GPR_S 0x400A4000

// RESERVED ADDRESS-SPACE
#define AIPS1_NIC_RESRV07_E 0x400A3FFF // 16KB
#define AIPS1_NIC_RESRV07_S 0x400A0000

// RESERVED ADDRESS-SPACE
#define AIPS1_NIC_RESRV06_E 0x4009FFFF // 16KB
#define AIPS1_NIC_RESRV06_S 0x4009C000

// RESERVED ADDRESS-SPACE
#define AIPS1_NIC_RESRV05_E 0x4009BFFF // 16KB
#define AIPS1_NIC_RESRV05_S 0x40098000

// ACMP
#define AIPS1_NIC_ACMP_E 0x40097FFF // 16KB
#define AIPS1_NIC_ACMP_S 0x40094000

// RESERVED ADDRESS-SPACE
#define AIPS1_NIC_RESRV04_E 0x40093FFF // 16KB
#define AIPS1_NIC_RESRV04_S 0x40090000

// RESERVED ADDRESS-SPACE
#define AIPS1_NIC_RESRV03_E 0x4008FFFF // 16KB
#define AIPS1_NIC_RESRV03_S 0x4008C000

// RESERVED ADDRESS-SPACE
#define AIPS1_NIC_RESRV02_E 0x4008BFFF // 16KB
#define AIPS1_NIC_RESRV02_S 0x40088000

// PIT
#define AIPS1_NIC_PIT_E 0x40087FFF // 16KB
#define AIPS1_NIC_PIT_S 0x40084000

// DCDC
#define AIPS1_NIC_DCDC_E 0x40083FFF // 16KB
#define AIPS1_NIC_DCDC_S 0x40080000

// AIPS 1 CONFIG
#define AIPS1_NIC_CONF_E 0x4007FFFF // 16KB
#define AIPS1_NIC_CONF_S 0x4007C000

// RESERVED ADDRESS-SPACE
#define AIPS1_NIC_RESRV01_E 0x4007FFFF // 240KB
#define AIPS1_NIC_RESRV01_S 0x40040000

// RESERVED ADDRESS-SPACE
#define AIPS1_NIC_RESRV00_E 0x4003FFFF // 256KB
#define AIPS1_NIC_RESRV00_S 0x40000000
//
//
/** @AIPSTWO: DETAILED MEMORY MAP (AIPS-2-NIC-PORTS) */
// CCM(CCM)
#define AIPS2_NIC_KPP_E 0x401FFFFF // 16KB
#define AIPS2_NIC_KPP_S 0x401FC000

// SRC(SRC)
#define AIPS2_NIC_IO_MUXXC_E 0x401FBFFF // 16KB
#define AIPS2_NIC_IO_MUXXC_S 0x401F8000

// GPC
#define AIPS2_NIC_OCOTP_E 0x401F7FFF // 16KB
#define AIPS2_NIC_OCOTP_S 0x401F4000

// RESERVED ADDRESS-SPACE
#define AIPS2_NIC_GPT2_E 0x401F3FFF // 16KB
#define AIPS2_NIC_GPT2_S 0x401F0000

// DMA CH MUX
#define AIPS2_NIC_GPT1_E 0x401EFFFF // 16KB
#define AIPS2_NIC_GPT1_S 0x401EC000

// EDMA
#define AIPS2_NIC_QTIMER4_E 0x401EBFFF // 16KB
#define AIPS2_NIC_QTIMER4_S 0x401E8000

// SJC
#define AIPS2_NIC_QTIMER3_E 0x401E7FFF // 16KB
#define AIPS2_NIC_QTIMER3_S 0x401E4000

// TSC DIG
#define AIPS2_NIC_QTIMER2_E 0x401E3FFF // 16KB
#define AIPS2_NIC_QTIMER2_S 0x401E0000

// CSU
#define AIPS2_NIC_QTIMER1_E 0x401DFFFF // 16KB
#define AIPS2_NIC_QTIMER1_S 0x401DC000

// ANALOG
#define AIPS2_NIC_FLEXCAN3_E 0x401DBFFF // 16KB
#define AIPS2_NIC_FLEXCAN3_S 0x401D8000

// SNVS HP
#define AIPS2_NIC_FLEXCAN2_E 0x401D7FFF // 16KB
#define AIPS2_NIC_FLEXCAN2_S 0x401D4000

// WDOG 2
#define AIPS2_NIC_FLEXCAN1_E 0x401D3FFF // 16KB
#define AIPS2_NIC_FLEXCAN1_S 0x401D0000

// TRNG
#define AIPS2_NIC_RESRV06_E 0x401CFFFF // 16KB
#define AIPS2_NIC_RESRV06_S 0x401CC000

// ADC2
#define AIPS2_NIC_RESRV05_E 0x401CBFFF // 16KB
#define AIPS2_NIC_RESRV05_S 0x401C8000

// ADC1
#define AIPS2_NIC_GPIO4_E 0x401C7FFF // 16KB
#define AIPS2_NIC_GPIO4_S 0x401C4000

// GPIO5
#define AIPS2_NIC_GPIO3_E 0x401C3FFF // 16KB
#define AIPS2_NIC_GPIO3_S 0x401C0000

// WDOG3
#define AIPS2_NIC_GPIO2_E 0x401BFFFF // 16KB
#define AIPS2_NIC_GPIO2_S 0x401BC000

// WDOG1
#define AIPS2_NIC_GPIO1_E 0x401BBFFF // 16KB
#define AIPS2_NIC_GPIO1_S 0x401B8000

// EWM
#define AIPS2_NIC_RESRV04_E 0x401B7FFF // 16KB
#define AIPS2_NIC_RESRV04_S 0x401B4000

// CM7 MXRT (FLEXRAM)
#define AIPS2_NIC_FLEX_IO2_E 0x401B3FFF // 16KB
#define AIPS2_NIC_FLEX_IO2_S 0x401B0000

// IO MUXC - GPR
#define AIPS2_NIC_FLEX_IO1_E 0x401AFFFF // 16KB
#define AIPS2_NIC_FLEX_IO1_S 0x401AC000

// IO MUXC - SNVS
#define AIPS2_NIC_RESRV03_E 0x401ABFFF // 16KB
#define AIPS2_NIC_RESRV03_S 0x401A8000

// IO MUXC - SNVS GPR
#define AIPS2_NIC_RESRV02_E 0x401A7FFF // 16KB
#define AIPS2_NIC_RESRV02_S 0x401A4000

// RESERVED ADDRESS-SPACE
#define AIPS2_NIC_LP_UART8_E 0x401A3FFF // 16KB
#define AIPS2_NIC_LP_UART8_S 0x401A0000

// RESERVED ADDRESS-SPACE
#define AIPS2_NIC_LP_UART7_E 0x4019FFFF // 16KB
#define AIPS2_NIC_LP_UART7_S 0x4019C000

// RESERVED ADDRESS-SPACE
#define AIPS2_NIC_LP_UART6_E 0x4019BFFF // 16KB
#define AIPS2_NIC_LP_UART6_S 0x40198000

// ACMP
#define AIPS2_NIC_LP_UAR5_E 0x40197FFF // 16KB
#define AIPS2_NIC_LP_UAR5_S 0x40194000

// RESERVED ADDRESS-SPACE
#define AIPS2_NIC_LP_UART4_E 0x40193FFF // 16KB
#define AIPS2_NIC_LP_UART4_S 0x40190000

// RESERVED ADDRESS-SPACE
#define AIPS2_NIC_LP_UART3_E 0x4018FFFF // 16KB
#define AIPS2_NIC_LP_UART3_S 0x4018C000

// RESERVED ADDRESS-SPACE
#define AIPS2_NIC_LP_UART2_E 0x4018BFFF // 16KB
#define AIPS2_NIC_LP_UART2_S 0x40188000

// PIT
#define AIPS2_NIC_LP_UART1_E 0x40187FFF // 16KB
#define AIPS2_NIC_LP_UART1_S 0x40184000

// DCDC
#define AIPS2_NIC_ROMCP_E 0x40183FFF // 16KB
#define AIPS2_NIC_ROMCP_S 0x40180000

// AIPS 2 CONFIG
#define AIPS2_NIC_CONF_E 0x4017FFFF // 16KB
#define AIPS2_NIC_CONF_S 0x4017C000

// RESERVED ADDRESS-SPACE
#define AIPS2_NIC_RESRV01_E 0x4017FFFF // 240KB
#define AIPS2_NIC_RESRV01_S 0x40140000

// RESERVED ADDRESS-SPACE
#define AIPS2_NIC_RESRV00_E 0x4013FFFF // 256KB
#define AIPS2_NIC_RESRV00_S 0x40100000
//
//
/** @AIPSTHREE: DETAILED MEMORY MAP (AIPS-1-NIC-PORTS) */
// CCM(CCM)
#define AIPS3_NIC_DCP_E 0x402FFFFF // 16KB
#define AIPS3_NIC_DCP_S 0x402FC000

// SRC(SRC)
#define AIPS3_NIC_RESRV21_E 0x402FBFFF // 16KB
#define AIPS3_NIC_RESRV21_S 0x402F8000

