AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
// GPC
#define AIPS3_NIC_RESRV20_E 0x402F7FFF // 16KB
#define AIPS3_NIC_RESRV20_S 0x402F4000

// RESERVED ADDRESS-SPACE
#define AIPS3_NIC_SEMC_E 0x402F3FFF // 16KB
#define AIPS3_NIC_SEMC_S 0x402F0000

// DMA CH MUX
#define AIPS3_NIC_RESRV19_E 0x402EFFFF // 16KB
#define AIPS3_NIC_RESRV19_S 0x402EC000

// EDMA
#define AIPS3_NIC_RESRV18_E 0x402EBFFF // 16KB
#define AIPS3_NIC_RESRV18_S 0x402E8000

// SJC
#define AIPS3_NIC_RESRV17_E 0x402E7FFF // 16KB
#define AIPS3_NIC_RESRV17_S 0x402E4000

// TSC DIG
#define AIPS3_NIC_USB_E 0x402E3FFF // 16KB
#define AIPS3_NIC_USB_S 0x402E0000

// CSU
#define AIPS3_NIC_RESRV16_E 0x402DFFFF // 16KB
#define AIPS3_NIC_RESRV16_S 0x402DC000

// ANALOG
#define AIPS3_NIC_ENET_E 0x402DBFFF // 16KB
#define AIPS3_NIC_ENET_S 0x402D8000

// SNVS HP
#define AIPS3_NIC_ENET2_E 0x402D7FFF // 16KB
#define AIPS3_NIC_ENET2_S 0x402D4000

// WDOG 2
#define AIPS3_NIC_RESRV15_E 0x402D3FFF // 16KB
#define AIPS3_NIC_RESRV15_S 0x402D0000

// TRNG
#define AIPS3_NIC_RESRV14_E 0x402CFFFF // 16KB
#define AIPS3_NIC_RESRV14_S 0x402CC000

// ADC2
#define AIPS3_NIC_RESRV13_E 0x402CBFFF // 16KB
#define AIPS3_NIC_RESRV13_S 0x402C8000

// ADC1
#define AIPS3_NIC_US_DHC2_E 0x402C7FFF // 16KB
#define AIPS3_NIC_US_DHC2_S 0x402C4000

// GPIO5
#define AIPS3_NIC_US_DHC1_E 0x402C3FFF // 16KB
#define AIPS3_NIC_US_DHC1_S 0x402C0000

// WDOG3
#define AIPS3_NIC_CSI_E 0x402BFFFF // 16KB
#define AIPS3_NIC_CSI_S 0x402BC000

// WDOG1
#define AIPS3_NIC_LCDIF_E 0x402BBFFF // 16KB
#define AIPS3_NIC_LCDIF_S 0x402B8000

// EWM
#define AIPS3_NIC_PXP_E 0x402B7FFF // 16KB
#define AIPS3_NIC_PXP_S 0x402B4000

// CM7 MXRT (FLEXRAM)
#define AIPS3_NIC_RESRV12_E 0x402B3FFF // 16KB
#define AIPS3_NIC_RESRV12_S 0x402B0000

// IO MUXC - GPR
#define AIPS3_NIC_RESRV11_E 0x402AFFFF // 16KB
#define AIPS3_NIC_RESRV11_S 0x402AC000

// IO MUXC - SNVS
#define AIPS3_NIC_FLEX_SPI_E 0x402ABFFF // 16KB
#define AIPS3_NIC_FLEX_SPI_S 0x402A8000

// IO MUXC - SNVS GPR
#define AIPS3_NIC_FLEX_SPI2_E 0x402A7FFF // 16KB
#define AIPS3_NIC_FLEX_SPI2_S 0x402A4000

// RESERVED ADDRESS-SPACE
#define AIPS3_NIC_RESRV10_E 0x402A3FFF // 16KB
#define AIPS3_NIC_RESRV10_S 0x402A0000

// RESERVED ADDRESS-SPACE
#define AIPS3_NIC_RESRV09_E 0x4029FFFF // 16KB
#define AIPS3_NIC_RESRV09_S 0x4029C000

// RESERVED ADDRESS-SPACE
#define AIPS3_NIC_RESRV08_E 0x4029BFFF // 16KB
#define AIPS3_NIC_RESRV08_S 0x40298000

// ACMP
#define AIPS3_NIC_RESRV07_E 0x40297FFF // 16KB
#define AIPS3_NIC_RESRV07_S 0x40294000

// RESERVED ADDRESS-SPACE
#define AIPS3_NIC_RESRV06_E 0x40293FFF // 16KB
#define AIPS3_NIC_RESRV06_S 0x40290000

// RESERVED ADDRESS-SPACE
#define AIPS3_NIC_RESRV05_E 0x4028FFFF // 16KB
#define AIPS3_NIC_RESRV05_S 0x4028C000

// RESERVED ADDRESS-SPACE
#define AIPS3_NIC_RESRV04_E 0x4028BFFF // 16KB
#define AIPS3_NIC_RESRV04_S 0x40288000

// PIT
#define AIPS3_NIC_RESRV03_E 0x40287FFF // 16KB
#define AIPS3_NIC_RESRV03_S 0x40284000

// DCDC
#define AIPS3_NIC_RESRV02_E 0x40283FFF // 16KB
#define AIPS3_NIC_RESRV02_S 0x40280000

// AIPS 1 CONFIG
#define AIPS3_NIC_CONF_E 0x4027FFFF // 16KB
#define AIPS3_NIC_CONF_S 0x4027C000

// RESERVED ADDRESS-SPACE
#define AIPS3_NIC_RESRV01_E 0x4027FFFF // 240KB
#define AIPS3_NIC_RESRV01_S 0x40240000

// RESERVED ADDRESS-SPACE
#define AIPS3_NIC_RESRV00_E 0x4023FFFF // 256KB
#define AIPS3_NIC_RESRV00_S 0x40200000
//
//
/** @AIPSFOUR: DETAILED MEMORY MAP (AIPS-1-NIC-PORTS) */
// LPI2C4
#define AIPS4_NIC_LPI2C4_E 0x403FFFFF // 16KB
#define AIPS4_NIC_LPI2C4_S 0x403FC000

// LPI2C3
#define AIPS4_NIC_LPI2C3_E 0x403FBFFF // 16KB
#define AIPS4_NIC_LPI2C3_S 0x403F8000

// LPI2C2
#define AIPS4_NIC_LPI2C2_E 0x403F7FFF // 16KB
#define AIPS4_NIC_LPI2C2_S 0x403F4000

// LPI2C1
#define AIPS4_NIC_LPI2C1_E 0x403F3FFF // 16KB
#define AIPS4_NIC_LPI2C1_S 0x403F0000

// BEE
#define AIPS4_NIC_BEE_E 0x403EFFFF // 16KB
#define AIPS4_NIC_BEE_S 0x403EC000

// FLEX XPWM 4
#define AIPS4_NIC_FLEX_XPWM4_E 0x403EBFFF // 16KB
#define AIPS4_NIC_FLEX_XPWM4_S 0x403E8000

// FLEX XPWM 3
#define AIPS4_NIC_FLEX_XPWM3_E 0x403E7FFF // 16KB
#define AIPS4_NIC_FLEX_XPWM3_S 0x403E4000

// FLEX XPWM 2
#define AIPS4_NIC_FLEC_XPWM2_E 0x403E3FFF // 16KB
#define AIPS4_NIC_FLEC_XPWM2_S 0x403E0000

// FLEX XPWM 1
#define AIPS4_NIC_FLEX_XPWM1_E 0x403DFFFF // 16KB
#define AIPS4_NIC_FLEX_XPWM1_S 0x403DC000

// RESERVED ADDRESS-SPACE
#define AIPS4_NIC_RESRV06_E 0x403DBFFF // 16KB
#define AIPS4_NIC_RESRV06_S 0x403D8000

// ENC 4
#define AIPS4_NIC_ENC4_E 0x403D7FFF // 16KB
#define AIPS4_NIC_ENC4_S 0x403D4000

// ENC 3
#define AIPS4_NIC_ENC3_E 0x403D3FFF // 16KB
#define AIPS4_NIC_ENC3_S 0x403D0000

// ENC 2
#define AIPS4_NIC_ENC2_E 0x403CFFFF // 16KB
#define AIPS4_NIC_ENC2_S 0x403CC000

// ENC 1
#define AIPS4_NIC_ENC1_E 0x403CBFFF // 16KB
#define AIPS4_NIC_ENC1_S 0x403C8000

// XBAR 3
#define AIPS4_NIC_XBAR3_E 0x403C7FFF // 16KB
#define AIPS4_NIC_XBAR3_S 0x403C4000

// XBAR 2
#define AIPS4_NIC_XBAR2_E 0x403C3FFF // 16KB
#define AIPS4_NIC_XBAR2_S 0x403C0000

// XBAR 1
#define AIPS4_NIC_XBAR1_E 0x403BFFFF // 16KB
#define AIPS4_NIC_XBAR1_S 0x403BC000

// AOI 2
#define AIPS4_NIC_AOI2_E 0x403BBFFF // 16KB
#define AIPS4_NIC_AOI2_S 0x403B8000

// AOI 1
#define AIPS4_NIC_AOI1_E 0x403B7FFF // 16KB
#define AIPS4_NIC_AOI1_S 0x403B4000

// ADC ETC
#define AIPS4_NIC_ADC_ETC_E 0x403B3FFF // 16KB
#define AIPS4_NIC_ADC_ETC_S 0x403B0000

// RESERVED ADDRESS-SPACE
#define AIPS4_NIC_RESRV05_E 0x403AFFFF // 16KB
#define AIPS4_NIC_RESRV05_S 0x403AC000

// RESERVED ADDRESS-SPACE
#define AIPS4_NIC_RESRV04_E 0x403ABFFF // 16KB
#define AIPS4_NIC_RESRV04_S 0x403A8000

// RESERVED ADDRESS-SPACE
#define AIPS4_NIC_RESRV03_E 0x403A7FFF // 16KB
#define AIPS4_NIC_RESRV03_S 0x403A4000

// LP SPI 4
#define AIPS4_NIC_LPSPI4_01_E 0x403A3FFF // 16KB
#define AIPS4_NIC_LPSPI4_01_S 0x403A0000

// LP SPI 3
#define AIPS4_NIC_LPSPI3_02_E 0x4039FFFF // 16KB
#define AIPS4_NIC_LPSPI3_02_S 0x4039C000

// LP SPI 2
#define AIPS4_NIC_LPSPI2_E 0x4039BFFF // 16KB
#define AIPS4_NIC_LPSPI2_S 0x40398000

// LP SPI 1
#define AIPS4_NIC_LPSPI1_E 0x40397FFF // 16KB
#define AIPS4_NIC_LPSPI1_S 0x40394000

// RESERVED ADDRESS-SPACE
#define AIPS4_NIC_RESRV02_E 0x40393FFF // 16KB
#define AIPS4_NIC_RESRV02_S 0x40390000

