AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
// SAI 3
#define AIPS4_NIC_SAI3_E 0x4038FFFF // 16KB
#define AIPS4_NIC_SAI3_S 0x4038C000

// SAI 2
#define AIPS4_NIC_SAI2_E 0x4038BFFF // 16KB
#define AIPS4_NIC_SAI2_S 0x40388000

// SAI 1
#define AIPS4_NIC_SAI1_E 0x40387FFF // 16KB
#define AIPS4_NIC_SAI1_S 0x40384000

// SPDIF
#define AIPS4_NIC_SPDIF_E 0x40383FFF // 16KB
#define AIPS4_NIC_SPDIF_S 0x40380000

// AIPS 4 CONFIG
#define AIPS4_NIC_CONF_E 0x4037FFFF // 16KB
#define AIPS4_NIC_CONF_S 0x4037C000

// RESERVED ADDRESS-SPACE
#define AIPS4_NIC_RESRV01_E 0x4037FFFF // 240KB
#define AIPS4_NIC_RESRV01_S 0x40340000

// RESERVED ADDRESS-SPACE
#define AIPS4_NIC_RESRV00_E 0x4033FFFF // 256KB
#define AIPS4_NIC_RESRV00_S 0x40300000
//
//
/** @AIPSONE: DETAILED MEMORY MAP (AIPS-1-NIC-PORTS) */
// Reserved off platform slots
#define AIPS5_NIC_CCM_E 0x420FFFFF // 512KB
#define AIPS5_NIC_CCM_S 0x42080000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV26_E 0x4207FFFF // 16KB
#define AIPS5_NIC_RESRV26_S 0x4207C000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV25_E 0x4207BFFF // 16KB
#define AIPS5_NIC_RESRV25_S 0x42078000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV24_E 0x42077FFF // 16KB
#define AIPS5_NIC_RESRV24_S 0x42074000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV23_E 0x42073FFF // 16KB
#define AIPS5_NIC_RESRV23_S 0x42070000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV22_E 0x4206FFFF // 16KB
#define AIPS5_NIC_RESRV22_S 0x4206C000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV21_E 0x4206BFFF // 16KB
#define AIPS5_NIC_RESRV21_S 0x42068000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV20_E 0x42067FFF // 16KB
#define AIPS5_NIC_RESRV20_S 0x42064000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV19_E 0x42063FFF // 16KB
#define AIPS5_NIC_RESRV19_S 0x42060000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV18_E 0x4205FFFF // 16KB
#define AIPS5_NIC_RESRV18_S 0x4205C000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV17_E 0x4205BFFF // 16KB
#define AIPS5_NIC_RESRV17_S 0x42058000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV16_E 0x42057FFF // 16KB
#define AIPS5_NIC_RESRV16_S 0x42054000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV15_E 0x42053FFF // 16KB
#define AIPS5_NIC_RESRV15_S 0x42050000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV14_E 0x4204FFFF // 16KB
#define AIPS5_NIC_RESRV14_S 0x4204C000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV13_E 0x4204BFFF // 16KB
#define AIPS5_NIC_RESRV13_S 0x42048000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV12_E 0x42047FFF // 16KB
#define AIPS5_NIC_RESRV12_S 0x42044000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV11_E 0x42043FFF // 16KB
#define AIPS5_NIC_RESRV11_S 0x42040000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV10_E 0x4203FFFF // 16KB
#define AIPS5_NIC_RESRV10_S 0x4203C000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV09_E 0x4203BFFF // 16KB
#define AIPS5_NIC_RESRV09_S 0x42038000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV08_E 0x42037FFF // 16KB
#define AIPS5_NIC_RESRV08_S 0x42034000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV07_E 0x42033FFF // 16KB
#define AIPS5_NIC_RESRV07_S 0x42030000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV06_E 0x4202FFFF // 16KB
#define AIPS5_NIC_RESRV06_S 0x4202C000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV05_E 0x4202BFFF // 16KB
#define AIPS5_NIC_RESRV05_S 0x42028000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV04_E 0x42027FFF // 16KB
#define AIPS5_NIC_RESRV04_S 0x42024000

// FLEX IO 3
#define AIPS5_NIC_RESRV_01_E 0x42023FFF // 16KB
#define AIPS5_NIC_RESRV_01_S 0x42020000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV03_E 0x4201FFFF // 16KB
#define AIPS5_NIC_RESRV03_S 0x4201C000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV02_E 0x4201BFFF // 16KB
#define AIPS5_NIC_RESRV02_S 0x42018000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV01_E 0x42017FFF // 16KB
#define AIPS5_NIC_RESRV01_S 0x42014000

// RESERVED ADDRESS-SPACE
#define AIPS5_NIC_RESRV00_E 0x42013FFF // 16KB
#define AIPS5_NIC_RESRV00_S 0x42010000

// GPIO9
#define AIPS5_NIC_GPIO9_E 0x4200FFFF // 16KB
#define AIPS5_NIC_GPIO9_S 0x4200C000

// GPIO8
#define AIPS5_NIC_GPIO8_E 0x4200BFFF // 16KB
#define AIPS5_NIC_GPIO8_S 0x42008000

// GPIO7
#define AIPS5_NIC_GPIO7_E 0x42007FFF // 16KB
#define AIPS5_NIC_GPIO7_S 0x42004000

// GPIO6
#define AIPS5_NIC_GPIO6_E 0x42003FFF // 16KB
#define AIPS5_NIC_GPIO6_S 0x42000000

//
//
//
//
/** @PPB: DETAILED MEMORY MAP  */
// PPB ROM
#define PPB_ALOC_PPBROM_E 0xE00FFFFF // 4KB
#define PPB_ALOC_PPBROM_S 0xE00FF000

// Processor ROM
#define PPB_ALOC_PROCROM_E 0xE00FEFFF // 4KB
#define PPB_ALOC_PROCROM_S 0xE00FE000

// SYS ROM
#define PPB_ALOC_SYSROM_E 0xE00FDFFF // 4KB
#define PPB_ALOC_SYSROM_S 0xE00FD000

// IO MUXC - SNVS GPR
#define PPB_ALOC_PPBRESRV_02_E 0xE00FCFFF // 52KB
#define PPB_ALOC_PPBRESRV_02_S 0xE00F0000

// RESERVED ADDRESS-SPACE
#define PPB_ALOC_PPBRESRV_01_E 0xE00EFFFF // 444KB
#define PPB_ALOC_PPBRESRV_01_S 0xE0081000

// MCM
#define PPB_ALOC_MCM_E 0xE0080FFF // 4KB
#define PPB_ALOC_MCM_S 0xE0080000

// RESERVED ADDRESS-SPACE
#define PPB_ALOC_PPBRESRV00_E 0xE007FFFF // 236KB
#define PPB_ALOC_PPBRESRV00_S 0xE0045000

// PPB RES
#define PPB_ALOC_PPBRES_E 0xE0044FFF // 4KB
#define PPB_ALOC_PPBRES_S 0xE0044000

// TSGEN
#define PPB_ALOC_TSGEN_E 0xE0043FFF // 4KB
#define PPB_ALOC_TSGEN_S 0xE0043000

// CTI
#define PPB_ALOC_CTI_E 0xE0042FFF // 4KB
#define PPB_ALOC_CTI_S 0xE0042000

// ETM
#define PPB_ALOC_ETM_E 0xE0041FFF // 4KB
#define PPB_ALOC_ETM_S 0xE0041000

// TPIU
#define PPB_ALOC_TPIU_E 0xE0040FFF // 4KB
#define PPB_ALOC_TPIU_S 0xE0040000

//
//
/** 4.4 DMA Mux (DMA REQUEST SINGALS FOR THE PERIPHIALS IN THE CHIP)*/

typedef enum
{
  // CH 00
  CH00_FLEXIO1_OFF = 0x0,
  CH00_FLEXIO1_ASYNC_OFF = 0x0,
  CH00_FLEXIO1_ON = 0x0,
  CH00_FLEXIO1_ASYNC_ON = 0x0,

  // CH 01
  CH01_FLEXIO2_OFF = 0x1,
  CH01_FLEXIO2_ASYNC_OFF = 0x1,
  CH01_FLEXIO2_ON = 0x1,
  CH01_FLEXIO2_ASYNC_ON = 0x1,

  // CH 02 // CH 03
  CH02_LPUART1_TX_FIFO = 0x2,
  CH02_LPUART1_TX_FIFO_ASYNC = 0x2,
  CH03_LPUART1_RX_FIFO = 0x3,
  CH03_LPUART1_RX_FIFO_ASYNC = 0x3,

