AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
  // CH 04 // CH 05
  CH04_LPUART3_TX_FIFO = 0x4,
  CH04_LPUART3_TX_FIFO_ASYNC = 0x4,
  CH05_LPUART3_RX_FIFO = 0x5,
  CH05_LPUART3_RX_FIFO_ASYNC = 0x5,

  // CH 06 // CH 07
  CH06_LPUART5_TX_FIFO = 0x6,
  CH06_LPUART5_TX_FIFO_ASYNC = 0x6,
  CH07_LPUART5_RX_FIFO = 0x7,
  CH07_LPUART5_RX_FIFO_ASYNC = 0x7,

  // CH 08 // CH 09
  CH08_LPUART7_TX_FIFO = 0x8,
  CH08_LPUART7_TX_FIFO_ASYNC = 0x8,
  CH09_LPUART7_RX_FIFO = 0x9,
  CH09_LPUART7_RX_FIFO_ASYNC = 0x9,

  // CH 10
  CH10_RESERVED = 0xa,

  // CH 11 // CH 12
  CH11_FLEXCAN3 = 0xb,
  CH12_CSI_WRITE = 0xc,

  // CH 13 // CH 14
  CH13_LPSPI1_RX_FIFO = 0xd,
  CH13_LPSPI1_RX_FIFO_ASYNC = 0xd,
  CH14_LPSPI1_TX_FIFO = 0xe,
  CH14_LPSPI1_TX_FIFO_ASYNC = 0xe,

  // CH 15 // CH 16
  CH15_LPSPI3_RX_FIFO = 0xf,
  CH15_LPSPI3_RX_FIFO_ASYNC = 0xf,
  CH16_LPSPI3_TX_FIFO = 0x10,
  CH16_LPSPI3_TX_FIFO_ASYNC = 0x10,

  // CH 17
  CH17_LPI2C1_I2C_MASTER_RX_FIFO = 0x11,
  CH17_LPI2C1_I2C_MASTER_RX_FIFO_ASYNC = 0x11,
  CH17_LPI2C1_I2C_SLAVE_RX_FIFO = 0x11,
  CH17_LPI2C1_I2C_SLAVE_RX_FIFO_ASYNC = 0x11,
  CH17_LPI2C1_I2C_MASTER_TX_FIFO = 0x11,
  CH17_LPI2C1_I2C_MASTER_TX_FIFO_ASYNC = 0x11,
  CH17_LPI2C1_I2C_SLAVE_TX_FIFO = 0x11,
  CH17_LPI2C1_I2C_SLAVE_TX_FIFO_ASYNC = 0x11,

  // CH 18
  CH18_LPI2C3_I2C_MASTER_RX_FIFO = 0x12,
  CH18_LPI2C3_I2C_MASTER_RX_FIFO_ASYNC = 0x12,
  CH18_LPI2C3_I2C_SLAVE_RX_FIFO = 0x12,
  CH18_LPI2C3_I2C_SLAVE_RX_FIFO_ASYNC = 0x12,
  CH18_LPI2C3_I2C_MASTER_TX_FIFO = 0x12,
  CH18_LPI2C3_I2C_MASTER_TX_FIFO_ASYNC = 0x12,
  CH18_LPI2C3_I2C_SLAVE_TX_FIFO = 0x12,
  CH18_LPI2C3_I2C_SLAVE_TX_FIFO_ASYNC = 0x12,

  // CH 19 // CH 20 // CH 21 // CH 22
  CH19_SAI1_RX_FIFO = 0x13,
  CH20_SAI1_TX_FIFO = 0x14,
  CH21_SAI2_RX_FIFO = 0x15,
  CH22_SAI2_TX_FIFO = 0x16,

  // CH 23 // CH 24
  CH23_ADC_ETC = 0x17,
  CH24_ADC1 = 0x18,

  CH25_ACMP1_DMA = 0x19,
  CH26_ACMP3_DMA = 0x1a,

  CH27_RESERVED = 0x1b,

  CH28_FLEXSPI_RX_FIFO = 0x1c,
  CH29_FLEXSPI_TX_FIFO = 0x1d,

  CH30_XBAR1_REQ0 = 0x1e,
  CH31_XBAR1_REQ1 = 0x1f,

  CH32_FLEXPWN1_READ_CAPTURE_REGS_SUBMOD_PWM0 = 0x20,
  CH33_FLEXPWN1_READ_CAPTURE_REGS_SUBMOD_PWM1 = 0x21,
  CH34_FLEXPWN1_READ_CAPTURE_REGS_SUBMOD_PWM2 = 0x22,
  CH35_FLEXPWN1_READ_CAPTURE_REGS_SUBMOD_PWM3 = 0x23,

  CH36_FLEXPWN1_WRITE_CAPTURE_REGS_SUBMOD_PWM0 = 0x24,
  CH37_FLEXPWN1_WRITE_CAPTURE_REGS_SUBMOD_PWM1 = 0x25,
  CH38_FLEXPWN1_WRITE_CAPTURE_REGS_SUBMOD_PWM2 = 0x26,
  CH39_FLEXPWN1_WRITE_CAPTURE_REGS_SUBMOD_PWM3 = 0x27,

  CH40_FLEXPWN3_READ_CAPTURE_REGS_SUBMOD_PWM0 = 0x28,
  CH41_FLEXPWN3_READ_CAPTURE_REGS_SUBMOD_PWM1 = 0x29,
  CH42_FLEXPWN3_READ_CAPTURE_REGS_SUBMOD_PWM2 = 0x2a,
  CH43_FLEXPWN3_READ_CAPTURE_REGS_SUBMOD_PWM3 = 0x2b,

  CH44_FLEXPWN3_WRITE_CAPTURE_REGS_SUBMOD_PWM0 = 0x2c,
  CH45_FLEXPWN3_WRITE_CAPTURE_REGS_SUBMOD_PWM1 = 0x2d,
  CH46_FLEXPWN3_WRITE_CAPTURE_REGS_SUBMOD_PWM2 = 0x2e,
  CH47_FLEXPWN3_WRITE_CAPTURE_REGS_SUBMOD_PWM3 = 0x2f,

  CH48_QTIMER1_READ_CAPTURE_IN_TIMER0 = 0x30,
  CH49_QTIMER1_READ_CAPTURE_IN_TIMER1 = 0x31,
  CH50_QTIMER1_READ_CAPTURE_IN_TIMER2 = 0x32,
  CH51_QTIMER1_READ_CAPTURE_IN_TIMER3 = 0x33,

  CH52_QTIMER1_WRITE_CMPLD1_INTIMER0 = 0x34,
  CH52_QTIMER1_WRITE_CMPLD2_INTIMER1 = 0x34,

  CH53_QTIMER1_WRITE_CMPLD1_INTIMER1 = 0x35,
  CH53_QTIMER1_WRITE_CMPLD2_INTIMER0 = 0x35,

  CH54_QTIMER1_WRITE_CMPLD1_INTIMER2 = 0x36,
  CH54_QTIMER1_WRITE_CMPLD2_INTIMER3 = 0x36,

  CH55_QTIMER1_WRITE_CMPLD1_INTIMER3 = 0x37,
  CH55_QTIMER1_WRITE_CMPLD2_INTIMER2 = 0x37,

  CH56_QTIMER3_WRITE_CAPT_INTIMER0 = 0x38,
  CH56_QTIMER3_WRITE_CMPLD1_INTIMER0 = 0x38,
  CH56_QTIMER3_WRITE_CMPLD2_INTIMER1 = 0x38,

  CH57_QTIMER3_WRITE_CAPT_INTIMER1 = 0x39,
  CH57_QTIMER3_WRITE_CMPLD1_INTIMER1 = 0x39,
  CH57_QTIMER3_WRITE_CMPLD2_INTIMER0 = 0x39,

  CH58_QTIMER3_WRITE_CAPT_INTIMER2 = 0x3a,
  CH58_QTIMER3_WRITE_CMPLD1_INTIMER2 = 0x3a,
  CH58_QTIMER3_WRITE_CMPLD2_INTIMER3 = 0x3a,

  CH59_QTIMER3_WRITE_CAPT_INTIMER3 = 0x3b,
  CH59_QTIMER3_WRITE_CMPLD1_INTIMER3 = 0x3b,
  CH59_QTIMER3_WRITE_CMPLD2_INTIMER2 = 0x3b,

  CH60_FLEXSPI2_RX_FIFO = 0x3c,
  CH61_FLEXSPI2_TX_FIFO = 0x3d,
  CH62_RESERVED = 0x3e,
  CH63_RESERVED = 0x3f,

  CH64_FLEXIO1_REQ_2 = 0x40,
  CH64_FLEXIO1_ASYNC_REQ_2 = 0x40,
  CH64_FLEXIO1_REQ_3 = 0x40,
  CH64_FLEXIO1_ASYNC_REQ_3 = 0x40,

  CH65_FLEXIO1_REQ_2 = 0x41,
  CH65_FLEXIO1_ASYNC_REQ_2 = 0x41,
  CH65_FLEXIO1_REQ_3 = 0x41,
  CH65_FLEXIO1_ASYNC_REQ_3 = 0x41,

  CH66_LPUART2_TX_FIFO = 0x42,
  CH66_LPUART2_ASYNC_TX_FIFO = 0x42,

  CH67_LPUART2_RX_FIFO = 0x43,
  CH67_LPUART2_RX_FIFO_Async = 0x43,

  CH68_LPUART4_TX_FIFO = 0x44,
  CH68_LPUART4_TX_FIFO_Async = 0x44,
  CH69_LPUART4_RX_FIFO = 0x45,
  CH69_LPUART4_RX_FIFO_Async = 0x45,

  CH70_LPUART6_TX_FIFO = 0x46,
  CH70_LPUART6_TX_FIFO_Async = 0x46,
  CH71_LPUART6_RX_FIFO = 0x47,
  CH71_LPUART6_RX_FIFO_Async = 0x47,

  CH72_LPUART8_TX_FIFO_ = 0x48,
  CH72_LPUART8_TX_FIFO_Async = 0x48,
  CH73_LPUART8_RX_FIFO = 0x49,
  CH73_LPUART8_RX_FIFO_Async = 0x49,

  CH74_Reserved = 0x4a,

  CH75_PXP_DMA_Event = 0x4b,
  CH76_LCDIF_DMA_Event = 0x4c,

  CH77_LPSPI2_RX_FIFO = 0x4d,
  CH77_LPSPI2_RX_FIFO_Async = 0x4d,
  CH78_LPSPI2_TX_FIFO = 0x4e,
  CH78_LPSPI2_TX_FIFO_Async = 0x4e,

  CH79_LPSPI4_RX_FIFO = 0x4f,
  CH79_LPSPI4_RX_FIFO_Async = 0x4f,
  CH80_LPSPI4_TX_FIFO = 0x50,
  CH80_LPSPI4_TX_FIFO_Async = 0x50,

  CH81_LPI2C2_Master_RX_FIFO_DMA = 0x51,
  CH81_LPI2C2_Master_RX_FIFO_Async_DMA = 0x51,
  CH81_LPI2C2_Slave_RX_FIFO_DMA = 0x51,
  CH81_LPI2C2_Slave_RX_FIFO_Async_DMA = 0x51,
  CH81_LPI2C2_Master0_TX_FIFO = 0x51,
  CH81_LPI2C2_Master0_TX_FIFO_Async = 0x51,
  CH81_LPI2C2_Master1_TX_FIFO = 0x51,
  CH81_LPI2C2_Master1_TX_FIFO_Async = 0x51,

  CH82_LPI2C4_Master_RX_FIFO = 0x52,
  CH82_LPI2C4_Master_RX_FIFO_Asyn = 0x52,
  CH82_LPI2C4_Slave_RX_FIFO = 0x52,
  CH82_LPI2C4_Slave_RX_FIFO_Async = 0x52,
  CH82_LPI2C4_Master0_TX_FIFO = 0x52,
  CH82_LPI2C4_Master0_TX_FIFO_Async = 0x52,
  CH82_LPI2C4_Master1_TX_FIFO = 0x52,
  CH82_LPI2C4_Master1_TX_FIFO_Async = 0x52,

  CH83_SAI3_RX_FIFO = 0x53,
  CH84_SAI3_TX_FIFO = 0x54,

  CH85_SPDIF_RX = 0x55,
  CH86_SPDIF_TX = 0x56,

  CH87_Reserved = 0x57,
  CH88_ADC2 = 0x58,
  CH89_ACMP2 = 0x59,
  CH90_ACMP4 = 0x5a,

  CH91_Reserved = 0x5b,
  CH92_ENET_TIMER_REQ0 = 0x5c,
  CH93_ENET_TIMER_REQ1 = 0x5d,

  CH94_XBAR1_2 = 0x5e,
  CH95_XBAR1_3 = 0x5f,

  CH96_FLEXPWM2_READ_REQ_CAPTURE_REGS_SUBMOD_PWM0 = 0x60,
  CH97_FLEXPWM2_READ_REQ_CAPTURE_REGS_SUBMOD_PWM1 = 0x61,
  CH98_FLEXPWM2_READ_REQ_CAPTURE_REGS_SUBMOD_PWM2 = 0x62,
  CH99_FLEXPWM2_READ_REQ_CAPTURE_REGS_SUBMOD_PWM3 = 0x63,

  CH100_FLEXPWM2_WRITE_REQ_VAL_REGS_SUBMOD_PWM0 = 0x64,
  CH101_FLEXPWM2_WRITE_REQ_VAL_REGS_SUBMOD_PWM1 = 0x65,
  CH102_FLEXPWM2_WRITE_REQ_VAL_REGS_SUBMOD_PWM2 = 0x66,
  CH103_FLEXPWM2_WRITE_REQ_VAL_REGS_SUBMOD_PWM3 = 0x67,

  CH104_FLEXPWM4_READ_REQ_CAPTURE_REGS_SUBMOD_PWM0 = 0x68,
  CH105_FLEXPWM4_READ_REQ_CAPTURE_REGS_SUBMOD_PWM1 = 0x69,
  CH106_FLEXPWM4_READ_REQ_CAPTURE_REGS_SUBMOD_PWM2 = 0x6a,
  CH107_FLEXPWM4_READ_REQ_CAPTURE_REGS_SUBMOD_PWM3 = 0x6b,

  CH108_FLEXPWM4_WRITE_REQ_VAL_REGS_SUBMOD_PWM0 = 0x6c,
  CH109_FLEXPWM4_WRITE_REQ_VAL_REGS_SUBMOD_PWM1 = 0x6d,
  CH110_FLEXPWM4_WRITE_REQ_VAL_REGS_SUBMOD_PWM2 = 0x6e,
  CH111_FLEXPWM4_WRITE_REQ_VAL_REGS_SUBMOD_PWM3 = 0x6f,

  CH112_QTIMER2_READ_REQUEST_CAPT_timer0 = 0x70,
  CH113_QTIMER2_READ_REQUEST_CAPT_timer1 = 0x71,
  CH114_QTIMER2_READ_REQUEST_CAPT_timer2 = 0x72,
  CH115_QTIMER2_READ_REQUEST_CAPT_timer3 = 0x73,

