AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
  CH116_QTIMER2_WRITE_REQ_cmpld1_intimer0 = 0x74,
  CH116_QTIMER2_WRITE_REQ_cmpld2_intimer1 = 0x74,
  CH117_QTIMER2_WRITE_REQ_cmpld1_intimer1 = 0x75,
  CH117_QTIMER2_WRITE_REQ_cmpld2_intimer0 = 0x75,

  CH118_QTIMER2_WRITE_REQ_cmpld1_intimer2 = 0x76,
  CH118_QTIMER2_WRITE_REQ_cmpld2_intimer3 = 0x76,
  CH119_QTIMER2_WRITE_REQ_cmpld1_intimer3 = 0x77,
  CH119_QTIMER2_WRITE_REQ_cmpld2_intimer2 = 0x77,

  CH120_QTIMER4_WRITE_REQ_capt_intimer0 = 0x78,
  CH120_QTIMER4_WRITE_REQ_cmpld1_intimer0 = 0x78,
  CH120_QTIMER4_WRITE_REQ_cmpld2_intimer1 = 0x78,

  CH121_QTIMER4_WRITE_REQ_capt_intimer1 = 0x79,
  CH121_QTIMER4_WRITE_REQ_cmpld1_intimer1 = 0x79,
  CH121_QTIMER4_WRITE_REQ_cmpld2_intimer0 = 0x79,

  CH122_QTIMER4_WRITE_REQ_capt_intimer2 = 0x7a,
  CH122_QTIMER4_WRITE_REQ_cmpld1_intimer2 = 0x7a,
  CH122_QTIMER4_WRITE_REQ_cmpld2_intimer3 = 0x7a,

  CH123_QTIMER4_WRITE_REQ_capt_intimer3 = 0x7b,
  CH123_QTIMER4_WRITE_REQ_cmpld1_intimer3 = 0x7b,
  CH123_QTIMER4_WRITE_REQ_cmpld2_intimer2 = 0x7b,

  CH124_ENET2_TIMER_REQ0 = 0x7c,
  CH125_ENET2_TIMER_REQ1 = 0x7d,
  CH126_RESERVED = 0x7e,
  CH127_RESERVED = 0x7f,

} DMA_REQUESTS_MUX_CHANNELS; // DirectMemoryAccessMultiplexer;

/**
 *  @brief: Modes of Operation for MDA channels
 *
 *  DISOABLED MODE -
 *  In this mode, the DMA channel is disabled. Because disabling and enabling of
 *  DMAchannels is done primarily via the DMA configuration registers, this
 *  mode is usedmainly as the reset state for a DMA channel in the DMA channel
 *  MUX. It may alsobe used to temporarily suspend a DMA channel while
 *  reconfiguration of the systemtakes place, for example, changing the period
 *  of a DMA trigger.
 *
 *  NORMAL MODE -
 *  In this mode, a DMA source is routed directly to the specified DMA channel.
 *  Theoperation of the DMAMUX in this mode is completely transparent to the
 *  system.
 *
 *  PERIODIC TRIGGER MODE -
 *  In this mode, a DMA source may only request a DMA transfer, such as when
 *  atransmit buffer becomes empty or a receive buffer becomes full,
 *  periodically.Configuration of the period is done in the registers of the
 *  periodic interrupt timer(PIT). This mode is available only for channels 0
 *  to 3.
 *
 **/
typedef enum
{
  DISABLED,
  NORMAL,
  PERIODIC_TRIGGER
} DMA_CH_MODE;

// DMA_CH_MUX Register Memory Map p.85, chapter 5.6
#define CH_MUX_BASE    MAP_32BIT_REGISTER(0x400ec000)
#define CHCFG0_CHCFG31 CH_MUX_BASE._0x000
#define CHCFG0         CH_MUX_BASE._0x000
#define CHCFG1         CH_MUX_BASE._0x004
#define CHCFG2         CH_MUX_BASE._0x008
#define CHCFG3         CH_MUX_BASE._0x00c
#define CHCFG4         CH_MUX_BASE._0x010
#define CHCFG5         CH_MUX_BASE._0x014
#define CHCFG6         CH_MUX_BASE._0x018
#define CHCFG7         CH_MUX_BASE._0x01c

#define CHCFG8  CH_MUX_BASE._0x020
#define CHCFG9  CH_MUX_BASE._0x024
#define CHCFG10 CH_MUX_BASE._0x028
#define CHCFG11 CH_MUX_BASE._0x02c
#define CHCFG12 CH_MUX_BASE._0x030
#define CHCFG13 CH_MUX_BASE._0x034
#define CHCFG14 CH_MUX_BASE._0x038
#define CHCFG15 CH_MUX_BASE._0x03c

#define CHCFG16 CH_MUX_BASE._0x040
#define CHCFG17 CH_MUX_BASE._0x044
#define CHCFG18 CH_MUX_BASE._0x048
#define CHCFG19 CH_MUX_BASE._0x04c
#define CHCFG20 CH_MUX_BASE._0x050
#define CHCFG21 CH_MUX_BASE._0x054
#define CHCFG22 CH_MUX_BASE._0x058
#define CHCFG23 CH_MUX_BASE._0x05c

#define CHCFG24 CH_MUX_BASE._0x060
#define CHCFG25 CH_MUX_BASE._0x064
#define CHCFG26 CH_MUX_BASE._0x068
#define CHCFG27 CH_MUX_BASE._0x06c
#define CHCFG28 CH_MUX_BASE._0x070
#define CHCFG29 CH_MUX_BASE._0x074
#define CHCFG30 CH_MUX_BASE._0x078
#define CHCFG31 CH_MUX_BASE._0x07c

/**
 * @brief: eDMA Memory Map/Register (Enhanced Direct Memory Access) p.89 ,
 * chapter 6 The eDMA's programming model is partitioned into two regions: • The
 * first region defines a number of registers providing control functions • The
 * second region corresponds to the local transfer control descriptor (TCD)
 * memory
 *
 * TCD memory:
 * Each channel requires a 32-byte transfer control descriptor for defining the
 * desired data movement operation. The channel descriptors are stored in the
 * local memory insequential order: channel 0, channel 1, ... channel 31. Each
 * TCDn definition is presentedas 11 registers of 16 or 32 bit
 */
// DMA Memory map/register  p.115 - P. 173, chapter 6.6  // ACCESS, DESCRIPTION
#define DMA_32BASE MAP_32BIT_REGISTER(0x400e8000)
#define DMA_8BASE0 MAP_8BIT_REGISTER(0x400e8000)
#define DMA_CR     DMA_32BASE._0x0000 // R/W, Control Register
#define DMA_ESR    DMA_32BASE._0x0004 // READ ONLY, Err. Status Register
#define DMA_ERQR   DMA_32BASE._0x000c // R/W, Enable Request Register

#define DMA_EEI   DMA_32BASE._0x0014 // WORZ, Enable Err. Interrupt Register
#define DMA_CEEI  DMA_8BASE0._0x018 // WORZ, Clear Enable Err. Interrupt Register
#define DMA_SEEI  DMA_8BASE0._0x019 // WORZ, Set Enable Err. Interrupt Register
#define DMA_CERQR DMA_8BASE0._0x01a // WORZ, Clear Enable Request Register
#define DMA_SERQR DMA_8BASE0._0x01b // WORZ, Set Enable Request Register

#define DMA_CDNE DMA_32BASE._0x001c // WORZ, Clear DONE Status Bit Register
#define DMA_SSBR DMA_8BASE0._0x01d  // WORZ, Set Start Bit Register /// FIX
#define DMA_CERR DMA_8BASE0._0x01e  // WORZ, Clear Error Register
#define DMA_CINT DMA_8BASE0._0x01f  // WORZ, Clear Interrupt Request Register

#define DMA_INT  DMA_32BASE._0x0024 // W1C, Interrupt Request Register
#define DMA_ERR  DMA_32BASE._0x002c // W1C, Error Register
#define DMA_HRSR DMA_32BASE._0x0034 // READ ONLY, Hardware Req. Stat. Register
#define DMA_EARS DMA_32BASE._0x0044 // R/W, Enable Async. Req. in Stop Register

// Channel Priority Register  -- 6.6.5.18
#define DMA_8BASE1  MAP_8BIT_REGISTER(0x400e8000 + 0x100)
#define DMA_CHPRI03 DMA_8BASE1._0x000 // R/W, Channel Priority 3 Register
#define DMA_CHPRI02 DMA_8BASE1._0x001 // R/W, Channel Priority 2 Register
#define DMA_CHPRI01 DMA_8BASE1._0x002 // R/W, Channel Priority 1 Register
#define DMA_CHPRI00 DMA_8BASE1._0x003 // R/W, Channel Priority 0 Register

#define DMA_CHPRI07 DMA_8BASE1._0x004 // R/W, Channel Priority 7 Register
#define DMA_CHPRI06 DMA_8BASE1._0x005 // R/W, Channel Priority 6 Register
#define DMA_CHPRI05 DMA_8BASE1._0x006 // R/W, Channel Priority 5 Register
#define DMA_CHPRI04 DMA_8BASE1._0x007 // R/W, Channel Priority 4 Register

