AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
#define DMA_CHPRI11 DMA_8BASE1._0x008 // R/W, Channel Priority 11 Register
#define DMA_CHPRI10 DMA_8BASE1._0x009 // R/W, Channel Priority 10 Register
#define DMA_CHPRI09 DMA_8BASE1._0x00a // R/W, Channel Priority 9 Register
#define DMA_CHPRI08 DMA_8BASE1._0x00b // R/W, Channel Priority 8 Register

#define DMA_CHPRI15 DMA_8BASE1._0x00c // R/W, Channel Priority 15 Register
#define DMA_CHPRI14 DMA_8BASE1._0x00d // R/W, Channel Priority 14 Register
#define DMA_CHPRI13 DMA_8BASE1._0x00e // R/W, Channel Priority 13 Register
#define DMA_CHPRI12 DMA_8BASE1._0x00f // R/W, Channel Priority 12 Register

#define DMA_CHPRI19 DMA_8BASE1._0x010 // R/W, Channel Priority 19 Register
#define DMA_CHPRI18 DMA_8BASE1._0x011 // R/W, Channel Priority 18 Register
#define DMA_CHPRI17 DMA_8BASE1._0x012 // R/W, Channel Priority 17 Register
#define DMA_CHPRI16 DMA_8BASE1._0x013 // R/W, Channel Priority 16 Register

#define DMA_CHPRI23 DMA_8BASE1._0x014 // R/W, Channel Priority 23 Register
#define DMA_CHPRI22 DMA_8BASE1._0x015 // R/W, Channel Priority 22 Register
#define DMA_CHPRI21 DMA_8BASE1._0x016 // R/W, Channel Priority 21 Register
#define DMA_CHPRI20 DMA_8BASE1._0x017 // R/W, Channel Priority 20 Register

#define DMA_CHPRI27 DMA_8BASE1._0x018 // R/W, Channel Priority 27 Register
#define DMA_CHPRI26 DMA_8BASE1._0x019 // R/W, Channel Priority 26 Register
#define DMA_CHPRI25 DMA_8BASE1._0x01a // R/W, Channel Priority 25 Register
#define DMA_CHPRI24 DMA_8BASE1._0x01b // R/W, Channel Priority 24 Register

#define DMA_CHPRI31 DMA_8BASE1._0x01c // R/W, Channel Priority 31 Register
#define DMA_CHPRI30 DMA_8BASE1._0x01d // R/W, Channel Priority 30 Register
#define DMA_CHPRI29 DMA_8BASE1._0x01e // R/W, Channel Priority 29 Register
#define DMA_CHPRI28 DMA_8BASE1._0x01f // R/W, Channel Priority 28 Register

// TCD Source Addresses [0,31] -- 6.6.5.19
// 1000 + (N * 20), N = [0, 31]
#define DMA_TCD_32BASE00 MAP_32BIT_REGISTER(0x400e9000)
#define DMA_TCD00_SADDR  DMA_TCD_32BASE00._0x0000 // R/W, TCD Source Address 00
#define DMA_TCD01_SADDR  DMA_TCD_32BASE00._0x0020 // R/W, TCD Source Address 01
#define DMA_TCD02_SADDR  DMA_TCD_32BASE00._0x0040 // R/W, TCD Source Address 02
#define DMA_TCD03_SADDR  DMA_TCD_32BASE00._0x0060 // R/W, TCD Source Address 03

#define DMA_TCD04_SADDR DMA_TCD_32BASE00._0x0080 // R/W, TCD Source Address 04
#define DMA_TCD05_SADDR DMA_TCD_32BASE00._0x00a0 // R/W, TCD Source Address 05
#define DMA_TCD06_SADDR DMA_TCD_32BASE00._0x00c0 // R/W, TCD Source Address 06
#define DMA_TCD07_SADDR DMA_TCD_32BASE00._0x00e0 // R/W, TCD Source Address 07

#define DMA_TCD08_SADDR DMA_TCD_32BASE00._0x0100 // R/W, TCD Source Address 08
#define DMA_TCD09_SADDR DMA_TCD_32BASE00._0x0120 // R/W, TCD Source Address 09
#define DMA_TCD10_SADDR DMA_TCD_32BASE00._0x0140 // R/W, TCD Source Address 10
#define DMA_TCD11_SADDR DMA_TCD_32BASE00._0x0160 // R/W, TCD Source Address 11

#define DMA_TCD12_SADDR DMA_TCD_32BASE00._0x0180 // R/W, TCD Source Address 12
#define DMA_TCD13_SADDR DMA_TCD_32BASE00._0x01a0 // R/W, TCD Source Address 13
#define DMA_TCD14_SADDR DMA_TCD_32BASE00._0x01c0 // R/W, TCD Source Address 14
#define DMA_TCD15_SADDR DMA_TCD_32BASE00._0x01e0 // R/W, TCD Source Address 15

#define DMA_TCD16_SADDR DMA_TCD_32BASE00._0x0200 // R/W, TCD Source Address 16
#define DMA_TCD17_SADDR DMA_TCD_32BASE00._0x0220 // R/W, TCD Source Address 17
#define DMA_TCD18_SADDR DMA_TCD_32BASE00._0x0240 // R/W, TCD Source Address 18
#define DMA_TCD19_SADDR DMA_TCD_32BASE00._0x0260 // R/W, TCD Source Address 19

#define DMA_TCD20_SADDR DMA_TCD_32BASE00._0x0280 // R/W, TCD Source Address 20
#define DMA_TCD21_SADDR DMA_TCD_32BASE00._0x02a0 // R/W, TCD Source Address 21
#define DMA_TCD22_SADDR DMA_TCD_32BASE00._0x02c0 // R/W, TCD Source Address 22
#define DMA_TCD23_SADDR DMA_TCD_32BASE00._0x02e0 // R/W, TCD Source Address 23

#define DMA_TCD24_SADDR DMA_TCD_32BASE00._0x0300 // R/W, TCD Source Address 24
#define DMA_TCD25_SADDR DMA_TCD_32BASE00._0x0320 // R/W, TCD Source Address 25
#define DMA_TCD26_SADDR DMA_TCD_32BASE00._0x0340 // R/W, TCD Source Address 26
#define DMA_TCD27_SADDR DMA_TCD_32BASE00._0x0360 // R/W, TCD Source Address 27

#define DMA_TCD28_SADDR DMA_TCD_32BASE00._0x0380 // R/W, TCD Source Address 28
#define DMA_TCD29_SADDR DMA_TCD_32BASE00._0x03a0 // R/W, TCD Source Address 29
#define DMA_TCD30_SADDR DMA_TCD_32BASE00._0x03c0 // R/W, TCD Source Address 30
#define DMA_TCD31_SADDR DMA_TCD_32BASE00._0x03e0 // R/W, TCD Source Address 31
//==

// TCD Signed Source Address Offsets [0,31] -- 6.6.5.20
// 1000 + (N * 20), N = [0, 31]
#define DMA_TCD_16BASE00 MAP_16BIT_REGISTER(0x400e9004)
#define DMA_TCD00_OFFS   DMA_TCD_16BASE00._0x0000 // R/W, TCD Src. Addr. Offs. 00
#define DMA_TCD01_OFFS   DMA_TCD_16BASE00._0x0020 // R/W, TCD Src. Addr. Offs. 01
#define DMA_TCD02_OFFS   DMA_TCD_16BASE00._0x0040 // R/W, TCD Src. Addr. Offs. 02
#define DMA_TCD03_OFFS   DMA_TCD_16BASE00._0x0060 // R/W, TCD Src. Addr. Offs. 03

#define DMA_TCD04_OFFS DMA_TCD_16BASE00._0x0080 // R/W, TCD Src. Addr. Offs. 04
#define DMA_TCD05_OFFS DMA_TCD_16BASE00._0x00a0 // R/W, TCD Src. Addr. Offs. 05
#define DMA_TCD06_OFFS DMA_TCD_16BASE00._0x00c0 // R/W, TCD Src. Addr. Offs. 06
#define DMA_TCD07_OFFS DMA_TCD_16BASE00._0x00e0 // R/W, TCD Src. Addr. Offs. 07

#define DMA_TCD08_OFFS DMA_TCD_16BASE00._0x0100 // R/W, TCD Src. Addr. Offs. 08
#define DMA_TCD09_OFFS DMA_TCD_16BASE00._0x0120 // R/W, TCD Src. Addr. Offs. 09
#define DMA_TCD10_OFFS DMA_TCD_16BASE00._0x0140 // R/W, TCD Src. Addr. Offs. 10
#define DMA_TCD11_OFFS DMA_TCD_16BASE00._0x0160 // R/W, TCD Src. Addr. Offs. 11

#define DMA_TCD12_OFFS DMA_TCD_16BASE00._0x0180 // R/W, TCD Src. Addr. Offs. 12
#define DMA_TCD13_OFFS DMA_TCD_16BASE00._0x01a0 // R/W, TCD Src. Addr. Offs. 13
#define DMA_TCD14_OFFS DMA_TCD_16BASE00._0x01c0 // R/W, TCD Src. Addr. Offs. 14
#define DMA_TCD15_OFFS DMA_TCD_16BASE00._0x01e0 // R/W, TCD Src. Addr. Offs. 15

#define DMA_TCD16_OFFS DMA_TCD_16BASE00._0x0200 // R/W, TCD Src. Addr. Offs. 16
#define DMA_TCD17_OFFS DMA_TCD_16BASE00._0x0220 // R/W, TCD Src. Addr. Offs. 17
#define DMA_TCD18_OFFS DMA_TCD_16BASE00._0x0240 // R/W, TCD Src. Addr. Offs. 18
#define DMA_TCD19_OFFS DMA_TCD_16BASE00._0x0260 // R/W, TCD Src. Addr. Offs. 19

