AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
#define DMA_TCD20_OFFS DMA_TCD_16BASE00._0x0280 // R/W, TCD Src. Addr. Offs. 20
#define DMA_TCD21_OFFS DMA_TCD_16BASE00._0x02a0 // R/W, TCD Src. Addr. Offs. 21
#define DMA_TCD22_OFFS DMA_TCD_16BASE00._0x02c0 // R/W, TCD Src. Addr. Offs. 22
#define DMA_TCD23_OFFS DMA_TCD_16BASE00._0x02e0 // R/W, TCD Src. Addr. Offs. 23

#define DMA_TCD24_OFFS DMA_TCD_16BASE00._0x0300 // R/W, TCD Src. Addr. Offs. 24
#define DMA_TCD25_OFFS DMA_TCD_16BASE00._0x0320 // R/W, TCD Src. Addr. Offs. 25
#define DMA_TCD26_OFFS DMA_TCD_16BASE00._0x0340 // R/W, TCD Src. Addr. Offs. 26
#define DMA_TCD27_OFFS DMA_TCD_16BASE00._0x0360 // R/W, TCD Src. Addr. Offs. 27

#define DMA_TCD28_OFFS DMA_TCD_16BASE00._0x0380 // R/W, TCD Src. Addr. Offs. 28
#define DMA_TCD29_OFFS DMA_TCD_16BASE00._0x03a0 // R/W, TCD Src. Addr. Offs. 29
#define DMA_TCD30_OFFS DMA_TCD_16BASE00._0x03c0 // R/W, TCD Src. Addr. Offs. 30
#define DMA_TCD31_OFFS DMA_TCD_16BASE00._0x03e0 // R/W, TCD Src. Addr. Offs. 31
//==

// TCD Transfer Attributes  [0,31] -- 6.6.5.21
// 1000 + (N * 20), N = [0, 31]
#define DMA_TCD_16BASE01 MAP_16BIT_REGISTER(0x400e9006)
#define DMA_TCD00_ATTR   DMA_TCD_16BASE01._0x0000 // R/W, TCD Trans. Attr. 00
#define DMA_TCD01_ATTR   DMA_TCD_16BASE01._0x0020 // R/W, TCD Trans. Attr. 01
#define DMA_TCD02_ATTR   DMA_TCD_16BASE01._0x0040 // R/W, TCD Trans. Attr. 02
#define DMA_TCD03_ATTR   DMA_TCD_16BASE01._0x0060 // R/W, TCD Trans. Attr. 03

#define DMA_TCD04_ATTR DMA_TCD_16BASE01._0x0080 // R/W, TCD Trans. Attr. 04
#define DMA_TCD05_ATTR DMA_TCD_16BASE01._0x00a0 // R/W, TCD Trans. Attr. 05
#define DMA_TCD06_ATTR DMA_TCD_16BASE01._0x00c0 // R/W, TCD Trans. Attr. 06
#define DMA_TCD07_ATTR DMA_TCD_16BASE01._0x00e0 // R/W, TCD Trans. Attr. 07

#define DMA_TCD08_ATTR DMA_TCD_16BASE01._0x0100 // R/W, TCD Trans. Attr. 08
#define DMA_TCD09_ATTR DMA_TCD_16BASE01._0x0120 // R/W, TCD Trans. Attr. 09
#define DMA_TCD10_ATTR DMA_TCD_16BASE01._0x0140 // R/W, TCD Trans. Attr. 10
#define DMA_TCD11_ATTR DMA_TCD_16BASE01._0x0160 // R/W, TCD Trans. Attr. 11

#define DMA_TCD12_ATTR DMA_TCD_16BASE01._0x0180 // R/W, TCD Trans. Attr. 12
#define DMA_TCD13_ATTR DMA_TCD_16BASE01._0x01a0 // R/W, TCD Trans. Attr. 13
#define DMA_TCD14_ATTR DMA_TCD_16BASE01._0x01c0 // R/W, TCD Trans. Attr. 14
#define DMA_TCD15_ATTR DMA_TCD_16BASE01._0x01e0 // R/W, TCD Trans. Attr. 15

#define DMA_TCD16_ATTR DMA_TCD_16BASE01._0x0200 // R/W, TCD Trans. Attr. 16
#define DMA_TCD17_ATTR DMA_TCD_16BASE01._0x0220 // R/W, TCD Trans. Attr. 17
#define DMA_TCD18_ATTR DMA_TCD_16BASE01._0x0240 // R/W, TCD Trans. Attr. 18
#define DMA_TCD19_ATTR DMA_TCD_16BASE01._0x0260 // R/W, TCD Trans. Attr. 19

#define DMA_TCD20_ATTR DMA_TCD_16BASE01._0x0280 // R/W, TCD Trans. Attr. 20
#define DMA_TCD21_ATTR DMA_TCD_16BASE01._0x02a0 // R/W, TCD Trans. Attr. 21
#define DMA_TCD22_ATTR DMA_TCD_16BASE01._0x02c0 // R/W, TCD Trans. Attr. 22
#define DMA_TCD23_ATTR DMA_TCD_16BASE01._0x02e0 // R/W, TCD Trans. Attr. 23

#define DMA_TCD24_ATTR DMA_TCD_16BASE01._0x0300 // R/W, TCD Trans. Attr. 24
#define DMA_TCD25_ATTR DMA_TCD_16BASE01._0x0320 // R/W, TCD Trans. Attr. 25
#define DMA_TCD26_ATTR DMA_TCD_16BASE01._0x0340 // R/W, TCD Trans. Attr. 26
#define DMA_TCD27_ATTR DMA_TCD_16BASE01._0x0360 // R/W, TCD Trans. Attr. 27

#define DMA_TCD28_ATTR DMA_TCD_16BASE01._0x0380 // R/W, TCD Trans. Attr. 28
#define DMA_TCD29_ATTR DMA_TCD_16BASE01._0x03a0 // R/W, TCD Trans. Attr. 29
#define DMA_TCD30_ATTR DMA_TCD_16BASE01._0x03c0 // R/W, TCD Trans. Attr. 30
#define DMA_TCD31_ATTR DMA_TCD_16BASE01._0x03e0 // R/W, TCD Trans. Attr. 31

//==
// TCD MBC NBYTES MLNO
// TCD Minor Byte Count  [0,31] -- 6.6.5.22
// 1000 + (N * 20), N = [0, 31]
#define DMA_TCD_32BASE01   MAP_32BIT_REGISTER(0x400e9008)
#define DMA_TCD00_MBC_MLNO DMA_TCD_32BASE01._0x0000 // R/W, TCD MBC 00
#define DMA_TCD01_MBC_MLNO DMA_TCD_32BASE01._0x0020 // R/W, TCD MBC 01
#define DMA_TCD02_MBC_MLNO DMA_TCD_32BASE01._0x0040 // R/W, TCD MBC 02
#define DMA_TCD03_MBC_MLNO DMA_TCD_32BASE01._0x0060 // R/W, TCD MBC 03

#define DMA_TCD04_MBC_MLNO DMA_TCD_32BASE01._0x0080 // R/W, TCD MBC 04
#define DMA_TCD05_MBC_MLNO DMA_TCD_32BASE01._0x00a0 // R/W, TCD MBC 05
#define DMA_TCD06_MBC_MLNO DMA_TCD_32BASE01._0x00c0 // R/W, TCD MBC 06
#define DMA_TCD07_MBC_MLNO DMA_TCD_32BASE01._0x00e0 // R/W, TCD MBC 07

#define DMA_TCD08_MBC_MLNO DMA_TCD_32BASE01._0x0100 // R/W, TCD MBC 08
#define DMA_TCD09_MBC_MLNO DMA_TCD_32BASE01._0x0120 // R/W, TCD MBC 09
#define DMA_TCD10_MBC_MLNO DMA_TCD_32BASE01._0x0140 // R/W, TCD MBC 10
#define DMA_TCD11_MBC_MLNO DMA_TCD_32BASE01._0x0160 // R/W, TCD MBC 11

#define DMA_TCD12_MBC_MLNO DMA_TCD_32BASE01._0x0180 // R/W, TCD MBC 12
#define DMA_TCD13_MBC_MLNO DMA_TCD_32BASE01._0x01a0 // R/W, TCD MBC 13
#define DMA_TCD14_MBC_MLNO DMA_TCD_32BASE01._0x01c0 // R/W, TCD MBC 14
#define DMA_TCD15_MBC_MLNO DMA_TCD_32BASE01._0x01e0 // R/W, TCD MBC 15

#define DMA_TCD16_MBC_MLNO DMA_TCD_32BASE01._0x0200 // R/W, TCD MBC 16
#define DMA_TCD17_MBC_MLNO DMA_TCD_32BASE01._0x0220 // R/W, TCD MBC 17
#define DMA_TCD18_MBC_MLNO DMA_TCD_32BASE01._0x0240 // R/W, TCD MBC 18
#define DMA_TCD19_MBC_MLNO DMA_TCD_32BASE01._0x0260 // R/W, TCD MBC 19

#define DMA_TCD20_MBC_MLNO DMA_TCD_32BASE01._0x0280 // R/W, TCD MBC 20
#define DMA_TCD21_MBC_MLNO DMA_TCD_32BASE01._0x02a0 // R/W, TCD MBC 21
#define DMA_TCD22_MBC_MLNO DMA_TCD_32BASE01._0x02c0 // R/W, TCD MBC 22
#define DMA_TCD23_MBC_MLNO DMA_TCD_32BASE01._0x02e0 // R/W, TCD MBC 23

#define DMA_TCD24_MBC_MLNO DMA_TCD_32BASE01._0x0300 // R/W, TCD MBC 24
#define DMA_TCD25_MBC_MLNO DMA_TCD_32BASE01._0x0320 // R/W, TCD MBC 25
#define DMA_TCD26_MBC_MLNO DMA_TCD_32BASE01._0x0340 // R/W, TCD MBC 26
#define DMA_TCD27_MBC_MLNO DMA_TCD_32BASE01._0x0360 // R/W, TCD MBC 27

#define DMA_TCD28_MBC_MLNO DMA_TCD_32BASE01._0x0380 // R/W, TCD MBC 28
#define DMA_TCD29_MBC_MLNO DMA_TCD_32BASE01._0x03a0 // R/W, TCD MBC 29
#define DMA_TCD30_MBC_MLNO DMA_TCD_32BASE01._0x03c0 // R/W, TCD MBC 30
#define DMA_TCD31_MBC_MLNO DMA_TCD_32BASE01._0x03e0 // R/W, TCD MBC 31

//==
// TCD MBC NBYTES MLOFFNO
// TCD Minor Byte Count  [0,31] -- 6.6.5.23
// 1000 + (N * 20), N = [0, 31]
#define DMA_TCD_32BASE01      MAP_32BIT_REGISTER(0x400e9008)
#define DMA_TCD00_MBC_MLOFFNO DMA_TCD_32BASE01._0x0000 // R/W, TCD MBC 00
#define DMA_TCD01_MBC_MLOFFNO DMA_TCD_32BASE01._0x0020 // R/W, TCD MBC 01
#define DMA_TCD02_MBC_MLOFFNO DMA_TCD_32BASE01._0x0040 // R/W, TCD MBC 02
#define DMA_TCD03_MBC_MLOFFNO DMA_TCD_32BASE01._0x0060 // R/W, TCD MBC 03

