AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
#define DMA_TCD04_MBC_MLOFFNO DMA_TCD_32BASE01._0x0080 // R/W, TCD MBC 04
#define DMA_TCD05_MBC_MLOFFNO DMA_TCD_32BASE01._0x00a0 // R/W, TCD MBC 05
#define DMA_TCD06_MBC_MLOFFNO DMA_TCD_32BASE01._0x00c0 // R/W, TCD MBC 06
#define DMA_TCD07_MBC_MLOFFNO DMA_TCD_32BASE01._0x00e0 // R/W, TCD MBC 07

#define DMA_TCD08_MBC_MLOFFNO DMA_TCD_32BASE01._0x0100 // R/W, TCD MBC 08
#define DMA_TCD09_MBC_MLOFFNO DMA_TCD_32BASE01._0x0120 // R/W, TCD MBC 09
#define DMA_TCD10_MBC_MLOFFNO DMA_TCD_32BASE01._0x0140 // R/W, TCD MBC 10
#define DMA_TCD11_MBC_MLOFFNO DMA_TCD_32BASE01._0x0160 // R/W, TCD MBC 11

#define DMA_TCD12_MBC_MLOFFNO DMA_TCD_32BASE01._0x0180 // R/W, TCD MBC 12
#define DMA_TCD13_MBC_MLOFFNO DMA_TCD_32BASE01._0x01a0 // R/W, TCD MBC 13
#define DMA_TCD14_MBC_MLOFFNO DMA_TCD_32BASE01._0x01c0 // R/W, TCD MBC 14
#define DMA_TCD15_MBC_MLOFFNO DMA_TCD_32BASE01._0x01e0 // R/W, TCD MBC 15

#define DMA_TCD16_MBC_MLOFFNO DMA_TCD_32BASE01._0x0200 // R/W, TCD MBC 16
#define DMA_TCD17_MBC_MLOFFNO DMA_TCD_32BASE01._0x0220 // R/W, TCD MBC 17
#define DMA_TCD18_MBC_MLOFFNO DMA_TCD_32BASE01._0x0240 // R/W, TCD MBC 18
#define DMA_TCD19_MBC_MLOFFNO DMA_TCD_32BASE01._0x0260 // R/W, TCD MBC 19

#define DMA_TCD20_MBC_MLOFFNO DMA_TCD_32BASE01._0x0280 // R/W, TCD MBC 20
#define DMA_TCD21_MBC_MLOFFNO DMA_TCD_32BASE01._0x02a0 // R/W, TCD MBC 21
#define DMA_TCD22_MBC_MLOFFNO DMA_TCD_32BASE01._0x02c0 // R/W, TCD MBC 22
#define DMA_TCD23_MBC_MLOFFNO DMA_TCD_32BASE01._0x02e0 // R/W, TCD MBC 23

#define DMA_TCD24_MBC_MLOFFNO DMA_TCD_32BASE01._0x0300 // R/W, TCD MBC 24
#define DMA_TCD25_MBC_MLOFFNO DMA_TCD_32BASE01._0x0320 // R/W, TCD MBC 25
#define DMA_TCD26_MBC_MLOFFNO DMA_TCD_32BASE01._0x0340 // R/W, TCD MBC 26
#define DMA_TCD27_MBC_MLOFFNO DMA_TCD_32BASE01._0x0360 // R/W, TCD MBC 27

#define DMA_TCD28_MBC_MLOFFNO DMA_TCD_32BASE01._0x0380 // R/W, TCD MBC 28
#define DMA_TCD29_MBC_MLOFFNO DMA_TCD_32BASE01._0x03a0 // R/W, TCD MBC 29
#define DMA_TCD30_MBC_MLOFFNO DMA_TCD_32BASE01._0x03c0 // R/W, TCD MBC 30
#define DMA_TCD31_MBC_MLOFFNO DMA_TCD_32BASE01._0x03e0 // R/W, TCD MBC 31

//==
// TCD MBC NBYTES MLOFFYES
// TCD Minor Byte Count  [0,31] -- 6.6.5.24
// 1000 + (N * 20), N = [0, 31]
#define DMA_TCD_32BASE01       MAP_32BIT_REGISTER(0x400e9008)
#define DMA_TCD00_MBC_MLOFFYES DMA_TCD_32BASE01._0x0000 // R/W, TCD MBC 00
#define DMA_TCD01_MBC_MLOFFYES DMA_TCD_32BASE01._0x0020 // R/W, TCD MBC 01
#define DMA_TCD02_MBC_MLOFFYES DMA_TCD_32BASE01._0x0040 // R/W, TCD MBC 02
#define DMA_TCD03_MBC_MLOFFYES DMA_TCD_32BASE01._0x0060 // R/W, TCD MBC 03

#define DMA_TCD04_MBC_MLOFFYES DMA_TCD_32BASE01._0x0080 // R/W, TCD MBC 04
#define DMA_TCD05_MBC_MLOFFYES DMA_TCD_32BASE01._0x00a0 // R/W, TCD MBC 05
#define DMA_TCD06_MBC_MLOFFYES DMA_TCD_32BASE01._0x00c0 // R/W, TCD MBC 06
#define DMA_TCD07_MBC_MLOFFYES DMA_TCD_32BASE01._0x00e0 // R/W, TCD MBC 07

#define DMA_TCD08_MBC_MLOFFYES DMA_TCD_32BASE01._0x0100 // R/W, TCD MBC 08
#define DMA_TCD09_MBC_MLOFFYES DMA_TCD_32BASE01._0x0120 // R/W, TCD MBC 09
#define DMA_TCD10_MBC_MLOFFYES DMA_TCD_32BASE01._0x0140 // R/W, TCD MBC 10
#define DMA_TCD11_MBC_MLOFFYES DMA_TCD_32BASE01._0x0160 // R/W, TCD MBC 11

#define DMA_TCD12_MBC_MLOFFYES DMA_TCD_32BASE01._0x0180 // R/W, TCD MBC 12
#define DMA_TCD13_MBC_MLOFFYES DMA_TCD_32BASE01._0x01a0 // R/W, TCD MBC 13
#define DMA_TCD14_MBC_MLOFFYES DMA_TCD_32BASE01._0x01c0 // R/W, TCD MBC 14
#define DMA_TCD15_MBC_MLOFFYES DMA_TCD_32BASE01._0x01e0 // R/W, TCD MBC 15

#define DMA_TCD16_MBC_MLOFFYES DMA_TCD_32BASE01._0x0200 // R/W, TCD MBC 16
#define DMA_TCD17_MBC_MLOFFYES DMA_TCD_32BASE01._0x0220 // R/W, TCD MBC 17
#define DMA_TCD18_MBC_MLOFFYES DMA_TCD_32BASE01._0x0240 // R/W, TCD MBC 18
#define DMA_TCD19_MBC_MLOFFYES DMA_TCD_32BASE01._0x0260 // R/W, TCD MBC 19

#define DMA_TCD20_MBC_MLOFFYES DMA_TCD_32BASE01._0x0280 // R/W, TCD MBC 20
#define DMA_TCD21_MBC_MLOFFYES DMA_TCD_32BASE01._0x02a0 // R/W, TCD MBC 21
#define DMA_TCD22_MBC_MLOFFYES DMA_TCD_32BASE01._0x02c0 // R/W, TCD MBC 22
#define DMA_TCD23_MBC_MLOFFYES DMA_TCD_32BASE01._0x02e0 // R/W, TCD MBC 23

#define DMA_TCD24_MBC_MLOFFYES DMA_TCD_32BASE01._0x0300 // R/W, TCD MBC 24
#define DMA_TCD25_MBC_MLOFFYES DMA_TCD_32BASE01._0x0320 // R/W, TCD MBC 25
#define DMA_TCD26_MBC_MLOFFYES DMA_TCD_32BASE01._0x0340 // R/W, TCD MBC 26
#define DMA_TCD27_MBC_MLOFFYES DMA_TCD_32BASE01._0x0360 // R/W, TCD MBC 27

#define DMA_TCD28_MBC_MLOFFYES DMA_TCD_32BASE01._0x0380 // R/W, TCD MBC 28
#define DMA_TCD29_MBC_MLOFFYES DMA_TCD_32BASE01._0x03a0 // R/W, TCD MBC 29
#define DMA_TCD30_MBC_MLOFFYES DMA_TCD_32BASE01._0x03c0 // R/W, TCD MBC 30
#define DMA_TCD31_MBC_MLOFFYES DMA_TCD_32BASE01._0x03e0 // R/W, TCD MBC 31

//==
//==
// TCD Last Source Address Adjustment  [0,31] -- 6.6.5.25
// 1000 + (N * 20), N = [0, 31]
#define DMA_TCD_32BASE02 MAP_32BIT_REGISTER(0x400e900c)

#define DMA_TCD00_LSAA DMA_TCD_32BASE02._0x0000 // R/W, TCD LSAA 00
#define DMA_TCD01_LSAA DMA_TCD_32BASE02._0x0020 // R/W, TCD LSAA 01
#define DMA_TCD02_LSAA DMA_TCD_32BASE02._0x0040 // R/W, TCD LSAA 02
#define DMA_TCD03_LSAA DMA_TCD_32BASE02._0x0060 // R/W, TCD LSAA 03

#define DMA_TCD04_LSAA DMA_TCD_32BASE02._0x0080 // R/W, TCD LSAA 04
#define DMA_TCD05_LSAA DMA_TCD_32BASE02._0x00a0 // R/W, TCD LSAA 05
#define DMA_TCD06_LSAA DMA_TCD_32BASE02._0x00c0 // R/W, TCD LSAA 06
#define DMA_TCD07_LSAA DMA_TCD_32BASE02._0x00e0 // R/W, TCD LSAA 07

#define DMA_TCD08_LSAA DMA_TCD_32BASE02._0x0100 // R/W, TCD LSAA 08
#define DMA_TCD09_LSAA DMA_TCD_32BASE02._0x0120 // R/W, TCD LSAA 09
#define DMA_TCD10_LSAA DMA_TCD_32BASE02._0x0140 // R/W, TCD LSAA 10
#define DMA_TCD11_LSAA DMA_TCD_32BASE02._0x0160 // R/W, TCD LSAA 11

#define DMA_TCD12_LSAA DMA_TCD_32BASE02._0x0180 // R/W, TCD LSAA 12
#define DMA_TCD13_LSAA DMA_TCD_32BASE02._0x01a0 // R/W, TCD LSAA 13
#define DMA_TCD14_LSAA DMA_TCD_32BASE02._0x01c0 // R/W, TCD LSAA 14
#define DMA_TCD15_LSAA DMA_TCD_32BASE02._0x01e0 // R/W, TCD LSAA 15

#define DMA_TCD16_LSAA DMA_TCD_32BASE02._0x0200 // R/W, TCD LSAA 16
#define DMA_TCD17_LSAA DMA_TCD_32BASE02._0x0220 // R/W, TCD LSAA 17
#define DMA_TCD18_LSAA DMA_TCD_32BASE02._0x0240 // R/W, TCD LSAA 18
#define DMA_TCD19_LSAA DMA_TCD_32BASE02._0x0260 // R/W, TCD LSAA 19

