AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
#define DMA_TCD20_LSAA DMA_TCD_32BASE02._0x0280 // R/W, TCD LSAA 20
#define DMA_TCD21_LSAA DMA_TCD_32BASE02._0x02a0 // R/W, TCD LSAA 21
#define DMA_TCD22_LSAA DMA_TCD_32BASE02._0x02c0 // R/W, TCD LSAA 22
#define DMA_TCD23_LSAA DMA_TCD_32BASE02._0x02e0 // R/W, TCD LSAA 23

#define DMA_TCD24_LSAA DMA_TCD_32BASE02._0x0300 // R/W, TCD LSAA 24
#define DMA_TCD25_LSAA DMA_TCD_32BASE02._0x0320 // R/W, TCD LSAA 25
#define DMA_TCD26_LSAA DMA_TCD_32BASE02._0x0340 // R/W, TCD LSAA 26
#define DMA_TCD27_LSAA DMA_TCD_32BASE02._0x0360 // R/W, TCD LSAA 27

#define DMA_TCD28_LSAA DMA_TCD_32BASE02._0x0380 // R/W, TCD LSAA 28
#define DMA_TCD29_LSAA DMA_TCD_32BASE02._0x03a0 // R/W, TCD LSAA 29
#define DMA_TCD30_LSAA DMA_TCD_32BASE02._0x03c0 // R/W, TCD LSAA 30
#define DMA_TCD31_LSAA DMA_TCD_32BASE02._0x03e0 // R/W, TCD LSAA 31
//==

// TCD Destination Address  [0,31] -- 6.6.5.26
// 1000 + (N * 20), N = [0, 31]
#define DMA_TCD_32BASE03 MAP_32BIT_REGISTER(0x400e9010)
#define DMA_TCD00_DADDR  DMA_TCD_32BASE03._0x0000 // R/W, TCD DADDR 00
#define DMA_TCD01_DADDR  DMA_TCD_32BASE03._0x0020 // R/W, TCD DADDR 01
#define DMA_TCD02_DADDR  DMA_TCD_32BASE03._0x0040 // R/W, TCD DADDR 02
#define DMA_TCD03_DADDR  DMA_TCD_32BASE03._0x0060 // R/W, TCD DADDR 03

#define DMA_TCD04_DADDR DMA_TCD_32BASE03._0x0080 // R/W, TCD DADDR 04
#define DMA_TCD05_DADDR DMA_TCD_32BASE03._0x00a0 // R/W, TCD DADDR 05
#define DMA_TCD06_DADDR DMA_TCD_32BASE03._0x00c0 // R/W, TCD DADDR 06
#define DMA_TCD07_DADDR DMA_TCD_32BASE03._0x00e0 // R/W, TCD DADDR 07

#define DMA_TCD08_DADDR DMA_TCD_32BASE03._0x0100 // R/W, TCD DADDR 08
#define DMA_TCD09_DADDR DMA_TCD_32BASE03._0x0120 // R/W, TCD DADDR 09
#define DMA_TCD10_DADDR DMA_TCD_32BASE03._0x0140 // R/W, TCD DADDR 10
#define DMA_TCD11_DADDR DMA_TCD_32BASE03._0x0160 // R/W, TCD DADDR 11

#define DMA_TCD12_DADDR DMA_TCD_32BASE03._0x0180 // R/W, TCD DADDR 12
#define DMA_TCD13_DADDR DMA_TCD_32BASE03._0x01a0 // R/W, TCD DADDR 13
#define DMA_TCD14_DADDR DMA_TCD_32BASE03._0x01c0 // R/W, TCD DADDR 14
#define DMA_TCD15_DADDR DMA_TCD_32BASE03._0x01e0 // R/W, TCD DADDR 15

#define DMA_TCD16_DADDR DMA_TCD_32BASE03._0x0200 // R/W, TCD DADDR 16
#define DMA_TCD17_DADDR DMA_TCD_32BASE03._0x0220 // R/W, TCD DADDR 17
#define DMA_TCD18_DADDR DMA_TCD_32BASE03._0x0240 // R/W, TCD DADDR 18
#define DMA_TCD19_DADDR DMA_TCD_32BASE03._0x0260 // R/W, TCD DADDR 19

#define DMA_TCD20_DADDR DMA_TCD_32BASE03._0x0280 // R/W, TCD DADDR 20
#define DMA_TCD21_DADDR DMA_TCD_32BASE03._0x02a0 // R/W, TCD DADDR 21
#define DMA_TCD22_DADDR DMA_TCD_32BASE03._0x02c0 // R/W, TCD DADDR 22
#define DMA_TCD23_DADDR DMA_TCD_32BASE03._0x02e0 // R/W, TCD DADDR 23

#define DMA_TCD24_DADDR DMA_TCD_32BASE03._0x0300 // R/W, TCD DADDR 24
#define DMA_TCD25_DADDR DMA_TCD_32BASE03._0x0320 // R/W, TCD DADDR 25
#define DMA_TCD26_DADDR DMA_TCD_32BASE03._0x0340 // R/W, TCD DADDR 26
#define DMA_TCD27_DADDR DMA_TCD_32BASE03._0x0360 // R/W, TCD DADDR 27

#define DMA_TCD28_DADDR DMA_TCD_32BASE03._0x0380 // R/W, TCD DADDR 28
#define DMA_TCD29_DADDR DMA_TCD_32BASE03._0x03a0 // R/W, TCD DADDR 29
#define DMA_TCD30_DADDR DMA_TCD_32BASE03._0x03c0 // R/W, TCD DADDR 30
#define DMA_TCD31_DADDR DMA_TCD_32BASE03._0x03e0 // R/W, TCD DADDR 31

//==

// TCD Singed Destination Address Offset  [0,31] -- 6.6.5.27
// 1000 + (N * 20), N = [0, 31]
#define DMA_TCD_16BASE02 MAP_16BIT_REGISTER(0x400e9014)
#define DMA_TCD00_SDOFF  DMA_TCD_16BASE02._0x0000 // R/W, TCD SDOFF 00
#define DMA_TCD01_SDOFF  DMA_TCD_16BASE02._0x0020 // R/W, TCD SDOFF 01
#define DMA_TCD02_SDOFF  DMA_TCD_16BASE02._0x0040 // R/W, TCD SDOFF 02
#define DMA_TCD03_SDOFF  DMA_TCD_16BASE02._0x0060 // R/W, TCD SDOFF 03

#define DMA_TCD04_SDOFF DMA_TCD_16BASE02._0x0080 // R/W, TCD SDOFF 04
#define DMA_TCD05_SDOFF DMA_TCD_16BASE02._0x00a0 // R/W, TCD SDOFF 05
#define DMA_TCD06_SDOFF DMA_TCD_16BASE02._0x00c0 // R/W, TCD SDOFF 06
#define DMA_TCD07_SDOFF DMA_TCD_16BASE02._0x00e0 // R/W, TCD SDOFF 07

#define DMA_TCD08_SDOFF DMA_TCD_16BASE02._0x0100 // R/W, TCD SDOFF 08
#define DMA_TCD09_SDOFF DMA_TCD_16BASE02._0x0120 // R/W, TCD SDOFF 09
#define DMA_TCD10_SDOFF DMA_TCD_16BASE02._0x0140 // R/W, TCD SDOFF 10
#define DMA_TCD11_SDOFF DMA_TCD_16BASE02._0x0160 // R/W, TCD SDOFF 11

#define DMA_TCD12_SDOFF DMA_TCD_16BASE02._0x0180 // R/W, TCD SDOFF 12
#define DMA_TCD13_SDOFF DMA_TCD_16BASE02._0x01a0 // R/W, TCD SDOFF 13
#define DMA_TCD14_SDOFF DMA_TCD_16BASE02._0x01c0 // R/W, TCD SDOFF 14
#define DMA_TCD15_SDOFF DMA_TCD_16BASE02._0x01e0 // R/W, TCD SDOFF 15

#define DMA_TCD16_SDOFF DMA_TCD_16BASE02._0x0200 // R/W, TCD SDOFF 16
#define DMA_TCD17_SDOFF DMA_TCD_16BASE02._0x0220 // R/W, TCD SDOFF 17
#define DMA_TCD18_SDOFF DMA_TCD_16BASE02._0x0240 // R/W, TCD SDOFF 18
#define DMA_TCD19_SDOFF DMA_TCD_16BASE02._0x0260 // R/W, TCD SDOFF 19

#define DMA_TCD20_SDOFF DMA_TCD_16BASE02._0x0280 // R/W, TCD SDOFF 20
#define DMA_TCD21_SDOFF DMA_TCD_16BASE02._0x02a0 // R/W, TCD SDOFF 21
#define DMA_TCD22_SDOFF DMA_TCD_16BASE02._0x02c0 // R/W, TCD SDOFF 22
#define DMA_TCD23_SDOFF DMA_TCD_16BASE02._0x02e0 // R/W, TCD SDOFF 23

#define DMA_TCD24_SDOFF DMA_TCD_16BASE02._0x0300 // R/W, TCD SDOFF 24
#define DMA_TCD25_SDOFF DMA_TCD_16BASE02._0x0320 // R/W, TCD SDOFF 25
#define DMA_TCD26_SDOFF DMA_TCD_16BASE02._0x0340 // R/W, TCD SDOFF 26
#define DMA_TCD27_SDOFF DMA_TCD_16BASE02._0x0360 // R/W, TCD SDOFF 27

#define DMA_TCD28_SDOFF DMA_TCD_16BASE02._0x0380 // R/W, TCD SDOFF 28
#define DMA_TCD29_SDOFF DMA_TCD_16BASE02._0x03a0 // R/W, TCD SDOFF 29
#define DMA_TCD30_SDOFF DMA_TCD_16BASE02._0x03c0 // R/W, TCD SDOFF 30
#define DMA_TCD31_SDOFF DMA_TCD_16BASE02._0x03e0 // R/W, TCD SDOFF 31

//==
// CHANNEL LINK DISABLED
// TCD Current Minor Loop Link, Major Loop Count (CMLMLC)  [0,31] -- 6.6.5.28
// 1000 + (N * 20), N = [0, 31]
#define DMA_TCD_16BASE03      MAP_16BIT_REGISTER(0x400e9016)
#define DMA_TCD00_CITER_LNKNO DMA_TCD_16BASE03._0x0000 // R/W, TCD MLLMLC 00
#define DMA_TCD01_CITER_LNKNO DMA_TCD_16BASE03._0x0020 // R/W, TCD MLLMLC 01
#define DMA_TCD02_CITER_LNKNO DMA_TCD_16BASE03._0x0040 // R/W, TCD MLLMLC 02
#define DMA_TCD03_CITER_LNKNO DMA_TCD_16BASE03._0x0060 // R/W, TCD MLLMLC 03

#define DMA_TCD04_CITER_LNKNO DMA_TCD_16BASE03._0x0080 // R/W, TCD MLLMLC 04
#define DMA_TCD05_CITER_LNKNO DMA_TCD_16BASE03._0x00a0 // R/W, TCD MLLMLC 05
#define DMA_TCD06_CITER_LNKNO DMA_TCD_16BASE03._0x00c0 // R/W, TCD MLLMLC 06
#define DMA_TCD07_CITER_LNKNO DMA_TCD_16BASE03._0x00e0 // R/W, TCD MLLMLC 07

#define DMA_TCD08_CITER_LNKNO DMA_TCD_16BASE03._0x0100 // R/W, TCD MLLMLC 08
#define DMA_TCD09_CITER_LNKNO DMA_TCD_16BASE03._0x0120 // R/W, TCD MLLMLC 09
#define DMA_TCD10_CITER_LNKNO DMA_TCD_16BASE03._0x0140 // R/W, TCD MLLMLC 10
#define DMA_TCD11_CITER_LNKNO DMA_TCD_16BASE03._0x0160 // R/W, TCD MLLMLC 11

#define DMA_TCD12_CITER_LNKNO DMA_TCD_16BASE03._0x0180 // R/W, TCD MLLMLC 12
#define DMA_TCD13_CITER_LNKNO DMA_TCD_16BASE03._0x01a0 // R/W, TCD MLLMLC 13
#define DMA_TCD14_CITER_LNKNO DMA_TCD_16BASE03._0x01c0 // R/W, TCD MLLMLC 14
#define DMA_TCD15_CITER_LNKNO DMA_TCD_16BASE03._0x01e0 // R/W, TCD MLLMLC 15

#define DMA_TCD16_CITER_LNKNO DMA_TCD_16BASE03._0x0200 // R/W, TCD MLLMLC 16
#define DMA_TCD17_CITER_LNKNO DMA_TCD_16BASE03._0x0220 // R/W, TCD MLLMLC 17
#define DMA_TCD18_CITER_LNKNO DMA_TCD_16BASE03._0x0240 // R/W, TCD MLLMLC 18
#define DMA_TCD19_CITER_LNKNO DMA_TCD_16BASE03._0x0260 // R/W, TCD MLLMLC 19

#define DMA_TCD20_CITER_LNKNO DMA_TCD_16BASE03._0x0280 // R/W, TCD MLLMLC 20
#define DMA_TCD21_CITER_LNKNO DMA_TCD_16BASE03._0x02a0 // R/W, TCD MLLMLC 21
#define DMA_TCD22_CITER_LNKNO DMA_TCD_16BASE03._0x02c0 // R/W, TCD MLLMLC 22
#define DMA_TCD23_CITER_LNKNO DMA_TCD_16BASE03._0x02e0 // R/W, TCD MLLMLC 23

