AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
#define DMA_TCD24_CITER_LNKNO DMA_TCD_16BASE03._0x0300 // R/W, TCD MLLMLC 24
#define DMA_TCD25_CITER_LNKNO DMA_TCD_16BASE03._0x0320 // R/W, TCD MLLMLC 25
#define DMA_TCD26_CITER_LNKNO DMA_TCD_16BASE03._0x0340 // R/W, TCD MLLMLC 26
#define DMA_TCD27_CITER_LNKNO DMA_TCD_16BASE03._0x0360 // R/W, TCD MLLMLC 27

#define DMA_TCD28_CITER_LNKNO DMA_TCD_16BASE03._0x0380 // R/W, TCD MLLMLC 28
#define DMA_TCD29_CITER_LNKNO DMA_TCD_16BASE03._0x03a0 // R/W, TCD MLLMLC 29
#define DMA_TCD30_CITER_LNKNO DMA_TCD_16BASE03._0x03c0 // R/W, TCD MLLMLC 30
#define DMA_TCD31_CITER_LNKNO DMA_TCD_16BASE03._0x03e0 // R/W, TCD MLLMLC 31

//==
// CHANNEL LINK ENABLED
// TCD Current Minor Loop Link, Major Loop Count (CMLMLC)  [0,31]
// -- 6.6.5.29
// 1000 + (N * 20), N = [0, 31]
#define DMA_TCD00_CITER_LNKYES DMA_TCD_16BASE03._0x0000 // R/W, TCD MLLMLC 00
#define DMA_TCD01_CITER_LNKYES DMA_TCD_16BASE03._0x0020 // R/W, TCD MLLMLC 01
#define DMA_TCD02_CITER_LNKYES DMA_TCD_16BASE03._0x0040 // R/W, TCD MLLMLC 02
#define DMA_TCD03_CITER_LNKYES DMA_TCD_16BASE03._0x0060 // R/W, TCD MLLMLC 03

#define DMA_TCD04_CITER_LNKYES DMA_TCD_16BASE03._0x0080 // R/W, TCD MLLMLC 04
#define DMA_TCD05_CITER_LNKYES DMA_TCD_16BASE03._0x00a0 // R/W, TCD MLLMLC 05
#define DMA_TCD06_CITER_LNKYES DMA_TCD_16BASE03._0x00c0 // R/W, TCD MLLMLC 06
#define DMA_TCD07_CITER_LNKYES DMA_TCD_16BASE03._0x00e0 // R/W, TCD MLLMLC 07

#define DMA_TCD08_CITER_LNKYES DMA_TCD_16BASE03._0x0100 // R/W, TCD MLLMLC 08
#define DMA_TCD09_CITER_LNKYES DMA_TCD_16BASE03._0x0120 // R/W, TCD MLLMLC 09
#define DMA_TCD10_CITER_LNKYES DMA_TCD_16BASE03._0x0140 // R/W, TCD MLLMLC 10
#define DMA_TCD11_CITER_LNKYES DMA_TCD_16BASE03._0x0160 // R/W, TCD MLLMLC 11

#define DMA_TCD12_CITER_LNKYES DMA_TCD_16BASE03._0x0180 // R/W, TCD MLLMLC 12
#define DMA_TCD13_CITER_LNKYES DMA_TCD_16BASE03._0x01a0 // R/W, TCD MLLMLC 13
#define DMA_TCD14_CITER_LNKYES DMA_TCD_16BASE03._0x01c0 // R/W, TCD MLLMLC 14
#define DMA_TCD15_CITER_LNKYES DMA_TCD_16BASE03._0x01e0 // R/W, TCD MLLMLC 15

#define DMA_TCD16_CITER_LNKYES DMA_TCD_16BASE03._0x0200 // R/W, TCD MLLMLC 16
#define DMA_TCD17_CITER_LNKYES DMA_TCD_16BASE03._0x0220 // R/W, TCD MLLMLC 17
#define DMA_TCD18_CITER_LNKYES DMA_TCD_16BASE03._0x0240 // R/W, TCD MLLMLC 18
#define DMA_TCD19_CITER_LNKYES DMA_TCD_16BASE03._0x0260 // R/W, TCD MLLMLC 19

#define DMA_TCD20_CITER_LNKYES DMA_TCD_16BASE03._0x0280 // R/W, TCD MLLMLC 20
#define DMA_TCD21_CITER_LNKYES DMA_TCD_16BASE03._0x02a0 // R/W, TCD MLLMLC 21
#define DMA_TCD22_CITER_LNKYES DMA_TCD_16BASE03._0x02c0 // R/W, TCD MLLMLC 22
#define DMA_TCD23_CITER_LNKYES DMA_TCD_16BASE03._0x02e0 // R/W, TCD MLLMLC 23

#define DMA_TCD24_CITER_LNKYES DMA_TCD_16BASE03._0x0300 // R/W, TCD MLLMLC 24
#define DMA_TCD25_CITER_LNKYES DMA_TCD_16BASE03._0x0320 // R/W, TCD MLLMLC 25
#define DMA_TCD26_CITER_LNKYES DMA_TCD_16BASE03._0x0340 // R/W, TCD MLLMLC 26
#define DMA_TCD27_CITER_LNKYES DMA_TCD_16BASE03._0x0360 // R/W, TCD MLLMLC 27

#define DMA_TCD28_CITER_LNKYES DMA_TCD_16BASE03._0x0380 // R/W, TCD MLLMLC 28
#define DMA_TCD29_CITER_LNKYES DMA_TCD_16BASE03._0x03a0 // R/W, TCD MLLMLC 29
#define DMA_TCD30_CITER_LNKYES DMA_TCD_16BASE03._0x03c0 // R/W, TCD MLLMLC 30
#define DMA_TCD31_CITER_LNKYES DMA_TCD_16BASE03._0x03e0 // R/W, TCD MLLMLC 31

//==

// TCD Last Destination Address Adjustment /
// Scatter Gather Address
// (DLASTSGA)  [0,31] -- 6.6.5.30
// 1000 + (N * 20), N = [0, 31]
#define DMA_TCD_32BASE04   MAP_32BIT_REGISTER(0x400e9018)
#define DMA_TCD00_DLASTSGA DMA_TCD_32BASE04._0x0000 // R/W, TCD DLASTSGA 00
#define DMA_TCD01_DLASTSGA DMA_TCD_32BASE04._0x0020 // R/W, TCD DLASTSGA 01
#define DMA_TCD02_DLASTSGA DMA_TCD_32BASE04._0x0040 // R/W, TCD DLASTSGA 02
#define DMA_TCD03_DLASTSGA DMA_TCD_32BASE04._0x0060 // R/W, TCD DLASTSGA 03

#define DMA_TCD04_DLASTSGA DMA_TCD_32BASE04._0x0080 // R/W, TCD DLASTSGA 04
#define DMA_TCD05_DLASTSGA DMA_TCD_32BASE04._0x00a0 // R/W, TCD DLASTSGA 05
#define DMA_TCD06_DLASTSGA DMA_TCD_32BASE04._0x00c0 // R/W, TCD DLASTSGA 06
#define DMA_TCD07_DLASTSGA DMA_TCD_32BASE04._0x00e0 // R/W, TCD DLASTSGA 07

#define DMA_TCD08_DLASTSGA DMA_TCD_32BASE04._0x0100 // R/W, TCD DLASTSGA 08
#define DMA_TCD09_DLASTSGA DMA_TCD_32BASE04._0x0120 // R/W, TCD DLASTSGA 09
#define DMA_TCD10_DLASTSGA DMA_TCD_32BASE04._0x0140 // R/W, TCD DLASTSGA 10
#define DMA_TCD11_DLASTSGA DMA_TCD_32BASE04._0x0160 // R/W, TCD DLASTSGA 11

#define DMA_TCD12_DLASTSGA DMA_TCD_32BASE04._0x0180 // R/W, TCD DLASTSGA 12
#define DMA_TCD13_DLASTSGA DMA_TCD_32BASE04._0x01a0 // R/W, TCD DLASTSGA 13
#define DMA_TCD14_DLASTSGA DMA_TCD_32BASE04._0x01c0 // R/W, TCD DLASTSGA 14
#define DMA_TCD15_DLASTSGA DMA_TCD_32BASE04._0x01e0 // R/W, TCD DLASTSGA 15

#define DMA_TCD16_DLASTSGA DMA_TCD_32BASE04._0x0200 // R/W, TCD DLASTSGA 16
#define DMA_TCD17_DLASTSGA DMA_TCD_32BASE04._0x0220 // R/W, TCD DLASTSGA 17
#define DMA_TCD18_DLASTSGA DMA_TCD_32BASE04._0x0240 // R/W, TCD DLASTSGA 18
#define DMA_TCD19_DLASTSGA DMA_TCD_32BASE04._0x0260 // R/W, TCD DLASTSGA 19

#define DMA_TCD20_DLASTSGA DMA_TCD_32BASE04._0x0280 // R/W, TCD DLASTSGA 20
#define DMA_TCD21_DLASTSGA DMA_TCD_32BASE04._0x02a0 // R/W, TCD DLASTSGA 21
#define DMA_TCD22_DLASTSGA DMA_TCD_32BASE04._0x02c0 // R/W, TCD DLASTSGA 22
#define DMA_TCD23_DLASTSGA DMA_TCD_32BASE04._0x02e0 // R/W, TCD DLASTSGA 23

#define DMA_TCD24_DLASTSGA DMA_TCD_32BASE04._0x0300 // R/W, TCD DLASTSGA 24
#define DMA_TCD25_DLASTSGA DMA_TCD_32BASE04._0x0320 // R/W, TCD DLASTSGA 25
#define DMA_TCD26_DLASTSGA DMA_TCD_32BASE04._0x0340 // R/W, TCD DLASTSGA 26
#define DMA_TCD27_DLASTSGA DMA_TCD_32BASE04._0x0360 // R/W, TCD DLASTSGA 27

#define DMA_TCD28_DLASTSGA DMA_TCD_32BASE04._0x0380 // R/W, TCD DLASTSGA 28
#define DMA_TCD29_DLASTSGA DMA_TCD_32BASE04._0x03a0 // R/W, TCD DLASTSGA 29
#define DMA_TCD30_DLASTSGA DMA_TCD_32BASE04._0x03c0 // R/W, TCD DLASTSGA 30
#define DMA_TCD31_DLASTSGA DMA_TCD_32BASE04._0x03e0 // R/W, TCD DLASTSGA 31

//==
// TCD Control and Status Registers (CMLMLC)  [0,31]
// -- 6.6.5.31
// 1000 + (N * 20), N = [0, 31]
#define DMA_TCD_16BASE04 MAP_16BIT_REGISTER(0x400e901c)
#define DMA_TCD00_CSR    DMA_TCD_16BASE04._0x0000 // R/W, TCD CSR 00
#define DMA_TCD01_CSR    DMA_TCD_16BASE04._0x0020 // R/W, TCD CSR 01
#define DMA_TCD02_CSR    DMA_TCD_16BASE04._0x0040 // R/W, TCD CSR 02
#define DMA_TCD03_CSR    DMA_TCD_16BASE04._0x0060 // R/W, TCD CSR 03

#define DMA_TCD04_CSR DMA_TCD_16BASE04._0x0080 // R/W, TCD CSR 04
#define DMA_TCD05_CSR DMA_TCD_16BASE04._0x00a0 // R/W, TCD CSR 05
#define DMA_TCD06_CSR DMA_TCD_16BASE04._0x00c0 // R/W, TCD CSR 06
#define DMA_TCD07_CSR DMA_TCD_16BASE04._0x00e0 // R/W, TCD CSR 07

#define DMA_TCD08_CSR DMA_TCD_16BASE04._0x0100 // R/W, TCD CSR 08
#define DMA_TCD09_CSR DMA_TCD_16BASE04._0x0120 // R/W, TCD CSR 09
#define DMA_TCD10_CSR DMA_TCD_16BASE04._0x0140 // R/W, TCD CSR 10
#define DMA_TCD11_CSR DMA_TCD_16BASE04._0x0160 // R/W, TCD CSR 11

#define DMA_TCD12_CSR DMA_TCD_16BASE04._0x0180 // R/W, TCD CSR 12
#define DMA_TCD13_CSR DMA_TCD_16BASE04._0x01a0 // R/W, TCD CSR 13
#define DMA_TCD14_CSR DMA_TCD_16BASE04._0x01c0 // R/W, TCD CSR 14
#define DMA_TCD15_CSR DMA_TCD_16BASE04._0x01e0 // R/W, TCD CSR 15

#define DMA_TCD16_CSR DMA_TCD_16BASE04._0x0200 // R/W, TCD CSR 16
#define DMA_TCD17_CSR DMA_TCD_16BASE04._0x0220 // R/W, TCD CSR 17
#define DMA_TCD18_CSR DMA_TCD_16BASE04._0x0240 // R/W, TCD CSR 18
#define DMA_TCD19_CSR DMA_TCD_16BASE04._0x0260 // R/W, TCD CSR 19

