AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
#define DMA_TCD20_CSR DMA_TCD_16BASE04._0x0280 // R/W, TCD CSR 20
#define DMA_TCD21_CSR DMA_TCD_16BASE04._0x02a0 // R/W, TCD CSR 21
#define DMA_TCD22_CSR DMA_TCD_16BASE04._0x02c0 // R/W, TCD CSR 22
#define DMA_TCD23_CSR DMA_TCD_16BASE04._0x02e0 // R/W, TCD CSR 23

#define DMA_TCD24_CSR DMA_TCD_16BASE04._0x0300 // R/W, TCD CSR 24
#define DMA_TCD25_CSR DMA_TCD_16BASE04._0x0320 // R/W, TCD CSR 25
#define DMA_TCD26_CSR DMA_TCD_16BASE04._0x0340 // R/W, TCD CSR 26
#define DMA_TCD27_CSR DMA_TCD_16BASE04._0x0360 // R/W, TCD CSR 27

#define DMA_TCD28_CSR DMA_TCD_16BASE04._0x0380 // R/W, TCD CSR 28
#define DMA_TCD29_CSR DMA_TCD_16BASE04._0x03a0 // R/W, TCD CSR 29
#define DMA_TCD30_CSR DMA_TCD_16BASE04._0x03c0 // R/W, TCD CSR 30
#define DMA_TCD31_CSR DMA_TCD_16BASE04._0x03e0 // R/W, TCD CSR 31

//==
// 1000 + (N * 20), N = [0, 31]
// TCD Beginning Min. Loop Link, Maj. Loop Count (Channel Link disables)  [0,31]
// -- 6.6.5.32
#define DMA_TCD_16BASE05      MAP_16BIT_REGISTER(0x400e901e)
#define DMA_TCD00_BITER_LNKNO DMA_TCD_16BASE05._0x0000 // R/W, TCD CSR 00
#define DMA_TCD01_BITER_LNKNO DMA_TCD_16BASE05._0x0020 // R/W, TCD CSR 01
#define DMA_TCD02_BITER_LNKNO DMA_TCD_16BASE05._0x0040 // R/W, TCD CSR 02
#define DMA_TCD03_BITER_LNKNO DMA_TCD_16BASE05._0x0060 // R/W, TCD CSR 03

#define DMA_TCD04_BITER_LNKNO DMA_TCD_16BASE05._0x0080 // R/W, TCD CSR 04
#define DMA_TCD05_BITER_LNKNO DMA_TCD_16BASE05._0x00a0 // R/W, TCD CSR 05
#define DMA_TCD06_BITER_LNKNO DMA_TCD_16BASE05._0x00c0 // R/W, TCD CSR 06
#define DMA_TCD07_BITER_LNKNO DMA_TCD_16BASE05._0x00e0 // R/W, TCD CSR 07

#define DMA_TCD08_BITER_LNKNO DMA_TCD_16BASE05._0x0100 // R/W, TCD CSR 08
#define DMA_TCD09_BITER_LNKNO DMA_TCD_16BASE05._0x0120 // R/W, TCD CSR 09
#define DMA_TCD10_BITER_LNKNO DMA_TCD_16BASE05._0x0140 // R/W, TCD CSR 10
#define DMA_TCD11_BITER_LNKNO DMA_TCD_16BASE05._0x0160 // R/W, TCD CSR 11

#define DMA_TCD12_BITER_LNKNO DMA_TCD_16BASE05._0x0180 // R/W, TCD CSR 12
#define DMA_TCD13_BITER_LNKNO DMA_TCD_16BASE05._0x01a0 // R/W, TCD CSR 13
#define DMA_TCD14_BITER_LNKNO DMA_TCD_16BASE05._0x01c0 // R/W, TCD CSR 14
#define DMA_TCD15_BITER_LNKNO DMA_TCD_16BASE05._0x01e0 // R/W, TCD CSR 15

#define DMA_TCD16_BITER_LNKNO DMA_TCD_16BASE05._0x0200 // R/W, TCD CSR 16
#define DMA_TCD17_BITER_LNKNO DMA_TCD_16BASE05._0x0220 // R/W, TCD CSR 17
#define DMA_TCD18_BITER_LNKNO DMA_TCD_16BASE05._0x0240 // R/W, TCD CSR 18
#define DMA_TCD19_BITER_LNKNO DMA_TCD_16BASE05._0x0260 // R/W, TCD CSR 19

#define DMA_TCD20_BITER_LNKNO DMA_TCD_16BASE05._0x0280 // R/W, TCD CSR 20
#define DMA_TCD21_BITER_LNKNO DMA_TCD_16BASE05._0x02a0 // R/W, TCD CSR 21
#define DMA_TCD22_BITER_LNKNO DMA_TCD_16BASE05._0x02c0 // R/W, TCD CSR 22
#define DMA_TCD23_BITER_LNKNO DMA_TCD_16BASE05._0x02e0 // R/W, TCD CSR 23

#define DMA_TCD24_BITER_LNKNO DMA_TCD_16BASE05._0x0300 // R/W, TCD CSR 24
#define DMA_TCD25_BITER_LNKNO DMA_TCD_16BASE05._0x0320 // R/W, TCD CSR 25
#define DMA_TCD26_BITER_LNKNO DMA_TCD_16BASE05._0x0340 // R/W, TCD CSR 26
#define DMA_TCD27_BITER_LNKNO DMA_TCD_16BASE05._0x0360 // R/W, TCD CSR 27

#define DMA_TCD28_BITER_LNKNO DMA_TCD_16BASE05._0x0380 // R/W, TCD CSR 28
#define DMA_TCD29_BITER_LNKNO DMA_TCD_16BASE05._0x03a0 // R/W, TCD CSR 29
#define DMA_TCD30_BITER_LNKNO DMA_TCD_16BASE05._0x03c0 // R/W, TCD CSR 30
#define DMA_TCD31_BITER_LNKNO DMA_TCD_16BASE05._0x03e0 // R/W, TCD CSR 31

//==
// TCD Beginning Min. Loop Link, Maj. Loop Count (Channel Link disables)  [0,31]
// -- 6.6.5.33
#define DMA_TCD00_BITER_LNKYES DMA_TCD_16BASE05._0x0000 // R/W, TCD CSR 00
#define DMA_TCD01_BITER_LNKYES DMA_TCD_16BASE05._0x0020 // R/W, TCD CSR 01
#define DMA_TCD02_BITER_LNKYES DMA_TCD_16BASE05._0x0040 // R/W, TCD CSR 02
#define DMA_TCD03_BITER_LNKYES DMA_TCD_16BASE05._0x0060 // R/W, TCD CSR 03

#define DMA_TCD04_BITER_LNKYES DMA_TCD_16BASE05._0x0080 // R/W, TCD CSR 04
#define DMA_TCD05_BITER_LNKYES DMA_TCD_16BASE05._0x00a0 // R/W, TCD CSR 05
#define DMA_TCD06_BITER_LNKYES DMA_TCD_16BASE05._0x00c0 // R/W, TCD CSR 06
#define DMA_TCD07_BITER_LNKYES DMA_TCD_16BASE05._0x00e0 // R/W, TCD CSR 07

#define DMA_TCD08_BITER_LNKYES DMA_TCD_16BASE05._0x0100 // R/W, TCD CSR 08
#define DMA_TCD09_BITER_LNKYES DMA_TCD_16BASE05._0x0120 // R/W, TCD CSR 09
#define DMA_TCD10_BITER_LNKYES DMA_TCD_16BASE05._0x0140 // R/W, TCD CSR 10
#define DMA_TCD11_BITER_LNKYES DMA_TCD_16BASE05._0x0160 // R/W, TCD CSR 11

#define DMA_TCD12_BITER_LNKYES DMA_TCD_16BASE05._0x0180 // R/W, TCD CSR 12
#define DMA_TCD13_BITER_LNKYES DMA_TCD_16BASE05._0x01a0 // R/W, TCD CSR 13
#define DMA_TCD14_BITER_LNKYES DMA_TCD_16BASE05._0x01c0 // R/W, TCD CSR 14
#define DMA_TCD15_BITER_LNKYES DMA_TCD_16BASE05._0x01e0 // R/W, TCD CSR 15

#define DMA_TCD16_BITER_LNKYES DMA_TCD_16BASE05._0x0200 // R/W, TCD CSR 16
#define DMA_TCD17_BITER_LNKYES DMA_TCD_16BASE05._0x0220 // R/W, TCD CSR 17
#define DMA_TCD18_BITER_LNKYES DMA_TCD_16BASE05._0x0240 // R/W, TCD CSR 18
#define DMA_TCD19_BITER_LNKYES DMA_TCD_16BASE05._0x0260 // R/W, TCD CSR 19

#define DMA_TCD20_BITER_LNKYES DMA_TCD_16BASE05._0x0280 // R/W, TCD CSR 20
#define DMA_TCD21_BITER_LNKYES DMA_TCD_16BASE05._0x02a0 // R/W, TCD CSR 21
#define DMA_TCD22_BITER_LNKYES DMA_TCD_16BASE05._0x02c0 // R/W, TCD CSR 22
#define DMA_TCD23_BITER_LNKYES DMA_TCD_16BASE05._0x02e0 // R/W, TCD CSR 23

#define DMA_TCD24_BITER_LNKYES DMA_TCD_16BASE05._0x0300 // R/W, TCD CSR 24
#define DMA_TCD25_BITER_LNKYES DMA_TCD_16BASE05._0x0320 // R/W, TCD CSR 25
#define DMA_TCD26_BITER_LNKYES DMA_TCD_16BASE05._0x0340 // R/W, TCD CSR 26
#define DMA_TCD27_BITER_LNKYES DMA_TCD_16BASE05._0x0360 // R/W, TCD CSR 27

#define DMA_TCD28_BITER_LNKYES DMA_TCD_16BASE05._0x0380 // R/W, TCD CSR 28
#define DMA_TCD29_BITER_LNKYES DMA_TCD_16BASE05._0x03a0 // R/W, TCD CSR 29
#define DMA_TCD30_BITER_LNKYES DMA_TCD_16BASE05._0x03c0 // R/W, TCD CSR 30
#define DMA_TCD31_BITER_LNKYES DMA_TCD_16BASE05._0x03e0 // R/W, TCD CSR 31

//===
// 11.4 IOMUXC GPR Memory Map/Register definition
#define IOMUXC_32BASE00  MAP_32BIT_REGISTER(0x400ac000)
#define IOMUXC_GPR_GPR00 IOMUXC_32BASE00._0x0000
#define IOMUXC_GPR_GPR01 IOMUXC_32BASE00._0x0004
#define IOMUXC_GPR_GPR02 IOMUXC_32BASE00._0x0008
#define IOMUXC_GPR_GPR03 IOMUXC_32BASE00._0x000c
#define IOMUXC_GPR_GPR04 IOMUXC_32BASE00._0x0010
#define IOMUXC_GPR_GPR05 IOMUXC_32BASE00._0x0014
#define IOMUXC_GPR_GPR06 IOMUXC_32BASE00._0x0018
#define IOMUXC_GPR_GPR07 IOMUXC_32BASE00._0x001c
#define IOMUXC_GPR_GPR08 IOMUXC_32BASE00._0x0020
#define IOMUXC_GPR_GPR09 IOMUXC_32BASE00._0x0024
#define IOMUXC_GPR_GPR10 IOMUXC_32BASE00._0x0028
#define IOMUXC_GPR_GPR11 IOMUXC_32BASE00._0x002c
#define IOMUXC_GPR_GPR12 IOMUXC_32BASE00._0x0030
#define IOMUXC_GPR_GPR13 IOMUXC_32BASE00._0x0034
#define IOMUXC_GPR_GPR14 IOMUXC_32BASE00._0x0038
#define IOMUXC_GPR_GPR15 IOMUXC_32BASE00._0x003c
#define IOMUXC_GPR_GPR16 (IOMUXC_32BASE00._0x0040)
#define IOMUXC_GPR_GPR17 IOMUXC_32BASE00._0x0044
#define IOMUXC_GPR_GPR18 IOMUXC_32BASE00._0x0048
#define IOMUXC_GPR_GPR19 IOMUXC_32BASE00._0x004c
#define IOMUXC_GPR_GPR20 IOMUXC_32BASE00._0x0050
#define IOMUXC_GPR_GPR21 IOMUXC_32BASE00._0x0054
#define IOMUXC_GPR_GPR22 IOMUXC_32BASE00._0x0058
#define IOMUXC_GPR_GPR23 IOMUXC_32BASE00._0x005c
#define IOMUXC_GPR_GPR24 IOMUXC_32BASE00._0x0060
#define IOMUXC_GPR_GPR25 IOMUXC_32BASE00._0x0064
#define IOMUXC_GPR_GPR26 IOMUXC_32BASE00._0x0068
#define IOMUXC_GPR_GPR27 IOMUXC_32BASE00._0x006c
#define IOMUXC_GPR_GPR28 IOMUXC_32BASE00._0x0070
#define IOMUXC_GPR_GPR29 IOMUXC_32BASE00._0x0074
#define IOMUXC_GPR_GPR30 IOMUXC_32BASE00._0x0078
#define IOMUXC_GPR_GPR31 IOMUXC_32BASE00._0x007c
#define IOMUXC_GPR_GPR32 IOMUXC_32BASE00._0x0080
#define IOMUXC_GPR_GPR33 IOMUXC_32BASE00._0x0084
#define IOMUXC_GPR_GPR34 IOMUXC_32BASE00._0x0088

