AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
//===
//===
// 11.5 IOMUXC SVNS Memory Map/Register definition
#define IOMUXC_32BASE01 MAP_32BIT_REGISTER(0x400a8000)

#define IOMUXC_SNVS_WAKEUP_MUX_CR        IOMUXC_32BASE01._0x0000
#define IOMUXC_SNVS_PMIC_ON_REQ_MUX_CR   IOMUXC_32BASE01._0x0004
#define IOMUXC_SNVS_PMIC_STBY_REQ_MUX_CR IOMUXC_32BASE01._0x0008
#define IOMUXC_SNVS_TEST_MODE_PAD_CR     IOMUXC_32BASE01._0x000c
#define IOMUXC_SNVS_POR_PAD_CR           IOMUXC_32BASE01._0x0010
#define IOMUXC_SNVS_ONOFF_PAD_CR         IOMUXC_32BASE01._0x0014
#define IOMUXC_SNVS_WAKEUP_PAD_CR        IOMUXC_32BASE01._0x0018
#define IOMUXC_SNVS_PMIC_ON_REQ_PAD_CR   IOMUXC_32BASE01._0x001c
#define IOMUXC_SNVS_STBY_ON_REQ_PAD_CR   IOMUXC_32BASE01._0x0020

//===
//===
// 11.6 IOMUXC SVNS/GPR Memory Map/Register definition
#define IOMUXC_32BASE02      MAP_32BIT_REGISTER(0x400a4000)
#define IOMUXC_SNVS_GPR_GPR0 IOMUXC_32BASE02._0x0000
#define IOMUXC_SNVS_GPR_GPR1 IOMUXC_32BASE02._0x0004
#define IOMUXC_SNVS_GPR_GPR2 IOMUXC_32BASE02._0x0008
#define IOMUXC_SNVS_GPR_GPR3 IOMUXC_32BASE02._0x000c

//===
//===
// 11.7 IOMUXC Memory Map/Register definition  p.403 - p.426
#define IOMUXC_32BASE03 MAP_32BIT_REGISTER(0x401f8014)
// SW_MUX_CTL_PAD_GPIO_EMC_xx SW MUX Control Register
#define IOMUXC_MUX_PAD_GPIO_EMC_CR00 IOMUXC_32BASE03._0x0000
#define IOMUXC_MUX_PAD_GPIO_EMC_CR01 IOMUXC_32BASE03._0x0004
#define IOMUXC_MUX_PAD_GPIO_EMC_CR02 IOMUXC_32BASE03._0x0008
#define IOMUXC_MUX_PAD_GPIO_EMC_CR03 IOMUXC_32BASE03._0x000c
#define IOMUXC_MUX_PAD_GPIO_EMC_CR04 IOMUXC_32BASE03._0x0010
#define IOMUXC_MUX_PAD_GPIO_EMC_CR05 IOMUXC_32BASE03._0x0014
#define IOMUXC_MUX_PAD_GPIO_EMC_CR06 IOMUXC_32BASE03._0x0018
#define IOMUXC_MUX_PAD_GPIO_EMC_CR07 IOMUXC_32BASE03._0x001c
#define IOMUXC_MUX_PAD_GPIO_EMC_CR08 IOMUXC_32BASE03._0x0020
#define IOMUXC_MUX_PAD_GPIO_EMC_CR09 IOMUXC_32BASE03._0x0024
#define IOMUXC_MUX_PAD_GPIO_EMC_CR10 IOMUXC_32BASE03._0x0028
#define IOMUXC_MUX_PAD_GPIO_EMC_CR11 IOMUXC_32BASE03._0x002c
#define IOMUXC_MUX_PAD_GPIO_EMC_CR12 IOMUXC_32BASE03._0x0030
#define IOMUXC_MUX_PAD_GPIO_EMC_CR13 IOMUXC_32BASE03._0x0034
#define IOMUXC_MUX_PAD_GPIO_EMC_CR14 IOMUXC_32BASE03._0x0038
#define IOMUXC_MUX_PAD_GPIO_EMC_CR15 IOMUXC_32BASE03._0x003c
#define IOMUXC_MUX_PAD_GPIO_EMC_CR16 IOMUXC_32BASE03._0x0040
#define IOMUXC_MUX_PAD_GPIO_EMC_CR17 IOMUXC_32BASE03._0x0044
#define IOMUXC_MUX_PAD_GPIO_EMC_CR18 IOMUXC_32BASE03._0x0048
#define IOMUXC_MUX_PAD_GPIO_EMC_CR19 IOMUXC_32BASE03._0x004c
#define IOMUXC_MUX_PAD_GPIO_EMC_CR20 IOMUXC_32BASE03._0x0050
#define IOMUXC_MUX_PAD_GPIO_EMC_CR21 IOMUXC_32BASE03._0x0054
#define IOMUXC_MUX_PAD_GPIO_EMC_CR22 IOMUXC_32BASE03._0x0058
#define IOMUXC_MUX_PAD_GPIO_EMC_CR23 IOMUXC_32BASE03._0x005c
#define IOMUXC_MUX_PAD_GPIO_EMC_CR24 IOMUXC_32BASE03._0x0060
#define IOMUXC_MUX_PAD_GPIO_EMC_CR25 IOMUXC_32BASE03._0x0064
#define IOMUXC_MUX_PAD_GPIO_EMC_CR26 IOMUXC_32BASE03._0x0068
#define IOMUXC_MUX_PAD_GPIO_EMC_CR27 IOMUXC_32BASE03._0x006c
#define IOMUXC_MUX_PAD_GPIO_EMC_CR28 IOMUXC_32BASE03._0x0070
#define IOMUXC_MUX_PAD_GPIO_EMC_CR29 IOMUXC_32BASE03._0x0074
#define IOMUXC_MUX_PAD_GPIO_EMC_CR30 IOMUXC_32BASE03._0x0078
#define IOMUXC_MUX_PAD_GPIO_EMC_CR31 IOMUXC_32BASE03._0x007c
#define IOMUXC_MUX_PAD_GPIO_EMC_CR32 IOMUXC_32BASE03._0x0080
#define IOMUXC_MUX_PAD_GPIO_EMC_CR33 IOMUXC_32BASE03._0x0084
#define IOMUXC_MUX_PAD_GPIO_EMC_CR34 IOMUXC_32BASE03._0x0088
#define IOMUXC_MUX_PAD_GPIO_EMC_CR35 IOMUXC_32BASE03._0x008c
#define IOMUXC_MUX_PAD_GPIO_EMC_CR36 IOMUXC_32BASE03._0x0090
#define IOMUXC_MUX_PAD_GPIO_EMC_CR37 IOMUXC_32BASE03._0x0094
#define IOMUXC_MUX_PAD_GPIO_EMC_CR38 IOMUXC_32BASE03._0x0098
#define IOMUXC_MUX_PAD_GPIO_EMC_CR39 IOMUXC_32BASE03._0x009c
#define IOMUXC_MUX_PAD_GPIO_EMC_CR40 IOMUXC_32BASE03._0x00a0
#define IOMUXC_MUX_PAD_GPIO_EMC_CR41 IOMUXC_32BASE03._0x00a4

// SW_MUX_PAD_GPIO_AD_B0_xx SW MUX Control Register
#define IOMUXC_MUX_PAD_GPIO_AD_B0_CR00 (IOMUXC_32BASE03._0x00a8)
#define IOMUXC_MUX_PAD_GPIO_AD_B0_CR01 IOMUXC_32BASE03._0x00ac
#define IOMUXC_MUX_PAD_GPIO_AD_B0_CR02 IOMUXC_32BASE03._0x00b0
#define IOMUXC_MUX_PAD_GPIO_AD_B0_CR03 IOMUXC_32BASE03._0x00b4
#define IOMUXC_MUX_PAD_GPIO_AD_B0_CR04 IOMUXC_32BASE03._0x00b8
#define IOMUXC_MUX_PAD_GPIO_AD_B0_CR05 IOMUXC_32BASE03._0x00bc
#define IOMUXC_MUX_PAD_GPIO_AD_B0_CR06 IOMUXC_32BASE03._0x00c0
#define IOMUXC_MUX_PAD_GPIO_AD_B0_CR07 IOMUXC_32BASE03._0x00c4
#define IOMUXC_MUX_PAD_GPIO_AD_B0_CR08 IOMUXC_32BASE03._0x00c8
#define IOMUXC_MUX_PAD_GPIO_AD_B0_CR09 IOMUXC_32BASE03._0x00cc
#define IOMUXC_MUX_PAD_GPIO_AD_B0_CR10 IOMUXC_32BASE03._0x00d0
#define IOMUXC_MUX_PAD_GPIO_AD_B0_CR11 IOMUXC_32BASE03._0x00d4
#define IOMUXC_MUX_PAD_GPIO_AD_B0_CR12 IOMUXC_32BASE03._0x00d8
#define IOMUXC_MUX_PAD_GPIO_AD_B0_CR13 IOMUXC_32BASE03._0x00dc
#define IOMUXC_MUX_PAD_GPIO_AD_B0_CR14 IOMUXC_32BASE03._0x00e0
#define IOMUXC_MUX_PAD_GPIO_AD_B0_CR15 IOMUXC_32BASE03._0x00e4

// SW_MUX_PAD_GPIO_AD_B1_xx SW MUX Control Register
#define IOMUXC_MUX_PAD_GPIO_AD_B1_CR00 IOMUXC_32BASE03._0x00e8
#define IOMUXC_MUX_PAD_GPIO_AD_B1_CR01 IOMUXC_32BASE03._0x00ec
#define IOMUXC_MUX_PAD_GPIO_AD_B1_CR02 IOMUXC_32BASE03._0x00f0
#define IOMUXC_MUX_PAD_GPIO_AD_B1_CR03 IOMUXC_32BASE03._0x00f4
#define IOMUXC_MUX_PAD_GPIO_AD_B1_CR04 IOMUXC_32BASE03._0x00f8
#define IOMUXC_MUX_PAD_GPIO_AD_B1_CR05 IOMUXC_32BASE03._0x00fc
#define IOMUXC_MUX_PAD_GPIO_AD_B1_CR06 IOMUXC_32BASE03._0x0100
#define IOMUXC_MUX_PAD_GPIO_AD_B1_CR07 IOMUXC_32BASE03._0x0104
#define IOMUXC_MUX_PAD_GPIO_AD_B1_CR08 IOMUXC_32BASE03._0x0108
#define IOMUXC_MUX_PAD_GPIO_AD_B1_CR09 IOMUXC_32BASE03._0x010c
#define IOMUXC_MUX_PAD_GPIO_AD_B1_CR10 IOMUXC_32BASE03._0x0110
#define IOMUXC_MUX_PAD_GPIO_AD_B1_CR11 IOMUXC_32BASE03._0x0114
#define IOMUXC_MUX_PAD_GPIO_AD_B1_CR12 IOMUXC_32BASE03._0x0118
#define IOMUXC_MUX_PAD_GPIO_AD_B1_CR13 IOMUXC_32BASE03._0x011c
#define IOMUXC_MUX_PAD_GPIO_AD_B1_CR14 IOMUXC_32BASE03._0x0120
#define IOMUXC_MUX_PAD_GPIO_AD_B1_CR15 IOMUXC_32BASE03._0x0124

// SW_MUX_PAD_GPIO_B0_xx SW MUX Control Register
#define IOMUXC_MUX_PAD_GPIO_B0_CR00 IOMUXC_32BASE03._0x0128
#define IOMUXC_MUX_PAD_GPIO_B0_CR01 IOMUXC_32BASE03._0x012c
#define IOMUXC_MUX_PAD_GPIO_B0_CR02 IOMUXC_32BASE03._0x0130
#define IOMUXC_MUX_PAD_GPIO_B0_CR03 IOMUXC_32BASE03._0x0134
#define IOMUXC_MUX_PAD_GPIO_B0_CR04 IOMUXC_32BASE03._0x0138
#define IOMUXC_MUX_PAD_GPIO_B0_CR05 IOMUXC_32BASE03._0x013c
#define IOMUXC_MUX_PAD_GPIO_B0_CR06 IOMUXC_32BASE03._0x0140
#define IOMUXC_MUX_PAD_GPIO_B0_CR07 IOMUXC_32BASE03._0x0144
#define IOMUXC_MUX_PAD_GPIO_B0_CR08 IOMUXC_32BASE03._0x0148
#define IOMUXC_MUX_PAD_GPIO_B0_CR09 IOMUXC_32BASE03._0x014c
#define IOMUXC_MUX_PAD_GPIO_B0_CR10 IOMUXC_32BASE03._0x0150
#define IOMUXC_MUX_PAD_GPIO_B0_CR11 IOMUXC_32BASE03._0x0154
#define IOMUXC_MUX_PAD_GPIO_B0_CR12 IOMUXC_32BASE03._0x0158
#define IOMUXC_MUX_PAD_GPIO_B0_CR13 IOMUXC_32BASE03._0x015c
#define IOMUXC_MUX_PAD_GPIO_B0_CR14 IOMUXC_32BASE03._0x0160
#define IOMUXC_MUX_PAD_GPIO_B0_CR15 IOMUXC_32BASE03._0x0164

// SW_MUX_PAD_GPIO_B1_xx SW MUX Control Register
#define IOMUXC_MUX_PAD_GPIO_B1_CR00 IOMUXC_32BASE03._0x0168
#define IOMUXC_MUX_PAD_GPIO_B1_CR01 IOMUXC_32BASE03._0x016c
#define IOMUXC_MUX_PAD_GPIO_B1_CR02 IOMUXC_32BASE03._0x0170
#define IOMUXC_MUX_PAD_GPIO_B1_CR03 IOMUXC_32BASE03._0x0174
#define IOMUXC_MUX_PAD_GPIO_B1_CR04 IOMUXC_32BASE03._0x0178
#define IOMUXC_MUX_PAD_GPIO_B1_CR05 IOMUXC_32BASE03._0x017c
#define IOMUXC_MUX_PAD_GPIO_B1_CR06 IOMUXC_32BASE03._0x0180
#define IOMUXC_MUX_PAD_GPIO_B1_CR07 IOMUXC_32BASE03._0x0184
#define IOMUXC_MUX_PAD_GPIO_B1_CR08 IOMUXC_32BASE03._0x0188
#define IOMUXC_MUX_PAD_GPIO_B1_CR09 IOMUXC_32BASE03._0x018c
#define IOMUXC_MUX_PAD_GPIO_B1_CR10 IOMUXC_32BASE03._0x0190
#define IOMUXC_MUX_PAD_GPIO_B1_CR11 IOMUXC_32BASE03._0x0194
#define IOMUXC_MUX_PAD_GPIO_B1_CR12 IOMUXC_32BASE03._0x0198
#define IOMUXC_MUX_PAD_GPIO_B1_CR13 IOMUXC_32BASE03._0x019c
#define IOMUXC_MUX_PAD_GPIO_B1_CR14 IOMUXC_32BASE03._0x01a0
#define IOMUXC_MUX_PAD_GPIO_B1_CR15 IOMUXC_32BASE03._0x01a4

// SW_MUX_PAD_GPIO_SD_B0_xx SW MUX Control Register
#define IOMUXC_MUX_PAD_GPIO_SD_B0_CR00 IOMUXC_32BASE03._0x01a8
#define IOMUXC_MUX_PAD_GPIO_SD_B0_CR01 IOMUXC_32BASE03._0x01ac
#define IOMUXC_MUX_PAD_GPIO_SD_B0_CR02 IOMUXC_32BASE03._0x01b0
#define IOMUXC_MUX_PAD_GPIO_SD_B0_CR03 IOMUXC_32BASE03._0x01b4
#define IOMUXC_MUX_PAD_GPIO_SD_B0_CR04 IOMUXC_32BASE03._0x01b8
#define IOMUXC_MUX_PAD_GPIO_SD_B0_CR05 IOMUXC_32BASE03._0x01bc

// SW_MUX_PAD_GPIO_SD_B1_xx SW MUX Control Register
#define IOMUXC_MUX_PAD_GPIO_SD_B1_CR00 IOMUXC_32BASE03._0x01c0
#define IOMUXC_MUX_PAD_GPIO_SD_B1_CR01 IOMUXC_32BASE03._0x01c4
#define IOMUXC_MUX_PAD_GPIO_SD_B1_CR02 IOMUXC_32BASE03._0x01c8
#define IOMUXC_MUX_PAD_GPIO_SD_B1_CR03 IOMUXC_32BASE03._0x01cc
#define IOMUXC_MUX_PAD_GPIO_SD_B1_CR04 IOMUXC_32BASE03._0x01d0
#define IOMUXC_MUX_PAD_GPIO_SD_B1_CR05 IOMUXC_32BASE03._0x01d4
#define IOMUXC_MUX_PAD_GPIO_SD_B1_CR06 IOMUXC_32BASE03._0x01d8
#define IOMUXC_MUX_PAD_GPIO_SD_B1_CR07 IOMUXC_32BASE03._0x01dc
#define IOMUXC_MUX_PAD_GPIO_SD_B1_CR08 IOMUXC_32BASE03._0x01e0
#define IOMUXC_MUX_PAD_GPIO_SD_B1_CR09 IOMUXC_32BASE03._0x01e4
#define IOMUXC_MUX_PAD_GPIO_SD_B1_CR10 IOMUXC_32BASE03._0x01e8
#define IOMUXC_MUX_PAD_GPIO_SD_B1_CR11 IOMUXC_32BASE03._0x01ec

// SW IOMUXC PAD  == FIX NAMES
// SW_PAD_CTL_PAD_GPIO_EMC_xx Control Registers
#define IOMUXC_PAD_PAD_GPIO_EMC_CR00 IOMUXC_32BASE03._0x01f0
#define IOMUXC_PAD_PAD_GPIO_EMC_CR01 IOMUXC_32BASE03._0x01f4
#define IOMUXC_PAD_PAD_GPIO_EMC_CR02 IOMUXC_32BASE03._0x01f8
#define IOMUXC_PAD_PAD_GPIO_EMC_CR03 IOMUXC_32BASE03._0x01fc
#define IOMUXC_PAD_PAD_GPIO_EMC_CR04 IOMUXC_32BASE03._0x0200
#define IOMUXC_PAD_PAD_GPIO_EMC_CR05 IOMUXC_32BASE03._0x0204
#define IOMUXC_PAD_PAD_GPIO_EMC_CR06 IOMUXC_32BASE03._0x0208
#define IOMUXC_PAD_PAD_GPIO_EMC_CR07 IOMUXC_32BASE03._0x020c
#define IOMUXC_PAD_PAD_GPIO_EMC_CR08 IOMUXC_32BASE03._0x0210
#define IOMUXC_PAD_PAD_GPIO_EMC_CR09 IOMUXC_32BASE03._0x0214
#define IOMUXC_PAD_PAD_GPIO_EMC_CR10 IOMUXC_32BASE03._0x0218
#define IOMUXC_PAD_PAD_GPIO_EMC_CR11 IOMUXC_32BASE03._0x021c
#define IOMUXC_PAD_PAD_GPIO_EMC_CR12 IOMUXC_32BASE03._0x0220
#define IOMUXC_PAD_PAD_GPIO_EMC_CR13 IOMUXC_32BASE03._0x0224
#define IOMUXC_PAD_PAD_GPIO_EMC_CR14 IOMUXC_32BASE03._0x0228
#define IOMUXC_PAD_PAD_GPIO_EMC_CR15 IOMUXC_32BASE03._0x022c
#define IOMUXC_PAD_PAD_GPIO_EMC_CR16 IOMUXC_32BASE03._0x0230
#define IOMUXC_PAD_PAD_GPIO_EMC_CR17 IOMUXC_32BASE03._0x0234
#define IOMUXC_PAD_PAD_GPIO_EMC_CR18 IOMUXC_32BASE03._0x0238
#define IOMUXC_PAD_PAD_GPIO_EMC_CR19 IOMUXC_32BASE03._0x023c
#define IOMUXC_PAD_PAD_GPIO_EMC_CR20 IOMUXC_32BASE03._0x0240
#define IOMUXC_PAD_PAD_GPIO_EMC_CR21 IOMUXC_32BASE03._0x0244
#define IOMUXC_PAD_PAD_GPIO_EMC_CR22 IOMUXC_32BASE03._0x0248
#define IOMUXC_PAD_PAD_GPIO_EMC_CR23 IOMUXC_32BASE03._0x024c
#define IOMUXC_PAD_PAD_GPIO_EMC_CR24 IOMUXC_32BASE03._0x0250
#define IOMUXC_PAD_PAD_GPIO_EMC_CR25 IOMUXC_32BASE03._0x0254
#define IOMUXC_PAD_PAD_GPIO_EMC_CR26 IOMUXC_32BASE03._0x0258
#define IOMUXC_PAD_PAD_GPIO_EMC_CR27 IOMUXC_32BASE03._0x025c
#define IOMUXC_PAD_PAD_GPIO_EMC_CR28 IOMUXC_32BASE03._0x0260
#define IOMUXC_PAD_PAD_GPIO_EMC_CR29 IOMUXC_32BASE03._0x0264
#define IOMUXC_PAD_PAD_GPIO_EMC_CR30 IOMUXC_32BASE03._0x0268
#define IOMUXC_PAD_PAD_GPIO_EMC_CR31 IOMUXC_32BASE03._0x026c
#define IOMUXC_PAD_PAD_GPIO_EMC_CR32 IOMUXC_32BASE03._0x0270
#define IOMUXC_PAD_PAD_GPIO_EMC_CR33 IOMUXC_32BASE03._0x0274
#define IOMUXC_PAD_PAD_GPIO_EMC_CR34 IOMUXC_32BASE03._0x0278
#define IOMUXC_PAD_PAD_GPIO_EMC_CR35 IOMUXC_32BASE03._0x027c
#define IOMUXC_PAD_PAD_GPIO_EMC_CR36 IOMUXC_32BASE03._0x0280
#define IOMUXC_PAD_PAD_GPIO_EMC_CR37 IOMUXC_32BASE03._0x0284
#define IOMUXC_PAD_PAD_GPIO_EMC_CR38 IOMUXC_32BASE03._0x0288
#define IOMUXC_PAD_PAD_GPIO_EMC_CR39 IOMUXC_32BASE03._0x028c
#define IOMUXC_PAD_PAD_GPIO_EMC_CR40 IOMUXC_32BASE03._0x0290
#define IOMUXC_PAD_PAD_GPIO_EMC_CR41 IOMUXC_32BASE03._0x0294
// SW_MUX_PAD_GPIO_AD_B0_xx SW MUX Control Register
#define IOMUXC_PAD_PAD_GPIO_AD_B0_CR00 IOMUXC_32BASE03._0x0298
#define IOMUXC_PAD_PAD_GPIO_AD_B0_CR01 IOMUXC_32BASE03._0x029c
#define IOMUXC_PAD_PAD_GPIO_AD_B0_CR02 IOMUXC_32BASE03._0x02a0
#define IOMUXC_PAD_PAD_GPIO_AD_B0_CR03 IOMUXC_32BASE03._0x02a4
#define IOMUXC_PAD_PAD_GPIO_AD_B0_CR04 IOMUXC_32BASE03._0x02a8
#define IOMUXC_PAD_PAD_GPIO_AD_B0_CR05 IOMUXC_32BASE03._0x02ac
#define IOMUXC_PAD_PAD_GPIO_AD_B0_CR06 IOMUXC_32BASE03._0x02b0
#define IOMUXC_PAD_PAD_GPIO_AD_B0_CR07 IOMUXC_32BASE03._0x02b4
#define IOMUXC_PAD_PAD_GPIO_AD_B0_CR08 IOMUXC_32BASE03._0x02b8
#define IOMUXC_PAD_PAD_GPIO_AD_B0_CR09 IOMUXC_32BASE03._0x02bc
#define IOMUXC_PAD_PAD_GPIO_AD_B0_CR10 IOMUXC_32BASE03._0x02c0
#define IOMUXC_PAD_PAD_GPIO_AD_B0_CR11 IOMUXC_32BASE03._0x02c4
#define IOMUXC_PAD_PAD_GPIO_AD_B0_CR12 IOMUXC_32BASE03._0x02c8
#define IOMUXC_PAD_PAD_GPIO_AD_B0_CR13 IOMUXC_32BASE03._0x02cc
#define IOMUXC_PAD_PAD_GPIO_AD_B0_CR14 IOMUXC_32BASE03._0x02d0
#define IOMUXC_PAD_PAD_GPIO_AD_B0_CR15 IOMUXC_32BASE03._0x02d4

// SW_MUX_PAD_GPIO_AD_B1_xx SW MUX Control Register
#define IOMUXC_PAD_PAD_GPIO_AD_B1_CR00 IOMUXC_32BASE03._0x02d8
#define IOMUXC_PAD_PAD_GPIO_AD_B1_CR01 IOMUXC_32BASE03._0x02dc
#define IOMUXC_PAD_PAD_GPIO_AD_B1_CR02 IOMUXC_32BASE03._0x02e0
#define IOMUXC_PAD_PAD_GPIO_AD_B1_CR03 IOMUXC_32BASE03._0x02e4
#define IOMUXC_PAD_PAD_GPIO_AD_B1_CR04 IOMUXC_32BASE03._0x02e8
#define IOMUXC_PAD_PAD_GPIO_AD_B1_CR05 IOMUXC_32BASE03._0x02ec
#define IOMUXC_PAD_PAD_GPIO_AD_B1_CR06 IOMUXC_32BASE03._0x02f0
#define IOMUXC_PAD_PAD_GPIO_AD_B1_CR07 IOMUXC_32BASE03._0x02f4
#define IOMUXC_PAD_PAD_GPIO_AD_B1_CR08 IOMUXC_32BASE03._0x02f8
#define IOMUXC_PAD_PAD_GPIO_AD_B1_CR09 IOMUXC_32BASE03._0x02fc
#define IOMUXC_PAD_PAD_GPIO_AD_B1_CR10 IOMUXC_32BASE03._0x0300
#define IOMUXC_PAD_PAD_GPIO_AD_B1_CR11 IOMUXC_32BASE03._0x0304
#define IOMUXC_PAD_PAD_GPIO_AD_B1_CR12 IOMUXC_32BASE03._0x0308
#define IOMUXC_PAD_PAD_GPIO_AD_B1_CR13 IOMUXC_32BASE03._0x030c
#define IOMUXC_PAD_PAD_GPIO_AD_B1_CR14 IOMUXC_32BASE03._0x0310
#define IOMUXC_PAD_PAD_GPIO_AD_B1_CR15 IOMUXC_32BASE03._0x0314

