AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
// SW_MUX_PAD_GPIO_B0_xx SW MUX Control Register
#define IOMUXC_PAD_PAD_GPIO_B0_CR00 IOMUXC_32BASE03._0x0318
#define IOMUXC_PAD_PAD_GPIO_B0_CR01 IOMUXC_32BASE03._0x031c
#define IOMUXC_PAD_PAD_GPIO_B0_CR02 IOMUXC_32BASE03._0x0320
#define IOMUXC_PAD_PAD_GPIO_B0_CR03 IOMUXC_32BASE03._0x0324
#define IOMUXC_PAD_PAD_GPIO_B0_CR04 IOMUXC_32BASE03._0x0328
#define IOMUXC_PAD_PAD_GPIO_B0_CR05 IOMUXC_32BASE03._0x032c
#define IOMUXC_PAD_PAD_GPIO_B0_CR06 IOMUXC_32BASE03._0x0330
#define IOMUXC_PAD_PAD_GPIO_B0_CR07 IOMUXC_32BASE03._0x0334
#define IOMUXC_PAD_PAD_GPIO_B0_CR08 IOMUXC_32BASE03._0x0338
#define IOMUXC_PAD_PAD_GPIO_B0_CR09 IOMUXC_32BASE03._0x033c
#define IOMUXC_PAD_PAD_GPIO_B0_CR10 IOMUXC_32BASE03._0x0340
#define IOMUXC_PAD_PAD_GPIO_B0_CR11 IOMUXC_32BASE03._0x0344
#define IOMUXC_PAD_PAD_GPIO_B0_CR12 IOMUXC_32BASE03._0x0348
#define IOMUXC_PAD_PAD_GPIO_B0_CR13 IOMUXC_32BASE03._0x034c
#define IOMUXC_PAD_PAD_GPIO_B0_CR14 IOMUXC_32BASE03._0x0350
#define IOMUXC_PAD_PAD_GPIO_B0_CR15 IOMUXC_32BASE03._0x0354

// SW_MUX_PAD_GPIO_B1_xx SW MUX Control Register
#define IOMUXC_PAD_PAD_GPIO_B1_CR00 IOMUXC_32BASE03._0x0358
#define IOMUXC_PAD_PAD_GPIO_B1_CR01 IOMUXC_32BASE03._0x035c
#define IOMUXC_PAD_PAD_GPIO_B1_CR02 IOMUXC_32BASE03._0x0360
#define IOMUXC_PAD_PAD_GPIO_B1_CR03 IOMUXC_32BASE03._0x0364
#define IOMUXC_PAD_PAD_GPIO_B1_CR04 IOMUXC_32BASE03._0x0368
#define IOMUXC_PAD_PAD_GPIO_B1_CR05 IOMUXC_32BASE03._0x036c
#define IOMUXC_PAD_PAD_GPIO_B1_CR06 IOMUXC_32BASE03._0x0370
#define IOMUXC_PAD_PAD_GPIO_B1_CR07 IOMUXC_32BASE03._0x0374
#define IOMUXC_PAD_PAD_GPIO_B1_CR08 IOMUXC_32BASE03._0x0378
#define IOMUXC_PAD_PAD_GPIO_B1_CR09 IOMUXC_32BASE03._0x037c
#define IOMUXC_PAD_PAD_GPIO_B1_CR10 IOMUXC_32BASE03._0x0380
#define IOMUXC_PAD_PAD_GPIO_B1_CR11 IOMUXC_32BASE03._0x0384
#define IOMUXC_PAD_PAD_GPIO_B1_CR12 IOMUXC_32BASE03._0x0388
#define IOMUXC_PAD_PAD_GPIO_B1_CR13 IOMUXC_32BASE03._0x038c
#define IOMUXC_PAD_PAD_GPIO_B1_CR14 IOMUXC_32BASE03._0x0390
#define IOMUXC_PAD_PAD_GPIO_B1_CR15 IOMUXC_32BASE03._0x0394

// SW_MUX_PAD_GPIO_SD_B0_xx SW MUX Control Register
#define IOMUXC_PAD_PAD_GPIO_SD_B0_CR00 IOMUXC_32BASE03._0x0398
#define IOMUXC_PAD_PAD_GPIO_SD_B0_CR01 IOMUXC_32BASE03._0x039c
#define IOMUXC_PAD_PAD_GPIO_SD_B0_CR02 IOMUXC_32BASE03._0x03a0
#define IOMUXC_PAD_PAD_GPIO_SD_B0_CR03 IOMUXC_32BASE03._0x03a4
#define IOMUXC_PAD_PAD_GPIO_SD_B0_CR04 IOMUXC_32BASE03._0x03a8
#define IOMUXC_PAD_PAD_GPIO_SD_B0_CR05 IOMUXC_32BASE03._0x03ac

// SW_MUX_PAD_GPIO_SD_B1_xx SW MUX Control Register
#define IOMUXC_PAD_PAD_GPIO_SD_B1_CR00 IOMUXC_32BASE03._0x03b0
#define IOMUXC_PAD_PAD_GPIO_SD_B1_CR01 IOMUXC_32BASE03._0x03b4
#define IOMUXC_PAD_PAD_GPIO_SD_B1_CR02 IOMUXC_32BASE03._0x03b8
#define IOMUXC_PAD_PAD_GPIO_SD_B1_CR03 IOMUXC_32BASE03._0x03bc
#define IOMUXC_PAD_PAD_GPIO_SD_B1_CR04 IOMUXC_32BASE03._0x03c0
#define IOMUXC_PAD_PAD_GPIO_SD_B1_CR05 IOMUXC_32BASE03._0x03c4
#define IOMUXC_PAD_PAD_GPIO_SD_B1_CR06 IOMUXC_32BASE03._0x03c8
#define IOMUXC_PAD_PAD_GPIO_SD_B1_CR07 IOMUXC_32BASE03._0x03cc
#define IOMUXC_PAD_PAD_GPIO_SD_B1_CR08 IOMUXC_32BASE03._0x03d0
#define IOMUXC_PAD_PAD_GPIO_SD_B1_CR09 IOMUXC_32BASE03._0x03d4
#define IOMUXC_PAD_PAD_GPIO_SD_B1_CR10 IOMUXC_32BASE03._0x03d8
#define IOMUXC_PAD_PAD_GPIO_SD_B1_CR11 IOMUXC_32BASE03._0x03dc

// IOMUXC PAD GENERAL MACROS

// Used for initial config, not runtime reconfig, so they can be neatly
// bitwised ORed together
#define PAD_HYST_ENABLED       0b10000000000000000
#define PAD_HYST_DISABLED      0b0
#define PAD_22KOHM_UP          0b1100000000000000
#define PAD_100KOHM_UP         0b1000000000000000
#define PAD_47KOHM_UP          0b0100000000000000
#define PAD_100KOHM_DOWN       0b0
#define PAD_SLCT_PULLER        0b10000000000000
#define PAD_SLCT_KEEPER        0b0
#define PAD_PULLKEEP_ENABLED   0b1000000000000
#define PAD_PULLKEEP_DISABLED  0b0
#define PAD_OPENDRAIN_ENABLED  0b100000000000
#define PAD_OPENDRAIN_DISABLED 0b0
#define PAD_SPEED_200MHZ       0b11000000
#define PAD_SPEED_150MHZ       0b10000000
#define PAD_SPEED_100MHZ       0b01000000
#define PAD_SPEED_50MHZ        0b0
#define PAD_DSE_R07            0b111000
#define PAD_DSE_R06            0b110000
#define PAD_DSE_R05            0b101000
#define PAD_DSE_R04            0b100000
#define PAD_DSE_R03            0b011000
#define PAD_DSE_R02            0b010000
#define PAD_DSE_150OHM         0b001000
#define PAD_DSE_DIS            0b0
#define PAD_SLEW_RATE_FAST     0b1
#define PAD_SLEW_RATE_SLOW     0b0

// x is of types defined in iomuxc_controller
#define PAD_HYST(x)          ~(0x1 << 0x10) | ((x & 0x1) << 0x10)
#define PAD_PULL_UPDOWN(x)   ~(0x3 << 0xe) | ((x & 0x3) << 0xe)
#define PAD_PULLKEEP_SLCT(x) ~(0x1 << 0xd) | ((x & 0x1) << 0xd)
#define PAD_PULLKEEP(x)      ~(0x1 << 0xc) | ((x & 0x1) << 0xc)
#define PAD_OPENDRAIN(x)     ~(0x1 << 0xb) | ((x & 0x1) << 0xb)
#define PAD_SPEED(x)         ~(0x3 << 0x6) | ((x & 0x3) << 0x6)
#define PAD_DSE(x)           ~(0x7 << 0x3) | ((x & 0x7) << 0x3)
#define PAD_SLEW_RATE(x)     ~0x1 | (x & 0x1)

#define PAD_HYST_SET(PAD_REG, x)          PAD_REG &= PAD_HYST(x)
#define PAD_PULL_UPDOWN_SET(PAD_REG, x)   PAD_REG &= PAD_PULL_UPDOWN(x)
#define PAD_PULLKEEP_SET_SLCT(PAD_REG, x) PAD_REG &= PAD_PULLKEEP_SLCT(x)
#define PAD_PULLKEEP_SET(PAD_REG, x)      PAD_REG &= PAD_PULLKEEP(x)
#define PAD_OPENDRAIN_SET(PAD_REG, x)     PAD_REG &= PAD_OPENDRAIN(x)
#define PAD_SPEED_SET(PAD_REG, x)         PAD_REG &= PAD_SPEED(x)
#define PAD_DSE_SET(PAD_REG, x)           PAD_REG &= PAD_DSE(x)
#define PAD_SLEW_RATE_SET(PAD_REG, x)     PAD_REG &= PAD_SLEW_RATE(x)

// 11.7 IOMUXC Memory Map/Register definition, DAISY Registers
// p.417 - p.426
#define IOMUXC_32BASE04                      MAP_32BIT_REGISTER(0x401f83f4)
#define IOMUXC_ANATOP_USBOTG1_ID__SLCT_IN_DR IOMUXC_32BASE04._0x0000
#define IOMUXC_ANATOP_USBOTG2_ID__SLCT_IN_DR IOMUXC_32BASE04._0x0004
#define IOMUXC_CCM_PMIC_RDY__SLCT_IN_DR      IOMUXC_32BASE04._0x0008

// CSI
#define IOMUXC_CSI_DATA02__SLCT_IN_DR IOMUXC_32BASE04._0x000c
#define IOMUXC_CSI_DATA03__SLCT_IN_DR IOMUXC_32BASE04._0x0010
#define IOMUXC_CSI_DATA04__SLCT_IN_DR IOMUXC_32BASE04._0x0014
#define IOMUXC_CSI_DATA05__SLCT_IN_DR IOMUXC_32BASE04._0x0018
#define IOMUXC_CSI_DATA06__SLCT_IN_DR IOMUXC_32BASE04._0x001c
#define IOMUXC_CSI_DATA07__SLCT_IN_DR IOMUXC_32BASE04._0x0020
#define IOMUXC_CSI_DATA08__SLCT_IN_DR IOMUXC_32BASE04._0x0024
#define IOMUXC_CSI_DATA09__SLCT_IN_DR IOMUXC_32BASE04._0x0028

