AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
#define IOMUXC_CSI_HSYNC__SLCT_IN_DR  IOMUXC_32BASE04._0x002c
#define IOMUXC_CSI_PIXCLK__SLCT_IN_DR IOMUXC_32BASE04._0x0030
#define IOMUXC_CSI_VSYNC__SLCT_IN_DR  IOMUXC_32BASE04._0x0034

// ENET
#define IOMUXC_ENET_IPG_CLKRMII__SLCT_IN_DR IOMUXC_32BASE04._0x0038
#define IOMUXC_ENET_MDIO__SLCT_IN_DR        IOMUXC_32BASE04._0x003c
#define IOMUXC_ENET_RXDATA__SLCT_IN_DR00    IOMUXC_32BASE04._0x0040
#define IOMUXC_ENET_RXDATA__SLCT_IN_DR01    IOMUXC_32BASE04._0x0044
#define IOMUXC_ENET_RXEN__SLCT_IN_DR        IOMUXC_32BASE04._0x0048 // RX ENABLE
#define IOMUXC_ENET_RXERR__SLCT_IN_DR       IOMUXC_32BASE04._0x004c // RX ERROR
#define IOMUXC_ENET_TIMER__SLCT_IN_DR00     IOMUXC_32BASE04._0x0050
#define IOMUXC_ENET_TXCLK__SLCT_IN_DR00     IOMUXC_32BASE04._0x0054

// FLEX
#define IOMUXC_FLEXCAN1_RX__SLCT_IN_DR00 IOMUXC_32BASE04._0x0058
#define IOMUXC_FLEXCAN2_RX__SLCT_IN_DR00 IOMUXC_32BASE04._0x005c

#define IOMUXC_FLEXPWM01_PWMA03__SLCT_IN_DR IOMUXC_32BASE04._0x0060
#define IOMUXC_FLEXPWM01_PWMA00__SLCT_IN_DR IOMUXC_32BASE04._0x0064
#define IOMUXC_FLEXPWM01_PWMA01__SLCT_IN_DR IOMUXC_32BASE04._0x0068
#define IOMUXC_FLEXPWM01_PWMA02__SLCT_IN_DR IOMUXC_32BASE04._0x006c
#define IOMUXC_FLEXPWM01_PWMB03__SLCT_IN_DR IOMUXC_32BASE04._0x0070
#define IOMUXC_FLEXPWM01_PWMB00__SLCT_IN_DR IOMUXC_32BASE04._0x0074
#define IOMUXC_FLEXPWM01_PWMB01__SLCT_IN_DR IOMUXC_32BASE04._0x0078
#define IOMUXC_FLEXPWM01_PWMB02__SLCT_IN_DR IOMUXC_32BASE04._0x007c
#define IOMUXC_FLEXPWM02_PWMA03__SLCT_IN_DR IOMUXC_32BASE04._0x0080
#define IOMUXC_FLEXPWM02_PWMA00__SLCT_IN_DR IOMUXC_32BASE04._0x0084
#define IOMUXC_FLEXPWM02_PWMA01__SLCT_IN_DR IOMUXC_32BASE04._0x0088
#define IOMUXC_FLEXPWM02_PWMA02__SLCT_IN_DR IOMUXC_32BASE04._0x008c
#define IOMUXC_FLEXPWM02_PWMB03__SLCT_IN_DR IOMUXC_32BASE04._0x0090
#define IOMUXC_FLEXPWM02_PWMB00__SLCT_IN_DR IOMUXC_32BASE04._0x0094
#define IOMUXC_FLEXPWM02_PWMB01__SLCT_IN_DR IOMUXC_32BASE04._0x0098
#define IOMUXC_FLEXPWM02_PWMB02__SLCT_IN_DR IOMUXC_32BASE04._0x009c
#define IOMUXC_FLEXPWM04_PWMA00__SLCT_IN_DR IOMUXC_32BASE04._0x00a0
#define IOMUXC_FLEXPWM04_PWMA01__SLCT_IN_DR IOMUXC_32BASE04._0x00a4
#define IOMUXC_FLEXPWM04_PWMA02__SLCT_IN_DR IOMUXC_32BASE04._0x00a8
#define IOMUXC_FLEXPWM04_PWMA03__SLCT_IN_DR IOMUXC_32BASE04._0x00ac

#define IOMUXC_FLEXSPIA_DQS_SLCT_IN_DR IOMUXC_32BASE04._0x00b0

#define IOMUXC_FLEXSPIA_DATA0__SLCT_IN_DR IOMUXC_32BASE04._0x00b4
#define IOMUXC_FLEXSPIA_DATA1__SLCT_IN_DR IOMUXC_32BASE04._0x00b8
#define IOMUXC_FLEXSPIA_DATA2__SLCT_IN_DR IOMUXC_32BASE04._0x00bc
#define IOMUXC_FLEXSPIA_DATA3__SLCT_IN_DR IOMUXC_32BASE04._0x00c0
#define IOMUXC_FLEXSPIB_DATA0__SLCT_IN_DR IOMUXC_32BASE04._0x00c4
#define IOMUXC_FLEXSPIB_DATA1__SLCT_IN_DR IOMUXC_32BASE04._0x00c8
#define IOMUXC_FLEXSPIB_DATA2__SLCT_IN_DR IOMUXC_32BASE04._0x00cc
#define IOMUXC_FLEXSPIB_DATA3__SLCT_IN_DR IOMUXC_32BASE04._0x00d0

#define IOMUXC_FLEXSPIA_SCK__SLCT_IN_DR IOMUXC_32BASE04._0x00d4

// LPI2C
#define IOMUXC_LPI2C1_SCL__SLCT_IN_DR IOMUXC_32BASE04._0x00d8
#define IOMUXC_LPI2C1_SDA__SLCT_IN_DR IOMUXC_32BASE04._0x00dc
#define IOMUXC_LPI2C2_SCL__SLCT_IN_DR IOMUXC_32BASE04._0x00e0
#define IOMUXC_LPI2C2_SDA__SLCT_IN_DR IOMUXC_32BASE04._0x00e4
#define IOMUXC_LPI2C3_SCL__SLCT_IN_DR IOMUXC_32BASE04._0x00e8
#define IOMUXC_LPI2C3_SDA__SLCT_IN_DR IOMUXC_32BASE04._0x00ec
#define IOMUXC_LPI2C4_SCL__SLCT_IN_DR IOMUXC_32BASE04._0x00f0
#define IOMUXC_LPI2C4_SDA__SLCT_IN_DR IOMUXC_32BASE04._0x00f4

// LPSPI
#define IOMUXC_LPSPI1_PCS0__SLCT_IN_DR IOMUXC_32BASE04._0x00f8
#define IOMUXC_LPSPI1_SCK__SLCT_IN_DR  IOMUXC_32BASE04._0x00fc
#define IOMUXC_LPSPI1_SDI__SLCT_IN_DR  IOMUXC_32BASE04._0x0100
#define IOMUXC_LPSPI1_SDO__SLCT_IN_DR  IOMUXC_32BASE04._0x0104

#define IOMUXC_LPSPI2_SCK0__SLCT_IN_DR IOMUXC_32BASE04._0x0108
#define IOMUXC_LPSPI2_SCK__SLCT_IN_DR  IOMUXC_32BASE04._0x010c
#define IOMUXC_LPSPI2_SDI__SLCT_IN_DR  IOMUXC_32BASE04._0x0110
#define IOMUXC_LPSPI2_SDO__SLCT_IN_DR  IOMUXC_32BASE04._0x0114

#define IOMUXC_LPSPI3_SCK0__SLCT_IN_DR IOMUXC_32BASE04._0x0118
#define IOMUXC_LPSPI3_SCK__SLCT_IN_DR  IOMUXC_32BASE04._0x011c
#define IOMUXC_LPSPI3_SDI__SLCT_IN_DR  IOMUXC_32BASE04._0x0120
#define IOMUXC_LPSPI3_SDO__SLCT_IN_DR  IOMUXC_32BASE04._0x0124

#define IOMUXC_LPSPI4_SCK0__SLCT_IN_DR IOMUXC_32BASE04._0x0128
#define IOMUXC_LPSPI4_SCK__SLCT_IN_DR  IOMUXC_32BASE04._0x012c
#define IOMUXC_LPSPI4_SDI__SLCT_IN_DR  IOMUXC_32BASE04._0x0130
#define IOMUXC_LPSPI4_SDO__SLCT_IN_DR  IOMUXC_32BASE04._0x0134

// LPUART 2-8 (15)
#define IOMUXC2_LPUART_RX__SLCT_IN_DR    IOMUXC_32BASE04._0x0138
#define IOMUXC2_LPUART_TX__SLCT_IN_DR    IOMUXC_32BASE04._0x013c
#define IOMUXC3_LPUART_CTS_B__SLCT_IN_DR IOMUXC_32BASE04._0x0140
#define IOMUXC3_LPUART_RX__SLCT_IN_DR    IOMUXC_32BASE04._0x0144
#define IOMUXC3_LPUART_TX__SLCT_IN_DR    IOMUXC_32BASE04._0x0148
#define IOMUXC4_LPUART_RX__SLCT_IN_DR    IOMUXC_32BASE04._0x014c
#define IOMUXC4_LPUART_TX__SLCT_IN_DR    IOMUXC_32BASE04._0x0150
#define IOMUXC5_LPUART_RX__SLCT_IN_DR    IOMUXC_32BASE04._0x0154
#define IOMUXC5_LPUART_TX__SLCT_IN_DR    IOMUXC_32BASE04._0x0158
#define IOMUXC6_LPUART_RX__SLCT_IN_DR    IOMUXC_32BASE04._0x015c
#define IOMUXC6_LPUART_TX__SLCT_IN_DR    IOMUXC_32BASE04._0x0160
#define IOMUXC7_LPUART_RX__SLCT_IN_DR    IOMUXC_32BASE04._0x0164
#define IOMUXC7_LPUART_TX__SLCT_IN_DR    IOMUXC_32BASE04._0x0168
#define IOMUXC8_LPUART_RX__SLCT_IN_DR    IOMUXC_32BASE04._0x016c
#define IOMUXC9_LPUART_TX__SLCT_IN_DR    IOMUXC_32BASE04._0x0170

#define IOMUXC_NMI_SLCT_IN_DR IOMUXC_32BASE04._0x0174

// QTIMER (8)

#define IOMUXC_QTIMER2_TIMER0__SLCT_IN_DR IOMUXC_32BASE04._0x0178
#define IOMUXC_QTIMER2_TIMER1__SLCT_IN_DR IOMUXC_32BASE04._0x017c
#define IOMUXC_QTIMER2_TIMER2__SLCT_IN_DR IOMUXC_32BASE04._0x0180
#define IOMUXC_QTIMER2_TIMER3__SLCT_IN_DR IOMUXC_32BASE04._0x0184
#define IOMUXC_QTIMER3_TIMER0__SLCT_IN_DR IOMUXC_32BASE04._0x0188
#define IOMUXC_QTIMER3_TIMER1__SLCT_IN_DR IOMUXC_32BASE04._0x018c
#define IOMUXC_QTIMER3_TIMER2__SLCT_IN_DR IOMUXC_32BASE04._0x0190
#define IOMUXC_QTIMER3_TIMER3__SLCT_IN_DR IOMUXC_32BASE04._0x0194

