AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
// SAI1,SAI2 (15)
#define IOMUXC_SAI1_MCLK2__SLCT_IN_DR    IOMUXC_32BASE04._0x0198
#define IOMUXC_SAI1_RX_BCLK__SLCT_IN_DR  IOMUXC_32BASE04._0x019c
#define IOMUXC_SAI1_RX_DATA0__SLCT_IN_DR IOMUXC_32BASE04._0x01a0
#define IOMUXC_SAI1_RX_DATA1__SLCT_IN_DR IOMUXC_32BASE04._0x01a4
#define IOMUXC_SAI1_RX_DATA2__SLCT_IN_DR IOMUXC_32BASE04._0x01a8
#define IOMUXC_SAI1_RX_DATA3__SLCT_IN_DR IOMUXC_32BASE04._0x01ac
#define IOMUXC_SAI1_RX_SYNC__SLCT_IN_DR  IOMUXC_32BASE04._0x01b0
#define IOMUXC_SAI1_TX_BCLK__SLCT_IN_DR  IOMUXC_32BASE04._0x01b4
#define IOMUXC_SAI1_TX_SYNC__SLCT_IN_DR  IOMUXC_32BASE04._0x01b8
#define IOMUXC_SAI2_MCLK2__SLCT_IN_DR    IOMUXC_32BASE04._0x01bc
#define IOMUXC_SAI2_RX_BCLK__SLCT_IN_DR  IOMUXC_32BASE04._0x01c0
#define IOMUXC_SAI2_RX_DATA0__SLCT_IN_DR IOMUXC_32BASE04._0x01c4
#define IOMUXC_SAI2_RX_SYNC__SLCT_IN_DR  IOMUXC_32BASE04._0x01c8
#define IOMUXC_SAI2_TX_BCLK__SLCT_IN_DR  IOMUXC_32BASE04._0x01cc
#define IOMUXC_SAI2_TX_SYNC__SLCT_IN_DR  IOMUXC_32BASE04._0x01d0
#define IOMUXC_SPDIF_IN__SLCT_IN_DR      IOMUXC_32BASE04._0x01d4

// USB (2)
#define IOMUXC_USB_OTG2_OC__SLCT_IN_DR IOMUXC_32BASE04._0x01d8
#define IOMUXC_USB_OTG1_OC__SLCT_IN_DR IOMUXC_32BASE04._0x01dc

// USDHC (14)
#define IOMUXC_USDHC1_CD_B__SLCT_IN_DR  IOMUXC_32BASE04._0x01e0
#define IOMUXC_USDHC1_WP__SLCT_IN_DR    IOMUXC_32BASE04._0x01e4
#define IOMUXC_USDHC2_CLK__SLCT_IN_DR   IOMUXC_32BASE04._0x01e8
#define IOMUXC_USDHC2_CD_B__SLCT_IN_DR  IOMUXC_32BASE04._0x01ec
#define IOMUXC_USDHC2_CMD__SLCT_IN_DR   IOMUXC_32BASE04._0x01f0
#define IOMUXC_USDHC2_DATA0__SLCT_IN_DR IOMUXC_32BASE04._0x01f4
#define IOMUXC_USDHC2_DATA1__SLCT_IN_DR IOMUXC_32BASE04._0x01f8
#define IOMUXC_USDHC2_DATA2__SLCT_IN_DR IOMUXC_32BASE04._0x01fc
#define IOMUXC_USDHC2_DATA3__SLCT_IN_DR IOMUXC_32BASE04._0x0200
#define IOMUXC_USDHC2_DATA4__SLCT_IN_DR IOMUXC_32BASE04._0x0204
#define IOMUXC_USDHC2_DATA5__SLCT_IN_DR IOMUXC_32BASE04._0x0208
#define IOMUXC_USDHC2_DATA6__SLCT_IN_DR IOMUXC_32BASE04._0x020c
#define IOMUXC_USDHC2_DATA7__SLCT_IN_DR IOMUXC_32BASE04._0x0210
#define IOMUXC_USDHC2_WP__SLCT_IN_DR    IOMUXC_32BASE04._0x0214

// XBAR (20) p.423-p.424
#define IOMUXC_XBAR1_IN02__SLCT_IN_DR IOMUXC_32BASE04._0x0218
#define IOMUXC_XBAR1_IN03__SLCT_IN_DR IOMUXC_32BASE04._0x021c
#define IOMUXC_XBAR1_IN04__SLCT_IN_DR IOMUXC_32BASE04._0x0220
#define IOMUXC_XBAR1_IN05__SLCT_IN_DR IOMUXC_32BASE04._0x0224
#define IOMUXC_XBAR1_IN06__SLCT_IN_DR IOMUXC_32BASE04._0x0228
#define IOMUXC_XBAR1_IN07__SLCT_IN_DR IOMUXC_32BASE04._0x022c
#define IOMUXC_XBAR1_IN08__SLCT_IN_DR IOMUXC_32BASE04._0x0230
#define IOMUXC_XBAR1_IN09__SLCT_IN_DR IOMUXC_32BASE04._0x0234
#define IOMUXC_XBAR1_IN17__SLCT_IN_DR IOMUXC_32BASE04._0x0238
#define IOMUXC_XBAR1_IN18__SLCT_IN_DR IOMUXC_32BASE04._0x023c
#define IOMUXC_XBAR1_IN20__SLCT_IN_DR IOMUXC_32BASE04._0x0240
#define IOMUXC_XBAR1_IN22__SLCT_IN_DR IOMUXC_32BASE04._0x0244
#define IOMUXC_XBAR1_IN23__SLCT_IN_DR IOMUXC_32BASE04._0x0248
#define IOMUXC_XBAR1_IN24__SLCT_IN_DR IOMUXC_32BASE04._0x024c
#define IOMUXC_XBAR1_IN14__SLCT_IN_DR IOMUXC_32BASE04._0x0250
#define IOMUXC_XBAR1_IN15__SLCT_IN_DR IOMUXC_32BASE04._0x0254
#define IOMUXC_XBAR1_IN16__SLCT_IN_DR IOMUXC_32BASE04._0x0258
#define IOMUXC_XBAR1_IN25__SLCT_IN_DR IOMUXC_32BASE04._0x025c
#define IOMUXC_XBAR1_IN19__SLCT_IN_DR IOMUXC_32BASE04._0x0260
#define IOMUXC_XBAR1_IN21__SLCT_IN_DR IOMUXC_32BASE04._0x0264

// ENET2 (8)
#define IOMUXC_ENET2_IPG_CLK_RMII__SLCT_IN_DR         IOMUXC_32BASE04._0x0318
#define IOMUXC_ENET2_IPP_IND_MAC0_MDIO__SLCT_IN_DR    IOMUXC_32BASE04._0x031c
#define IOMUXC_ENET2_IPP_IND_MAC0_RXDATA0__SLCT_IN_DR IOMUXC_32BASE04._0x0320
#define IOMUXC_ENET2_IPP_IND_MAC0_RXDATA1__SLCT_IN_DR IOMUXC_32BASE04._0x0324
#define IOMUXC_ENET2_IPP_IND_MAC0_RXEN__SLCT_IN_DR    IOMUXC_32BASE04._0x0328
#define IOMUXC_ENET2_IPP_IND_MAC0_RXERR__SLCT_IN_DR   IOMUXC_32BASE04._0x032c
#define IOMUXC_ENET2_IPP_IND_MAC0_TIMER__SLCT_IN_DR   IOMUXC_32BASE04._0x0330
#define IOMUXC_ENET2_IPP_IND_MAC0_TXCLK__SLCT_IN_DR   IOMUXC_32BASE04._0x0334

// FLEXSPI2 (11)
#define IOMUXC_FLEXSPI2_IPP_IND_DQS_FA__SLCT_IN_DR     IOMUXC_32BASE04._0x0338
#define IOMUXC_FLEXSPI2_IPP_IND_IO_FA_BIT0__SLCT_IN_DR IOMUXC_32BASE04._0x033c
#define IOMUXC_FLEXSPI2_IPP_IND_IO_FA_BIT1__SLCT_IN_DR IOMUXC_32BASE04._0x0340
#define IOMUXC_FLEXSPI2_IPP_IND_IO_FA_BIT2__SLCT_IN_DR IOMUXC_32BASE04._0x0344
#define IOMUXC_FLEXSPI2_IPP_IND_IO_FA_BIT3__SLCT_IN_DR IOMUXC_32BASE04._0x0348
#define IOMUXC_FLEXSPI2_IPP_IND_IO_FB_BIT0__SLCT_IN_DR IOMUXC_32BASE04._0x034c
#define IOMUXC_FLEXSPI2_IPP_IND_IO_FB_BIT1__SLCT_IN_DR IOMUXC_32BASE04._0x0350
#define IOMUXC_FLEXSPI2_IPP_IND_IO_FB_BIT2__SLCT_IN_DR IOMUXC_32BASE04._0x0354
#define IOMUXC_FLEXSPI2_IPP_IND_IO_FB_BIT3__SLCT_IN_DR IOMUXC_32BASE04._0x0358
#define IOMUXC_FLEXSPI2_IPP_IND_SCK_FA__SLCT_IN_DR     IOMUXC_32BASE04._0x035c
#define IOMUXC_FLEXSPI2_IPP_IND_SCK_FB__SLCT_IN_DR     IOMUXC_32BASE04._0x0360

// GPT (6)
#define IOMUXC_GPT1_IPP_IND_CAPIN1__SLCT_IN_DR IOMUXC_32BASE04._0x0364
#define IOMUXC_GPT1_IPP_IND_CAPIN2__SLCT_IN_DR IOMUXC_32BASE04._0x0368
#define IOMUXC_GPT1_IPP_IND_CLKIN__SLCT_IN_DR  IOMUXC_32BASE04._0x036c
#define IOMUXC_GPT2_IPP_IND_CAPIN1__SLCT_IN_DR IOMUXC_32BASE04._0x0370
#define IOMUXC_GPT2_IPP_IND_CAPIN2__SLCT_IN_DR IOMUXC_32BASE04._0x0374
#define IOMUXC_GPT2_IPP_IND_CLKIN__SLCT_IN_DR  IOMUXC_32BASE04._0x0378

// SAI3 (6)
#define IOMUXC_SAI3_IPG_CLK_SAI_MCLK__SLCT_IN_DR IOMUXC_32BASE04._0x037c
#define IOMUXC_SAI3_IPP_IND_RXBCLK__SLCT_IN_DR   IOMUXC_32BASE04._0x0380
#define IOMUXC_SAI3_IPP_IND_RXDATA__SLCT_IN_DR   IOMUXC_32BASE04._0x0384
#define IOMUXC_SAI3_IPP_IND_RXDSYNC__SLCT_IN_DR  IOMUXC_32BASE04._0x0388
#define IOMUXC_SAI3_IPP_IND_TXBCLK__SLCT_IN_DR   IOMUXC_32BASE04._0x038c
#define IOMUXC_SAI3_IPP_IND_TXSYNC__SLCT_IN_DR   IOMUXC_32BASE04._0x0390

// SEMC (1)
#define IOMUXC_SEMC_IPP_IND_DQS4__SLCT_IN_DR IOMUXC_32BASE04._0x0394

// CANFD (1)
#define IOMUXC_CANFD_IPP_IND_CANRX__SLCT_IN_DR IOMUXC_32BASE04._0x0398

//===

/**
 * @brief: GPIO Memory Map, 12.5.1, p.961
 * GPIOn base address: 401B_8000h + (n-1)×4000h, where n is from 1 to 4.
 * GPIO5 base address: 400C_0000h.
 * GPIOn base address: 4200_0000h + (n-6)×4000h, where n is from 6 to 9.
 *
 **/

#define GPIO_1_4_32BASE00 MAP_32BIT_REGISTER(0x401b8000)
#define GPIO_1_4_32BASE01 MAP_32BIT_REGISTER(0x401bc000)
#define GPIO_1_4_32BASE02 MAP_32BIT_REGISTER(0x401c0000)
#define GPIO_1_4_32BASE03 MAP_32BIT_REGISTER(0x401c4000)
#define GPIO_5_32BASE00   MAP_32BIT_REGISTER(0x400c0000)
#define GPIO_6_9_32BASE00 MAP_32BIT_REGISTER(0x42000000)
#define GPIO_6_9_32BASE01 MAP_32BIT_REGISTER(0x42004000)
#define GPIO_6_9_32BASE02 MAP_32BIT_REGISTER(0x42008000)
#define GPIO_6_9_32BASE03 MAP_32BIT_REGISTER(0x4200c000)
#define GPIO_6_9_32BASE04 MAP_32BIT_REGISTER(0x42010000)
#define GPIO_6_9_32BASE05 MAP_32BIT_REGISTER(0x42014000)

