AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
// GPIO1
#define GPIO1_DR        GPIO_1_4_32BASE00._0x0000
#define GPIO1_DIRR      GPIO_1_4_32BASE00._0x0004
#define GPIO1_PSR       GPIO_1_4_32BASE00._0x0008
#define GPIO1_ICR1      GPIO_1_4_32BASE00._0x000c
#define GPIO1_ICR2      GPIO_1_4_32BASE00._0x0010
#define GPIO1_IMR       GPIO_1_4_32BASE00._0x0014
#define GPIO1_ISR       GPIO_1_4_32BASE00._0x0018
#define GPIO1_EDGE_SEL  GPIO_1_4_32BASE00._0x001c
#define GPIO1_DR_SET    GPIO_1_4_32BASE00._0x0084
#define GPIO1_DR_CLEAR  GPIO_1_4_32BASE00._0x0088
#define GPIO1_DR_TOGGLE GPIO_1_4_32BASE00._0x008c

// GPIO2
#define GPIO2_DR        GPIO_1_4_32BASE01._0x0000
#define GPIO2_DIRR      GPIO_1_4_32BASE01._0x0004
#define GPIO2_PSR       GPIO_1_4_32BASE01._0x0008
#define GPIO2_ICR1      GPIO_1_4_32BASE01._0x000c
#define GPIO2_ICR2      GPIO_1_4_32BASE01._0x0010
#define GPIO2_IMR       GPIO_1_4_32BASE01._0x0014
#define GPIO2_ISR       GPIO_1_4_32BASE01._0x0018
#define GPIO2_EDGE_SEL  GPIO_1_4_32BASE01._0x001c
#define GPIO2_DR_SET    GPIO_1_4_32BASE01._0x0084
#define GPIO2_DR_CLEAR  GPIO_1_4_32BASE01._0x0088
#define GPIO2_DR_TOGGLE GPIO_1_4_32BASE01._0x008c

// GPIO3
#define GPIO3_DR        GPIO_1_4_32BASE02._0x0000
#define GPIO3_DIRR      GPIO_1_4_32BASE02._0x0004
#define GPIO3_PSR       GPIO_1_4_32BASE02._0x0008
#define GPIO3_ICR1      GPIO_1_4_32BASE02._0x000c
#define GPIO3_ICR2      GPIO_1_4_32BASE02._0x0010
#define GPIO3_IMR       GPIO_1_4_32BASE02._0x0014
#define GPIO3_ISR       GPIO_1_4_32BASE02._0x0018
#define GPIO3_EDGE_SEL  GPIO_1_4_32BASE02._0x001c
#define GPIO3_DR_SET    GPIO_1_4_32BASE02._0x0084
#define GPIO3_DR_CLEAR  GPIO_1_4_32BASE02._0x0088
#define GPIO3_DR_TOGGLE GPIO_1_4_32BASE02._0x008c

// GPIO4
#define GPIO4_DR        GPIO_1_4_32BASE03._0x0000
#define GPIO4_DIRR      GPIO_1_4_32BASE03._0x0004
#define GPIO4_PSR       GPIO_1_4_32BASE03._0x0008
#define GPIO4_ICR1      GPIO_1_4_32BASE03._0x000c
#define GPIO4_ICR2      GPIO_1_4_32BASE03._0x0010
#define GPIO4_IMR       GPIO_1_4_32BASE03._0x0014
#define GPIO4_ISR       GPIO_1_4_32BASE03._0x0018
#define GPIO4_EDGE_SEL  GPIO_1_4_32BASE03._0x001c
#define GPIO4_DR_SET    GPIO_1_4_32BASE03._0x0084
#define GPIO4_DR_CLEAR  GPIO_1_4_32BASE03._0x0088
#define GPIO4_DR_TOGGLE GPIO_1_4_32BASE03._0x008c

// GPIO5
#define GPIO5_DR        GPIO_5_32BASE00._0x0000
#define GPIO5_DIRR      GPIO_5_32BASE00._0x0004
#define GPIO5_PSR       GPIO_5_32BASE00._0x0008
#define GPIO5_ICR1      GPIO_5_32BASE00._0x000c
#define GPIO5_ICR2      GPIO_5_32BASE00._0x0010
#define GPIO5_IMR       GPIO_5_32BASE00._0x0014
#define GPIO5_ISR       GPIO_5_32BASE00._0x0018
#define GPIO5_EDGE_SEL  GPIO_5_32BASE00._0x001c
#define GPIO5_DR_SET    GPIO_5_32BASE00._0x0084
#define GPIO5_DR_CLEAR  GPIO_5_32BASE00._0x0088
#define GPIO5_DR_TOGGLE GPIO_5_32BASE00._0x008c

// GPIO6
#define GPIO6_DR        GPIO_6_9_32BASE00._0x0000
#define GPIO6_DIRR      GPIO_6_9_32BASE00._0x0004
#define GPIO6_PSR       GPIO_6_9_32BASE00._0x0008
#define GPIO6_ICR1      GPIO_6_9_32BASE00._0x000c
#define GPIO6_ICR2      GPIO_6_9_32BASE00._0x0010
#define GPIO6_IMR       GPIO_6_9_32BASE00._0x0014
#define GPIO6_ISR       GPIO_6_9_32BASE00._0x0018
#define GPIO6_EDGE_SEL  GPIO_6_9_32BASE00._0x001c
#define GPIO6_DR_SET    GPIO_6_9_32BASE00._0x0084
#define GPIO6_DR_CLEAR  GPIO_6_9_32BASE00._0x0088
#define GPIO6_DR_TOGGLE GPIO_6_9_32BASE00._0x008c

// GPIO7
#define GPIO7_DR        GPIO_6_9_32BASE01._0x0000
#define GPIO7_DIRR      GPIO_6_9_32BASE01._0x0004
#define GPIO7_PSR       GPIO_6_9_32BASE01._0x0008
#define GPIO7_ICR1      GPIO_6_9_32BASE01._0x000c
#define GPIO7_ICR2      GPIO_6_9_32BASE01._0x0010
#define GPIO7_IMR       GPIO_6_9_32BASE01._0x0014
#define GPIO7_ISR       GPIO_6_9_32BASE01._0x0018
#define GPIO7_EDGE_SEL  GPIO_6_9_32BASE01._0x001c
#define GPIO7_DR_SET    GPIO_6_9_32BASE01._0x0084
#define GPIO7_DR_CLEAR  GPIO_6_9_32BASE01._0x0088
#define GPIO7_DR_TOGGLE GPIO_6_9_32BASE01._0x008c

// GPIO8
#define GPIO8_DR        GPIO_6_9_32BASE02._0x0000
#define GPIO8_DIRR      GPIO_6_9_32BASE02._0x0004
#define GPIO8_PSR       GPIO_6_9_32BASE02._0x0008
#define GPIO8_ICR1      GPIO_6_9_32BASE02._0x000c
#define GPIO8_ICR2      GPIO_6_9_32BASE02._0x0010
#define GPIO8_IMR       GPIO_6_9_32BASE02._0x0014
#define GPIO8_ISR       GPIO_6_9_32BASE02._0x0018
#define GPIO8_EDGE_SEL  GPIO_6_9_32BASE02._0x001c
#define GPIO8_DR_SET    GPIO_6_9_32BASE02._0x0084
#define GPIO8_DR_CLEAR  GPIO_6_9_32BASE02._0x0088
#define GPIO8_DR_TOGGLE GPIO_6_9_32BASE02._0x008c

// GPIO9
#define GPIO9_DR        GPIO_6_9_32BASE03._0x0000
#define GPIO9_DIRR      GPIO_6_9_32BASE03._0x0004
#define GPIO9_PSR       GPIO_6_9_32BASE03._0x0008
#define GPIO9_ICR1      GPIO_6_9_32BASE03._0x000c
#define GPIO9_ICR2      GPIO_6_9_32BASE03._0x0010
#define GPIO9_IMR       GPIO_6_9_32BASE03._0x0014
#define GPIO9_ISR       GPIO_6_9_32BASE03._0x0018
#define GPIO9_EDGE_SEL  GPIO_6_9_32BASE03._0x001c
#define GPIO9_DR_SET    GPIO_6_9_32BASE03._0x0084
#define GPIO9_DR_CLEAR  GPIO_6_9_32BASE03._0x0088
#define GPIO9_DR_TOGGLE GPIO_6_9_32BASE03._0x008c

/**
 * @brief: CCM Memory Map, 14.7, p.1045
 * The register reset values for CCM change depending on the boot configuration.
 * See Clocks at boot time for more information
 *
 **/
#define CCM_BASE    MAP_32BIT_REGISTER(0x400fc000)
#define CCM_C_CR    CCM_BASE._0x0000 // Control Register
#define CCM_C_SR    CCM_BASE._0x0008 // Read-Only, Status Register
#define CCM_C_CSR   CCM_BASE._0x000c // CLock Switcher Register
#define CCM_C_ACRR  CCM_BASE._0x0010 // Arm Clock Root Register
#define CCM_C_BCDR  CCM_BASE._0x0014 // Bus Clock Divider Register
#define CCM_C_BCMR  CCM_BASE._0x0018 // Bus Clock Multiplexer Register
#define CCM_C_SCMR1 CCM_BASE._0x001c // Serial Clock Multiplexer Register 1
#define CCM_C_SCMR2 CCM_BASE._0x0020 // Serial Clock Multiplexer Register 2

#define CCM_C_SCDR1 CCM_BASE._0x0024 // Serial Clock Divider Register 1
#define CCM_C_S1CDR CCM_BASE._0x0028 // Clock Divider Register 1
#define CCM_C_S2CDR CCM_BASE._0x002c // Clock Divider Register 2
#define CCM_C_DCDR  CCM_BASE._0x0030 // D1 Clock Divider Register
#define CCM_C_SCDR2 CCM_BASE._0x0038 // Serial Clock Divider Register 2
#define CCM_C_SCDR3 CCM_BASE._0x003c // Serial Clock Divider Register 3
#define CCM_C_DHIPR                                                            \
  CCM_BASE._0x0048 // Read-Only, Divider Handshake In-Process Register
#define CCM_C_LPCR CCM_BASE._0x0054 // Lowe Power Control Register
#define CCM_C_ISR  CCM_BASE._0x0058 // w1c, Interrupt Status Register
#define CCM_C_IMR  CCM_BASE._0x005c // Interrupt Mask Register
#define CCM_C_COSR CCM_BASE._0x0060 // Clock Output Source Register
#define CCM_C_GPR  CCM_BASE._0x0064 // General Purpose Register
#define CCM_C_CGR0 CCM_BASE._0x0068 // Clock Gating Register 0
#define CCM_C_CGR1 CCM_BASE._0x006c // Clock Gating Register 1
#define CCM_C_CGR2 CCM_BASE._0x0070 // Clock Gating Register 2
#define CCM_C_CGR3 CCM_BASE._0x0074 // Clock Gating Register 3
#define CCM_C_CGR4 CCM_BASE._0x0078 // Clock Gating Register 4
#define CCM_C_CGR5 CCM_BASE._0x007c // Clock Gating Register 5
#define CCM_C_CGR6 CCM_BASE._0x0080 // Clock Gating Register 6
#define CCM_C_CGR7 CCM_BASE._0x0084 // Clock Gating Register 7
#define CCM_C_MEOR CCM_BASE._0x0088 // Module Enable Overide Register

