AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
typedef enum
{
  CLK_OFF_ALL_MODES = 0x0,
  CLK_ON_RUN_MODE = 0x1,
  CLK_ON_ALL_MODES = 0x3,
} ECGR;
#define CCM_SET_PIT_ENABLE(x)                                                  \
  CCM_C_CGR1 = (CCM_C_CGR1 & ~(0x3 << 0xc)) | ((x & 0x3) << 0xc)

/**
 * @brief: CCM Analog Memory Map, 14.8, p.1096
 * The register reset values for CCM change depending on the boot configuration.
 * See Clocks at boot time for more information
 *
 * This section describes the registers for the analog PLLs.
 * The registers which have the same description are grouped within {}.
 * The register offsets for the various PLLs are:
 * •  ARM PLL: {0h000, 0h004, 0h008, 0h00C}.
 * •  USB1 PLL: {0h010, 0h014, 0h018, 0h01C}, {0h0F0, 0h0F4, 0h0F8, 0h0FC}.
 * •  System PLL: {0h030, 0h034, 0h038, 0h03C}, 0h040, 0h050, 0h060,
 *    {0h100,0h104,0h108, 0h10C}.
 * • Audio / Video PLL: {0h070, 0h074, 0h078, 0h07C},
 *    0h080, 0h090, {0h0A0, 0h0A4,0h0A8, 0h0AC}, 0h0B0, 0h0C0
 *
 **/
#define CCM_ANALOG_BASE MAP_32BIT_REGISTER(0x400d8000)
// ARM PLL
#define CCM_ANALOG_PLL_ARM     CCM_ANALOG_BASE._0x0000
#define CCM_ANALOG_PLL_ARM_SET CCM_ANALOG_BASE._0x0004
#define CCM_ANALOG_PLL_ARM_CLR CCM_ANALOG_BASE._0x0008
#define CCM_ANALOG_PLL_ARM_TOG CCM_ANALOG_BASE._0x000c

// UBS1 PLL
#define CCM_ANALOG_PLL_USB1     CCM_ANALOG_BASE._0x0010
#define CCM_ANALOG_PLL_USB1_SET CCM_ANALOG_BASE._0x0014
#define CCM_ANALOG_PLL_USB1_CLR CCM_ANALOG_BASE._0x0018
#define CCM_ANALOG_PLL_USB1_TOG CCM_ANALOG_BASE._0x001c

// USB2 PLL
#define CCM_ANALOG_PLL_USB2     CCM_ANALOG_BASE._0x0020
#define CCM_ANALOG_PLL_USB2_SET CCM_ANALOG_BASE._0x0024
#define CCM_ANALOG_PLL_USB2_CLR CCM_ANALOG_BASE._0x0028
#define CCM_ANALOG_PLL_USB2_TOG CCM_ANALOG_BASE._0x002c

// ANALOG SYSTEM PLL & NUMERATOR + DENOMINATOR
#define CCM_ANALOG_PLL_SYS               CCM_ANALOG_BASE._0x0030
#define CCM_ANALOG_PLL_SYS_SET           CCM_ANALOG_BASE._0x0034
#define CCM_ANALOG_PLL_SYS_CLR           CCM_ANALOG_BASE._0x0038
#define CCM_ANALOG_PLL_SYS_TOG           CCM_ANALOG_BASE._0x003c
#define CCM_ANALOG_528M_PLL_SYS_SSR      CCM_ANALOG_BASE._0x0040
#define CCM_NUMERATOR_528M_PLL_SYS_NUM   CCM_ANALOG_BASE._0x0050
#define CCM_DENOMINATOR_528M_PLL_SYS_NUM CCM_ANALOG_BASE._0x0060

// ANALOG AUDIO PLL & NUMERATOR + DENOMINATOR
#define CCM_ANALOG_AUDIO_PLL       CCM_ANALOG_BASE._0x0070
#define CCM_ANALOG_AUDIO_PLL_SET   CCM_ANALOG_BASE._0x0074
#define CCM_ANALOG_AUDIO_PLL_CLR   CCM_ANALOG_BASE._0x0078
#define CCM_ANALOG_AUDIO_PLL_TOG   CCM_ANALOG_BASE._0x007c
#define CCM_ANALOG_AUDIO_PLL_NUM   CCM_ANALOG_BASE._0x0080
#define CCM_ANALOG_AUDIO_PLL_DENOM CCM_ANALOG_BASE._0x0090

// ANALOG VIDEO PLL & NUMERATOR + DENOMINATOR
#define CCM_ANALOG_VIDEO_PLL       CCM_ANALOG_BASE._0x00a0
#define CCM_ANALOG_VIDEO_PLL_SET   CCM_ANALOG_BASE._0x00a4
#define CCM_ANALOG_VIDEO_PLL_CLR   CCM_ANALOG_BASE._0x00a8
#define CCM_ANALOG_VIDEO_PLL_TOG   CCM_ANALOG_BASE._0x00ac
#define CCM_ANALOG_VIDEO_PLL_NUM   CCM_ANALOG_BASE._0x00b0
#define CCM_ANALOG_VIDEO_PLL_DENOM CCM_ANALOG_BASE._0x00c0

// ANALOG ETHERNET PLL  [0x00e0, 0x00ec]
#define CCM_ANALOG_PLL_ENET     CCM_ANALOG_BASE._0x00e0
#define CCM_ANALOG_PLL_ENET_SET CCM_ANALOG_BASE._0x00e4
#define CCM_ANALOG_PLL_ENET_CLR CCM_ANALOG_BASE._0x00e8
#define CCM_ANALOG_PLL_ENET_TOG CCM_ANALOG_BASE._0x00ec

// Phase Fractional Divider 480MHz (PLL3) [0x00f0, 0x00fc]
#define CCM_ANALOG_PFD480     CCM_ANALOG_BASE._0x00f0
#define CCM_ANALOG_PFD480_SET CCM_ANALOG_BASE._0x00f4
#define CCM_ANALOG_PFD480_CLR CCM_ANALOG_BASE._0x00f8
#define CCM_ANALOG_PFD480_TOG CCM_ANALOG_BASE._0x00fc

// Phase Fractional Divider 528MHz (PLL2) [0x0100, 0x010c]
#define CCM_ANALOG_PFD528     CCM_ANALOG_BASE._0x0100
#define CCM_ANALOG_PFD528_SET CCM_ANALOG_BASE._0x0104
#define CCM_ANALOG_PFD528_CLR CCM_ANALOG_BASE._0x0108
#define CCM_ANALOG_PFD528_TOG CCM_ANALOG_BASE._0x010c

// MISC.  [0x0150, 0x017c]
#define CCM_ANALOG_MISC0     CCM_ANALOG_BASE._0x0150
#define CCM_ANALOG_MISC0_SET CCM_ANALOG_BASE._0x0154
#define CCM_ANALOG_MISC0_CLR CCM_ANALOG_BASE._0x0158
#define CCM_ANALOG_MISC0_TOG CCM_ANALOG_BASE._0x015c
#define CCM_ANALOG_MISC1     CCM_ANALOG_BASE._0x0160
#define CCM_ANALOG_MISC1_SET CCM_ANALOG_BASE._0x0164
#define CCM_ANALOG_MISC1_CLR CCM_ANALOG_BASE._0x0168
#define CCM_ANALOG_MISC1_TOG CCM_ANALOG_BASE._0x016c
#define CCM_ANALOG_MISC2     CCM_ANALOG_BASE._0x0170
#define CCM_ANALOG_MISC2_SET CCM_ANALOG_BASE._0x0174
#define CCM_ANALOG_MISC2_CLR CCM_ANALOG_BASE._0x0178
#define CCM_ANALOG_MISC2_TOG CCM_ANALOG_BASE._0x017c

/**
 * @brief: XTALOSC 24MHz, CRYSTAL OSCILLATOR, Memory Map/Register, 15.6, p.1142
 * The register reset values for CCM change depending on the boot configuration.
 * See Clocks at boot time for more information
 *
 **/
#define XOSC_BASE         MAP_32BIT_REGISTER(0x400d8150)
#define XOSC_24M_MISC     XOSC_BASE._0x0000
#define XOSC_24M_MISC_SET XOSC_BASE._0x0004
#define XOSC_24M_MISC_CLR XOSC_BASE._0x0008
#define XOSC_24M_MISC_TOG XOSC_BASE._0x000c

#define XOSC_24M_LOWPWR_CTRL     XOSC_BASE._0x0120
#define XOSC_24M_LOWPWR_CTRL_SET XOSC_BASE._0x0124
#define XOSC_24M_LOWPWR_CTRL_CLR XOSC_BASE._0x0128
#define XOSC_24M_LOWPWR_CTRL_TOG XOSC_BASE._0x012c

#define XOSC_24M_OSC_CONF0     XOSC_BASE._0x0150
#define XOSC_24M_OSC_CONF0_SET XOSC_BASE._0x0154
#define XOSC_24M_OSC_CONF0_CLR XOSC_BASE._0x0158
#define XOSC_24M_OSC_CONF0_TOG XOSC_BASE._0x015c

#define XOSC_24M_OSC_CONF1     XOSC_BASE._0x0160
#define XOSC_24M_OSC_CONF1_SET XOSC_BASE._0x0164
#define XOSC_24M_OSC_CONF1_CLR XOSC_BASE._0x0168
#define XOSC_24M_OSC_CONF1_TOG XOSC_BASE._0x016c

#define XOSC_24M_OSC_CONF2     XOSC_BASE._0x0170
#define XOSC_24M_OSC_CONF2_SET XOSC_BASE._0x0174
#define XOSC_24M_OSC_CONF2_CLR XOSC_BASE._0x0178
#define XOSC_24M_OSC_CONF2_TOG XOSC_BASE._0x017c

/**
 * @brief: PMU Memory Map/Register, 16.6, p.1142
 * The register definitions that affect the behavior
 * of the digital LDO regulators follow.
 *
 * NOTE: Some of the registers are collections of bits that affect
 * multiple components on the chip. Those that are not pertinent
 * to this chapter have comments in the related register bitfields.
 * If a full description is desired, please consult the full
 * register programming reference in the related block
 *
 **/
#define PMU_BASE        MAP_32BIT_REGISTER(0x400d8110)
#define PMU_REG_1P1     PMU_BASE._0x0000
#define PMU_REG_1P1_SET PMU_BASE._0x0004
#define PMU_REG_1P1_CLR PMU_BASE._0x0008
#define PMU_REG_1P1_TOG PMU_BASE._0x000c

#define PMU_REG_3P0     PMU_BASE._0x0010
#define PMU_REG_3P0_SET PMU_BASE._0x0014
#define PMU_REG_3P0_CLR PMU_BASE._0x0018
#define PMU_REG_3P0_TOG PMU_BASE._0x001c

#define PMU_REG_2P5     PMU_BASE._0x0020
#define PMU_REG_2P5_SET PMU_BASE._0x0024
#define PMU_REG_2P5_CLR PMU_BASE._0x0028
#define PMU_REG_2P5_TOG PMU_BASE._0x002c

#define PMU_REG_CORE     PMU_BASE._0x0030
#define PMU_REG_CORE_SET PMU_BASE._0x0034
#define PMU_REG_CORE_CLR PMU_BASE._0x0038
#define PMU_REG_CORE_TOG PMU_BASE._0x003c

#define PMU_MISC0     PMU_BASE._0x0040
#define PMU_MISC0_SET PMU_BASE._0x0044
#define PMU_MISC0_CLR PMU_BASE._0x0048
#define PMU_MISC0_TOG PMU_BASE._0x004c

#define PMU_MISC1     PMU_BASE._0x0050
#define PMU_MISC1_SET PMU_BASE._0x0054
#define PMU_MISC1_CLR PMU_BASE._0x0058
#define PMU_MISC1_TOG PMU_BASE._0x005c

#define PMU_MISC2     PMU_BASE._0x0060
#define PMU_MISC2_SET PMU_BASE._0x0064
#define PMU_MISC2_CLR PMU_BASE._0x0068
#define PMU_MISC2_TOG PMU_BASE._0x006c

/**
 * @brief: (General Power Controller) GPC Memory Map/Register, 17.6, p.1190
 * NOTE: Writes to GPC registers only takes effect in supervisor mode.
 *
 **/
#define GPC_BASE    MAP_32BIT_REGISTER(0x400f4000)
#define GPC_ICTRL   GPC_BASE._0x0000
#define GPC_IRQ_MR1 GPC_BASE._0x0008
#define GPC_IRQ_MR2 GPC_BASE._0x000c
#define GPC_IRQ_MR3 GPC_BASE._0x0010
#define GPC_IRQ_MR4 GPC_BASE._0x0014
#define GPC_IRQ_SR1 GPC_BASE._0x0018
#define GPC_IRQ_SR2 GPC_BASE._0x001c
#define GPC_IRQ_SR3 GPC_BASE._0x0020
#define GPC_IRQ_SR4 GPC_BASE._0x0024
#define GPC_IRQ_MR5 GPC_BASE._0x0034
#define GPC_IRQ_SR5 GPC_BASE._0x0038

/**
 * @brief: PGC Memory Map/Register, 17.7, p.1196
 * NOTE: Writes to GPC registers only takes effect in supervisor mode.
 *
 **/
#define PGC_BASE        MAP_32BIT_REGISTER(0x400f4220)
#define PGC_MEGA_CTRL   PGC_BASE._0x0000
#define PGC_MEGA_PUPSCR PGC_BASE._0x0004
#define PGC_MEGA_PDNSCR PGC_BASE._0x0008
#define PGC_MEGA_SR     PGC_BASE._0x000c
#define PGC_CPU_CTRL    PGC_BASE._0x00a0
#define PGC_CPU_PUPSCR  PGC_BASE._0x00a4
#define PGC_PDCSCR      PGC_BASE._0x00a8
#define PGC_CPU_SR      PGC_BASE._0x00ac

/**
 * @brief: DCDC Memory Map/Register, 18.7, p.1209
 * NOTE: Writes to GPC registers only takes effect in supervisor mode.
 *
 **/
#define DCDC_BASE MAP_32BIT_REGISTER(0x40080000)
#define DCDC_REG0 DCDC_BASE._0x0000
#define DCDC_REG1 DCDC_BASE._0x0004
#define DCDC_REG2 DCDC_BASE._0x0008
#define DCDC_REG3 DCDC_BASE._0x000c

/**
 * @brief: TEMPMON Memory Map/Register, 19.4, p.1224
 *
 **/
#define TEMPMON_BASE           MAP_32BIT_REGISTER(0x400d8180)
#define TEMPMON_TEMPSENSE0     TEMPMON_BASE._0x0000
#define TEMPMON_TEMPSENSE0_SET TEMPMON_BASE._0x0004
#define TEMPMON_TEMPSENSE0_CLR TEMPMON_BASE._0x0008
#define TEMPMON_TEMPSENSE0_TOG TEMPMON_BASE._0x000c
#define TEMPMON_TEMPSENSE1     TEMPMON_BASE._0x0010
#define TEMPMON_TEMPSENSE1_SET TEMPMON_BASE._0x0014
#define TEMPMON_TEMPSENSE1_CLR TEMPMON_BASE._0x0018
#define TEMPMON_TEMPSENSE1_TOG TEMPMON_BASE._0x001c
#define TEMPMON_TEMPSENSE2     TEMPMON_BASE._0x0020
#define TEMPMON_TEMPSENSE2_SET TEMPMON_BASE._0x0024
#define TEMPMON_TEMPSENSE2_CLR TEMPMON_BASE._0x0028
#define TEMPMON_TEMPSENSE2_TOG TEMPMON_BASE._0x002c

/**
 * @brief: SVNS Memory Map/Register, 20.6.1, p.1224
 *
 **/
#define SVNS_BASE     MAP_32BIT_REGISTER(0x400d4000)
#define SVNS_HP_LR    SVNS_BASE._0x0000 // Lock Register
#define SVNS_HP_COMR  SVNS_BASE._0x0004 // Command Register
#define SVNS_HP_CR    SVNS_BASE._0x0008 // Control Register
#define SVNS_HP_ST    SVNS_BASE._0x0014 // Status Register
#define SVNS_HP_RTCMR SVNS_BASE._0x0024 // Realtime Counter MSB Register
#define SVNS_HP_RTCLR SVNS_BASE._0x0028 // Realtime Counter LSB Register
#define SVNS_HP_TAMR  SVNS_BASE._0x002c // Time Alarm MSB Register
#define SVNS_HP_TALR  SVNS_BASE._0x0030 // Time Alarm LSB Register

