AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
#define SVNS_LP_LR          SVNS_BASE._0x0034 // Lock Register
#define SVNS_LP_CR          SVNS_BASE._0x0038 // Control Register
#define SVNS_LP_SR          SVNS_BASE._0x004c // Status Register
#define SVNS_LP_SMCMR       SVNS_BASE._0x005c // Secure Monotonic Counter MSB Register
#define SVNS_LP_SMCLR       SVNS_BASE._0x0060 // Secure Monotonic Counter LSB Register
#define SVNS_LP_GPR0_LEGACY SVNS_BASE._0x0068 // GeneralPurposeRegister0 Legacy

#define SVNS_LP_GPR0_ALIAS SVNS_BASE._0x0090 // General Purpose Register0 alias
#define SVNS_LP_GPR1_ALIAS SVNS_BASE._0x0094 // General Purpose Register1 alias
#define SVNS_LP_GPR2_ALIAS SVNS_BASE._0x0098 // General Purpose Register2 alias
#define SVNS_LP_GPR3_ALIAS SVNS_BASE._0x009c // General Purpose Register3 alias

#define SVNS_LP_GPR0 SVNS_BASE._0x0100 // General Purpose Register0
#define SVNS_LP_GPR1 SVNS_BASE._0x0104 // General Purpose Register1
#define SVNS_LP_GPR2 SVNS_BASE._0x0108 // General Purpose Register2
#define SVNS_LP_GPR4 SVNS_BASE._0x010c // General Purpose Register3

#define SVNS_HP_VIDR1 SVNS_BASE._0x0bf8 // Version ID Register
#define SVNS_HP_VIDR2 SVNS_BASE._0x0bfc // Version ID Register

/**
 * @brief: SRC Memory Map/Register, 21.8, p.1224
 *
 **/
#define SRC_BASE  MAP_32BIT_REGISTER(0x400f8000)
#define SRC_CR    SRC_BASE._0x0000 // Control Register
#define SRC_BMR1  SRC_BASE._0x0004 // Boot Mode Register 1
#define SRC_RSR   SRC_BASE._0x0008 // Reset Status Register
#define SRC_BMR2  SRC_BASE._0x001c // Boot Mode Register 2
#define SRC_GPR01 SRC_BASE._0x0020 // General Purpose Register 1
#define SRC_GPR02 SRC_BASE._0x0024 // General Purpose Register 2
#define SRC_GPR03 SRC_BASE._0x0028 // General Purpose Register 3
#define SRC_GPR04 SRC_BASE._0x002c // General Purpose Register 4
#define SRC_GPR05 SRC_BASE._0x0030 // General Purpose Register 5
#define SRC_GPR06 SRC_BASE._0x0034 // General Purpose Register 6
#define SRC_GPR07 SRC_BASE._0x0038 // General Purpose Register 7
#define SRC_GPR08 SRC_BASE._0x003c // General Purpose Register 8
#define SRC_GPR09 SRC_BASE._0x0040 // General Purpose Register 9
#define SRC_GPR10 SRC_BASE._0x0044 // General Purpose Register 10

/**
 * @brief: OTP Memory Map/Register, 23.6, p.1331
 *
 **/
#define OTP_BASE00     MAP_32BIT_REGISTER(0x401f4000)
#define OTP_CRSR       SRC_BASE00._0x0000 // OTP Controller Control & Status
#define OTP_CRSR_SET   SRC_BASE00._0x0004 // OTP Contr. Control & Status,SET
#define OTP_CRSR_CLR   SRC_BASE00._0x0008 // OTP Contr. Control & Status,CLR
#define OTP_CRSR_TOG   SRC_BASE00._0x000c // OTP Contr. Control & Status,TOG
#define OTP_TIMING     SRC_BASE00._0x0010 // OTP Controller Timing Register
#define OTP_WDATA      SRC_BASE00._0x0020 // OTP Controller Write Data Register
#define OTP_W_READCTRL SRC_BASE00._0x0030 // OTP Controller W/ Data Register
#define OTP_R_DR       SRC_BASE00._0x0040 // OTP Controller R/ Data Register
#define OTP_SCS        SRC_BASE00._0x0060 // Software Controllable Signal
#define OTP_SCS_SET    SRC_BASE00._0x0064 // Software Controllable Signal Set
#define OTP_SCS_CLR    SRC_BASE00._0x0068 // SoftwareControllableSignal Clear
#define OTP_SCS_TOG    SRC_BASE00._0x006c // SoftwareControllableSignal Toggle
#define OTP_VERSION    SRC_BASE00._0x0090 // OTP Controller Version Register
#define OTP_TIMING2    SRC_BASE00._0x0100 // OTP Controller Timing Register 2

#define OTP_BASE01 MAP_32BIT_REGISTER(0x401f4400)
#define OTP_GPR05  SRC_BASE01._0x0000 // Value of OTP Bank0 Word0 (LOCK)
#define OTP_GPR06  SRC_BASE01._0x0010 // Value of OTP Bank0 Word1 (CFG0)
#define OTP_GPR07  SRC_BASE01._0x0020 // Value of OTP Bank0 Word2 (CFG1)
#define OTP_GPR08  SRC_BASE01._0x0030 // Value of OTP Bank0 Word3 (CFG2)
#define OTP_GPR09  SRC_BASE01._0x0040 // Value of OTP Bank0 Word4 (CFG3)
#define OTP_GPR10  SRC_BASE01._0x0050 // Value of OTP Bank0 Word5 (CFG4)
#define OTP_GPR01  SRC_BASE01._0x0060 // Value of OTP Bank0 Word6 (CFG5)
#define OTP_GPR02  SRC_BASE01._0x0070 // Value of OTP Bank0 Word7 (CFG6)
#define OTP_GPR03  SRC_BASE01._0x00f0 // Value of OTP Bank1 Word7 (Analog info)

#define OTP_BASE02    MAP_32BIT_REGISTER(0x401f4600)
#define OTP_SJC_RESP0 SRC_BASE02._0x0000 // Value of OTP Bank4 Word0
#define OTP_SJC_RESP1 SRC_BASE02._0x0010 // Value of OTP Bank4 Word1
#define OTP_MAC0      SRC_BASE02._0x0020 // Value of OTP Bank4 Word2
#define OTP_MAC1      SRC_BASE02._0x0030 // Value of OTP Bank4 Word3
#define OTP_MAC2      SRC_BASE02._0x0040 // Value of OTP Bank4 Word4
#define OTP_GP1       SRC_BASE02._0x0060 // Value of OTP Bank4 Word6
#define OTP_GP2       SRC_BASE02._0x0070 // Value of OTP Bank4 Word7
#define OTP_B5W0_SW   SRC_BASE02._0x0080 // Value of OTP Bank5 Word0
#define OTP_B5W5_MISC SRC_BASE02._0x00d0 // Value of OTP Bank5 Word5
#define OTP_B5W6_MISC SRC_BASE02._0x00e0 // Value of OTP Bank5 Word6
#define OTP_B7W0      SRC_BASE02._0x0280 // Value of OTP Bank7 Word0
#define OTP_B7W1      SRC_BASE02._0x0290 // Value of OTP Bank7 Word1
#define OTP_B7W2      SRC_BASE02._0x02a0 // Value of OTP Bank7 Word2
#define OTP_B7W3      SRC_BASE02._0x02b0 // Value of OTP Bank7 Word3

/**
 * @brief: SEMC Memory Map/Register, 25.4.1.1, p.1385
 *
 **/
#define SEMC_BASE00   MAP_32BIT_REGISTER(0x402f0000)
#define SEMC_MCR      SEMC_BASE00._0x0000 // Module Control Register
#define SEMC_IOCR     SEMC_BASE00._0x0004 // IO MUX Control Register
#define SEMC_BMCR0    SEMC_BASE00._0x0008 // Bus Master Control Register 0
#define SEMC_BMCR1    SEMC_BASE00._0x000c // Bus Master Control Register 1
#define SEMC_BR0      SEMC_BASE00._0x0010 // Base Register for SDRAMCS0
#define SEMC_BR1      SEMC_BASE00._0x0014 // Base Register for SDRAMCS1
#define SEMC_BR2      SEMC_BASE00._0x0018 // Base Register for SDRAMCS2
#define SEMC_BR3      SEMC_BASE00._0x001c // Base Register for SDRAMCS3
#define SEMC_BR4      SEMC_BASE00._0x0020 // Base Register for NAND Device
#define SEMC_BR5      SEMC_BASE00._0x0024 // Base Register for NOR Device
#define SEMC_BR6      SEMC_BASE00._0x0028 // Base Register for PSRAM
#define SEMC_BR7      SEMC_BASE00._0x002c // Base Register for DBI-B
#define SEMC_BR8      SEMC_BASE00._0x0030 // Base Register for NAND Device
#define SEMC_DLLCR    SEMC_BASE00._0x0034 // DLL Control Register (DLLCR)
#define SEMC_INTEN    SEMC_BASE00._0x0038 // Interrupt Enable Register (INTEN)
#define SEMC_INTR     SEMC_BASE00._0x003c // Interrupt Enable Register (INTR)
#define SEMC_SDRAMCR0 SEMC_BASE00._0x0040 // SDRAM control register 0
#define SEMC_SDRAMCR1 SEMC_BASE00._0x0044 // SDRAM control register 1
#define SEMC_SDRAMCR2 SEMC_BASE00._0x0048 // SDRAM control register 2
#define SEMC_SDRAMCR3 SEMC_BASE00._0x004c // SDRAM control register 3
#define SEMC_NANDCR0  SEMC_BASE00._0x0050 // NAND control register 0
#define SEMC_NANDCR1  SEMC_BASE00._0x0054 // NAND control register 1
#define SEMC_NANDCR2  SEMC_BASE00._0x0058 // NAND control register 2
#define SEMC_NANDCR3  SEMC_BASE00._0x005c // NAND control register 3
#define SEMC_NORCR0   SEMC_BASE00._0x0060 // NOR control register 0
#define SEMC_NORCR1   SEMC_BASE00._0x0064 // NOR control register 1
#define SEMC_NORCR2   SEMC_BASE00._0x0068 // NOR control register 2
#define SEMC_NORCR3   SEMC_BASE00._0x006c // NOR control register 3
#define SEMC_SRAMCR0  SEMC_BASE00._0x0070 // SRAM control register 0
#define SEMC_SRAMCR1  SEMC_BASE00._0x0074 // SRAM control register 1
#define SEMC_SRAMCR2  SEMC_BASE00._0x0078 // SRAM control register 2
#define SEMC_SRAMCR3  SEMC_BASE00._0x007c // SRAM control register 3
#define SEMC_DBICR0   SEMC_BASE00._0x0080 // DBI-B control register 0
#define SEMC_DBICR1   SEMC_BASE00._0x0084 // DBI-B control register 1
#define SEMC_IPCR0    SEMC_BASE00._0x0090 // IP Command control register 0 (IPCR0)
#define SEMC_IPCR1    SEMC_BASE00._0x0094 // IP Command control register 1 (IPCR1)
#define SEMC_IPCR2    SEMC_BASE00._0x0098 // IP Command control register 2 (IPCR2)
#define SEMC_IPCMD    SEMC_BASE00._0x009c // IP Command register _ _ (IPCMD)
#define SEMC_IPTXDAT  SEMC_BASE00._0x00a0 // TX DATA register (IPCOMD)
#define SEMC_IPRXDAT  SEMC_BASE00._0x00b0 // RX DATA register (IPCOMD)
#define SEMC_STS00    SEMC_BASE00._0x00c0 // Status register 0 (STS00)
#define SEMC_STS01    SEMC_BASE00._0x00c4 // Status register 0 (STS01)
#define SEMC_STS02    SEMC_BASE00._0x00c8 // Status register 0 (STS02)
#define SEMC_STS03    SEMC_BASE00._0x00cc // Status register 0 (STS03)
#define SEMC_STS04    SEMC_BASE00._0x00d0 // Status register 0 (STS04)
#define SEMC_STS05    SEMC_BASE00._0x00d4 // Status register 0 (STS05)
#define SEMC_STS06    SEMC_BASE00._0x00d8 // Status register 0 (STS06)
#define SEMC_STS07    SEMC_BASE00._0x00dc // Status register 0 (STS07)
#define SEMC_STS08    SEMC_BASE00._0x00e0 // Status register 0 (STS08)
#define SEMC_STS09    SEMC_BASE00._0x00e4 // Status register 0 (STS09)
#define SEMC_STS10    SEMC_BASE00._0x00e8 // Status register 0 (STS10)
#define SEMC_STS11    SEMC_BASE00._0x00ec // Status register 0 (STS11)
#define SEMC_STS12    SEMC_BASE00._0x00f0 // Status register 0 (STS12)
#define SEMC_STS13    SEMC_BASE00._0x00f4 // Status register 0 (STS13)
#define SEMC_STS14    SEMC_BASE00._0x00f8 // Status register 0 (STS14)
#define SEMC_STS15    SEMC_BASE00._0x00fc // Status register 0 (STS15)

/**
 * @brief: uSDHC Memory Map/Register, 26.9.1, p.1553
 * This section includes the module memory map
 * and detailed descriptions of all registers.
 * See the table on p.1553 for the register memory map for the uSDHC.
 * All these registers only support 32-bit accesses.
 * Base address:
 * 402C_0000h uSDHC1,
 * 402C_4000h for uSDHC2
 **/
#define uSDHC1_BASE MAP_32BIT_REGISTER(0x402c0000) // uSDHC1
#define uSDHC2_BASE MAP_32BIT_REGISTER(0x402c4000) // uSDHC2

#define uSDHC1_DS_ADDR            uSDHC1_BASE._0x0000 // DMA Systems Address
#define uSDHC2_DS_ADDR            uSDHC2_BASE._0x0000 //
#define uSDHC1_BLK_ATTR           uSDHC1_BASE._0x0004 // Block Attributes
#define uSDHC2_BLK_ATTR           uSDHC2_BASE._0x0004 //
#define uSDHC1_CMD_ARG            uSDHC1_BASE._0x0008 // Command Argument
#define uSDHC2_CMD_ARG            uSDHC2_BASE._0x0008 //
#define uSDHC1_CMD_TX_TYPE        uSDHC1_BASE._0x000c // Command Transfer Type
#define uSDHC2_CMD_TX_TYPE        uSDHC2_BASE._0x000c //
#define uSDHC1_CMD_RSP0           uSDHC1_BASE._0x0010 // Command Response 0
#define uSDHC2_CMD_RSP0           uSDHC2_BASE._0x0010 //
#define uSDHC1_CMD_RSP1           uSDHC1_BASE._0x0014 // Command Response 1
#define uSDHC2_CMD_RSP1           uSDHC2_BASE._0x0014 //
#define uSDHC1_CMD_RSP2           uSDHC1_BASE._0x0018 // Command Response 2
#define uSDHC2_CMD_RSP2           uSDHC2_BASE._0x0018 //
#define uSDHC1_CMD_RSP3           uSDHC1_BASE._0x001c // Command Response 3
#define uSDHC2_CMD_RSP3           uSDHC2_BASE._0x001c //
#define uSDHC1_DATABUF_ACCSS_PORT uSDHC1_BASE._0x0020 // Data Buf. Access Port
#define uSDHC2_DATABUF_ACCSS_PORT uSDHC2_BASE._0x0020 //
#define uSDHC1_PRES_STATE         uSDHC1_BASE._0x0024 // Present State
#define uSDHC2_PRES_STATE         uSDHC2_BASE._0x0024 //
#define uSDHC1_PRTCL_CTRL         uSDHC1_BASE._0x0028 // Protocol Control
#define uSDHC2_PRTCL_CTRL         uSDHC2_BASE._0x0028 //
#define uSDHC1_SYS_CTRL           uSDHC1_BASE._0x002c // System Control
#define uSDHC2_SYS_CTRL           uSDHC2_BASE._0x002c //
#define uSDHC1_INT_STATUS         uSDHC1_BASE._0x0030 // Interrupt Status
#define uSDHC2_INT_STATUS         uSDHC2_BASE._0x0030 //
#define uSDHC1_INT_STATUS_EN      uSDHC1_BASE._0x0034 // Interrupt Status Enable
#define uSDHC2_INT_STATUS_EN      uSDHC2_BASE._0x0034 //
#define uSDHC1_INT_SIGNAL_EN      uSDHC1_BASE._0x0038 // Interrupt Signal Enable
#define uSDHC2_INT_SIGNAL_EN      uSDHC2_BASE._0x0038 //
#define uSDHC1_AUTOCMD12_ERRSTAT  uSDHC1_BASE._0x003c // Auto CMD12 ERRSTAT
#define uSDHC2_AUTOCMD12_ERRSTAT  uSDHC2_BASE._0x003c //
#define uSDHC1_HOST_CTRL_CAP      uSDHC1_BASE._0x0040 // Host Ctrller Capabilities
#define uSDHC2_HOST_CTRL_CAP      uSDHC2_BASE._0x0040 //
#define uSDHC1_WATMK_LVL          uSDHC1_BASE._0x0044 // Watermark Level
#define uSDHC2_WATMK_LVL          uSDHC2_BASE._0x0044 //
#define uSDHC1_MIX_CTRL           uSDHC1_BASE._0x0048 // Mixer Control
#define uSDHC2_MIX_CTRL           uSDHC2_BASE._0x0048 //
#define uSDHC1_FORCE_EVENT        uSDHC1_BASE._0x0050 // Force Event
#define uSDHC2_FORCE_EVENT        uSDHC2_BASE._0x0050 //
#define uSDHC1_ADMA_ERRSTAT       uSDHC1_BASE._0x0054 // ADMA Err Stat Register
#define uSDHC2_ADMA_ERRSTAT       uSDHC2_BASE._0x0054 //
#define uSDHC1_ADMA_SYS_ADDR      uSDHC1_BASE._0x0058 // ADMA Systems Address
#define uSDHC2_ADMA_SYS_ADDR      uSDHC2_BASE._0x0058 //
#define uSDHC1_DLL_CTRL           uSDHC1_BASE._0x0060 // Delay Line Control
#define uSDHC2_DLL_CTRL           uSDHC2_BASE._0x0060 //
#define uSDHC1_DLL_STAT           uSDHC1_BASE._0x0064 // Delay Line Status, READONLY
#define uSDHC2_DLL_STAT           uSDHC2_BASE._0x0064 //
#define uSDHC1_TUNE_CTRL_STAT     uSDHC1_BASE._0x0068 // CLK Tuning ctrl & stat
#define uSDHC2_TUNE_CTRL_STAT     uSDHC2_BASE._0x0068 //
#define uSDHC1_VEND_SPEC          uSDHC1_BASE._0x00c0 //  Vendor Specific 2 Register
#define uSDHC2_VEND_SPEC          uSDHC2_BASE._0x00c0 //
#define uSDHC1_MMC_BOOT           uSDHC1_BASE._0x00c4 // MMC Boot Register
#define uSDHC2_MMC_BOOT           uSDHC2_BASE._0x00c4 //
#define uSDHC1_VEND_SPEC2         uSDHC1_BASE._0x00c8 // Vendor Specific 2 Register
#define uSDHC2_VEND_SPEC2         uSDHC2_BASE._0x00c8 //
#define uSDHC1_TUNING_CTRL        uSDHC1_BASE._0x00cc // DMA Systems Address
#define uSDHC2_TUNING_CTRL        uSDHC2_BASE._0x00cc //

// Such a long list for FLEXSPI, put it into a seperate header
#include "flexspi_addr.h"

/**
 * @brief: ARM-Cortex M7 NIC-301 Memory Map/Register, 29.4, p.1744
 * The bus system is composed of five instances:
 * SIM_M7, SIM_PER, SIM_M,SIM_MAIN and SIM_EMS.
 * Three of them have GPV registers which are
 * helpful for busarbitration and performance.
 *
 * NOTE: This chip supports up to 16 interrupt priority levels,
 * i.e. it implements bits [7:4] of each NVIC Interrupt Priority Register
 **/

/**
 * @brief: 1.SIM_MAIN registers
 * The SIM_MAIN GPV base address is GPV0_BASE = 0x41000000. The
 * following registers are implemented in this NIC.
 * REGISTERGROUP_REGISTERNAME_MODULENAME_PORTNAME
 **/
#define GPV0_BASE                MAP_32BIT_REGISTER(0x41000000)
#define SIM_MAIN_RESRVD_S        GPV0_BASE._0x0000
#define SIM_MAIN_RESRVD_E        (GPV0_BASE._0x0000 + 0x0fcc)
#define SIM_MAIN_4KB_JEP106_PID4 (GPV0_BASE._0x0000 + 0x0fd0)
#define SIM_MAIN_RESRVD_PID5     (GPV0_BASE._0x0000 + 0x0fd4)
#define SIM_MAIN_RESRVD_PID6     (GPV0_BASE._0x0000 + 0x0fd8)
#define SIM_MAIN_RESRVD_PID7     (GPV0_BASE._0x0000 + 0x0fdc)
#define SIM_MAIN_PARTNUM7_0_PID0 (GPV0_BASE._0x0000 + 0x0fe0)
#define SIM_MAIN_JEP106_PID1     (GPV0_BASE._0x0000 + 0x0fe4)
#define SIM_MAIN_JEP106_REV_PID2 (GPV0_BASE._0x0000 + 0x0fe8)
#define SIM_MAIN_AMBAGUI_PID3    (GPV0_BASE._0x0000 + 0x0fec)
#define SIM_MAIN_PREAMBLE_PID0   (GPV0_BASE._0x0000 + 0x0ff0)
#define SIM_MAIN_GIP_PID1        (GPV0_BASE._0x0000 + 0x0ff4)
#define SIM_MAIN_PREAMBLE_PID2   (GPV0_BASE._0x0000 + 0x0ff8)
#define SIM_MAIN_PREAMBLE_PID3   (GPV0_BASE._0x0000 + 0x0fffc)

#define SIM_MAIN_READQOS_LCD_MA2 (GPV0_BASE._0x0100 + 0x44000)
#define SIM_MAIN_READQOS_CSI_MA3 (GPV0_BASE._0x0100 + 0x45000)
#define SIM_MAIN_READQOS_PXP_MA4 (GPV0_BASE._0x0100 + 0x46000)

#define SIM_MAIN_WRITEQOS_LCD_MA2 (GPV0_BASE._0x0104 + 0x44000)
#define SIM_MAIN_WRITEQOS_CSI_MA3 (GPV0_BASE._0x0104 + 0x45000)
#define SIM_MAIN_WRITEQOS_PXP_MA4 (GPV0_BASE._0x0104 + 0x46000)

#define SIM_MAIN_FNMOD_LCD_MA2 (GPV0_BASE._0x0108 + 0x44000)
#define SIM_MAIN_FNMOD_CSI_MA3 (GPV0_BASE._0x0108 + 0x45000)
#define SIM_MAIN_FNMOD_PXP_MA4 (GPV0_BASE._0x0108 + 0x46000)

/**
 * @brief: 2.SIM_M registers
 * The SIM_M GPV base address is GPV1_BASE = 0x41100000. The
 * following registers are implemented in this NIC.
 **/
#define GPV1_BASE MAP_32BIT_REGISTER(0x41100000)

