AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
#define SIM_M_RESRVD_S        GPV1_BASE._0x0000
#define SIM_M_RESRVD_E        (GPV1_BASE._0x0000 + 0x0fcc)
#define SIM_M_4KB_JEP106_PID4 (GPV1_BASE._0x0000 + 0x0fd0)
#define SIM_M_RESRVD_PID5     (GPV1_BASE._0x0000 + 0x0fd4)
#define SIM_M_RESRVD_PID6     (GPV1_BASE._0x0000 + 0x0fd8)
#define SIM_M_RESRVD_PID7     (GPV1_BASE._0x0000 + 0x0fdc)
#define SIM_M_PARTNUM7_0_PID0 (GPV1_BASE._0x0000 + 0x0fe0)
#define SIM_M_JEP106_PID1     (GPV1_BASE._0x0000 + 0x0fe4)
#define SIM_M_JEP106_REV_PID2 (GPV1_BASE._0x0000 + 0x0fe8)
#define SIM_M_AMBAGUI_PID3    (GPV1_BASE._0x0000 + 0x0fec)
#define SIM_M_PREAMBLE_PID0   (GPV1_BASE._0x0000 + 0x0ff0)
#define SIM_M_GIP_PID1        (GPV1_BASE._0x0000 + 0x0ff4)
#define SIM_M_PREAMBLE_PID2   (GPV1_BASE._0x0000 + 0x0ff8)
#define SIM_M_PREAMBLE_PID3   (GPV1_BASE._0x0000 + 0x0ffc)

#define SIM_M_FNMOD2_DCP_MC0     (GPV1_BASE._0x0024 + 0x42000)
#define SIM_M_FNMODAHB_ENET_MC1  (GPV1_BASE._0x0028 + 0x43000)
#define SIM_M_FNMODAHB_TEST_MC5  (GPV1_BASE._0x0028 + 0x47000)
#define SIM_M_FNMODAHB_ENET2_MC6 (GPV1_BASE._0x0100 + 0x48000)

#define SIM_M_READQOS_DCP_MC0    (GPV1_BASE._0x0100 + 0x42000)
#define SIM_M_READQOS_ENET_MC1   (GPV1_BASE._0x0100 + 0x43000)
#define SIM_M_READQOS_USBO2_MC2  (GPV1_BASE._0x0100 + 0x44000)
#define SIM_M_READQOS_USDHC1_MC3 (GPV1_BASE._0x0100 + 0x45000)
#define SIM_M_READQOS_USDHC2_MC4 (GPV1_BASE._0x0100 + 0x46000)
#define SIM_M_READQOS_TEST_MC5   (GPV1_BASE._0x0100 + 0x47000)
#define SIM_M_READQOS_ENET2_MC6  (GPV1_BASE._0x0100 + 0x48000)
//
#define SIM_M_WRITEQOS_DCP_MC0    (GPV1_BASE._0x0104 + 0x42000)
#define SIM_M_WRITEQOS_ENET_MC0   (GPV1_BASE._0x0104 + 0x43000)
#define SIM_M_WRITEQOS_USBO2_MC0  (GPV1_BASE._0x0104 + 0x44000)
#define SIM_M_WRITEQOS_USDHC1_MC0 (GPV1_BASE._0x0104 + 0x45000)
#define SIM_M_WRITEQOS_USDHC2_MC0 (GPV1_BASE._0x0104 + 0x46000)
#define SIM_M_WRITEQOS_TEST_MC0   (GPV1_BASE._0x0104 + 0x47000)
#define SIM_M_WRITEQOS_ENET2_MC0  (GPV1_BASE._0x0104 + 0x48000)
//
#define SIM_M_FNMOD_DCP_MC0    (GPV1_BASE._0x0108 + 0x42000)
#define SIM_M_FNMOD_ENET_MC0   (GPV1_BASE._0x0108 + 0x43000)
#define SIM_M_FNMOD_USBO2_MC0  (GPV1_BASE._0x0108 + 0x44000)
#define SIM_M_FNMOD_USDHC1_MC0 (GPV1_BASE._0x0108 + 0x45000)
#define SIM_M_FNMOD_USDHC2_MC0 (GPV1_BASE._0x0108 + 0x46000)
#define SIM_M_FNMOD_TEST_MC0   (GPV1_BASE._0x0108 + 0x47000)
#define SIM_M_FNMOD_ENET2_MC0  (GPV1_BASE._0x0108 + 0x48000)

/**
 * @brief: 3.SIM_M7 registers
 * The SIM_M7 GPV base address is GPV4_BASE = 0x41400000. The
 * following registers are implemented in this NIC.
 **/
#define GPV4_BASE MAP_32BIT_REGISTER(0x41400000)

#define SIM_M7_RESRVD_S        GPV4_BASE._0x0000
#define SIM_M7_RESRVD_E        (GPV4_BASE._0x0000 + 0x0fcc)
#define SIM_M7_4KB_JEP106_PID4 (GPV4_BASE._0x0000 + 0x0fd0)
#define SIM_M7_RESRVD_PID5     (GPV4_BASE._0x0000 + 0x0fd4)
#define SIM_M7_RESRVD_PID6     (GPV4_BASE._0x0000 + 0x0fd8)
#define SIM_M7_RESRVD_PID7     (GPV4_BASE._0x0000 + 0x0fdc)
#define SIM_M7_PARTNUM7_0_PID0 (GPV4_BASE._0x0000 + 0x0fe0)
#define SIM_M7_JEP106_PID1     (GPV4_BASE._0x0000 + 0x0fe4)
#define SIM_M7_JEP106_REV_PID2 (GPV4_BASE._0x0000 + 0x0fe8)
#define SIM_M7_AMBAGUI_PID3    (GPV4_BASE._0x0000 + 0x0fec)
#define SIM_M7_PREAMBLE_PID0   (GPV4_BASE._0x0000 + 0x0ff0)
#define SIM_M7_GIP_PID1        (GPV4_BASE._0x0000 + 0x0ff4)
#define SIM_M7_PREAMBLE_PID2   (GPV4_BASE._0x0000 + 0x0ff8)
#define SIM_M7_PREAMBLE_PID3   (GPV4_BASE._0x0000 + 0x0ffc)

#define SIM_M7_FNMODAHB_DMA_MB1   (GPV4_BASE._0x0028 + 0x43000)
#define SIM_M7_WRTIDEMARK_CM7_MB0 (GPV4_BASE._0x0040 + 0x42000)
#define SIM_M7_READQOS_CM7_MB0    (GPV4_BASE._0x0100 + 0x42000)
#define SIM_M7_READQOS_DMA_MB1    (GPV4_BASE._0x0100 + 0x43000)
#define SIM_M7_WRITEQOS_CM7_MB0   (GPV4_BASE._0x0104 + 0x42000)
#define SIM_M7_WRITEQOS_DMA_MB1   (GPV4_BASE._0x0104 + 0x43000)
#define SIM_M7_FNMOD_CM7_MB0      (GPV4_BASE._0x0108 + 0x42000)
#define SIM_M7_FNMOD_DMA_MB1      (GPV4_BASE._0x0108 + 0x43000)

/**
 * @brief: FlexRAM, Flexible Memory Array Map/Register
 * 31.4, p.1766
 * FlexRAM base address: 0x400b0000
 **/
#define FLEXRAM_BASE        MAP_32BIT_REGISTER(0x400b0000)
#define FLEXRAM_TCM_CTRL    FLEXRAM_BASE._0x0000
#define FLEXRAM_INT_STATUS  FLEXRAM_BASE._0x0010
#define FLEXRAM_INT_STAT_EN FLEXRAM_BASE._0x0014
#define FLEXRAM_INT_SIG_EN  FLEXRAM_BASE._0x0018

/**
 * @brief: AIPSTZ, AHB to IP Bridge Memory Map/Register
 * 32.8, p.1778
 *
 *  Each AIPSTZx_MPR specifies 16 4-bit fields defining the access privilege
 *  level associated with a bus master in the platform, as well as specifying
 *  whether write accesses from this master are bufferable shown in Table 32-5
 *
 * AIPSTZ base address: 0x4007c000
 **/
#define AIPSTZ_BASE00 MAP_32BIT_REGISTER(0x4007c000)
// Master Priviledge Register (AIPSTZ1_MPR)
#define AIPSTZ1_MPR    AIPSTZ_BASE00._0x0000
#define AIPSTZ1_OPACR  AIPSTZ_BASE00._0x0040
#define AIPSTZ1_OPACR1 AIPSTZ_BASE00._0x0044
#define AIPSTZ1_OPACR2 AIPSTZ_BASE00._0x0048
#define AIPSTZ1_OPACR3 AIPSTZ_BASE00._0x004c
#define AIPSTZ1_OPACR4 AIPSTZ_BASE00._0x0050

#define AIPSTZ_BASE01 MAP_32BIT_REGISTER(0x4017c000)
// Master Priviledge Register (AIPSTZ2_MPR)
#define AIPSTZ2_MPR    AIPSTZ_BASE01._0x0000
#define AIPSTZ2_OPACR  AIPSTZ_BASE01._0x0040
#define AIPSTZ2_OPACR1 AIPSTZ_BASE01._0x0044
#define AIPSTZ2_OPACR2 AIPSTZ_BASE01._0x0048
#define AIPSTZ2_OPACR3 AIPSTZ_BASE01._0x004c
#define AIPSTZ2_OPACR4 AIPSTZ_BASE01._0x0050

#define AIPSTZ_BASE02 MAP_32BIT_REGISTER(0x4027c000)
// Master Priviledge Register (AIPSTZ3_MPR)
#define AIPSTZ3_MPR    AIPSTZ_BASE02._0x0000
#define AIPSTZ3_OPACR  AIPSTZ_BASE02._0x0040
#define AIPSTZ3_OPACR1 AIPSTZ_BASE02._0x0044
#define AIPSTZ3_OPACR2 AIPSTZ_BASE02._0x0048
#define AIPSTZ3_OPACR3 AIPSTZ_BASE02._0x004c
#define AIPSTZ3_OPACR4 AIPSTZ_BASE02._0x0050

#define AIPSTZ_BASE03 MAP_32BIT_REGISTER(0x4037c000)
// Master Priviledge Register (AIPSTZ4_MPR)
#define AIPSTZ4_MPR    AIPSTZ_BASE03._0x0000
#define AIPSTZ4_OPACR  AIPSTZ_BASE03._0x0040
#define AIPSTZ4_OPACR1 AIPSTZ_BASE03._0x0044
#define AIPSTZ4_OPACR2 AIPSTZ_BASE03._0x0048
#define AIPSTZ4_OPACR3 AIPSTZ_BASE03._0x004c
#define AIPSTZ4_OPACR4 AIPSTZ_BASE03._0x0050

/**
 * @brief: CSI, CMOS Sensor Interface Memory Map/Register
 * 34.8, p.1818
 * CSI base address: 0x402bc000
 **/
#define CSI_BASE             MAP_32BIT_REGISTER(0x402bc000)
#define CSI_CR1              CSI_BASE._0x0000
#define CSI_CR2              CSI_BASE._0x0004
#define CSI_CR3              CSI_BASE._0x0008
#define CSI_STATFIFO         CSI_BASE._0x000c
#define CSI_RXFIFO           CSI_BASE._0x0010
#define CSI_RXCOUNT          CSI_BASE._0x0014
#define CSI_SR               CSI_BASE._0x0018
#define CSI_DMA_SAR_STATFIFO CSI_BASE._0x0020
#define CSI_DMA_TSR_STATFIFO CSI_BASE._0x0024
#define CSI_DMA_TSR_FB1      CSI_BASE._0x0028
#define CSI_DMA_TSR_FB2      CSI_BASE._0x002c
#define CSI_BUF_PARAMR       CSI_BASE._0x0030
#define CSI_IMG_PARAMR       CSI_BASE._0x0034
#define CSI_CR18             CSI_BASE._0x0048
#define CSI_CR19             CSI_BASE._0x004c

/**
 * @brief: LCDIF, Enhanced LCD Interface Memory Map/Register
 * 35.7, p.1861
 *
 * LCDIF base address: 0x402b8000
 **/
#define LCDIF_BASE00    MAP_32BIT_REGISTER(0x402b8000)
#define LCDIF_CTRL0     LCDIF_BASE00._0x0000
#define LCDIF_CTRL0_SET LCDIF_BASE00._0x0004
#define LCDIF_CTRL0_CLR LCDIF_BASE00._0x0008
#define LCDIF_CTRL0_TOG LCDIF_BASE00._0x000c

#define LCDIF_CTRL1     LCDIF_BASE00._0x0010
#define LCDIF_CTRL1_SET LCDIF_BASE00._0x0014
#define LCDIF_CTRL1_CLR LCDIF_BASE00._0x0018
#define LCDIF_CTRL1_TOG LCDIF_BASE00._0x001c

#define LCDIF_CTRL2     LCDIF_BASE00._0x0020
#define LCDIF_CTRL2_SET LCDIF_BASE00._0x0024
#define LCDIF_CTRL2_CLR LCDIF_BASE00._0x0028
#define LCDIF_CTRL2_TOG LCDIF_BASE00._0x002c

// LCDIF Horizontal and Certical Valid Data Count Register
#define LCDIF_TX_COUNT LCDIF_BASE00._0x0030

