AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
// LCD Interface Current Buffer Address Register
#define LCDIF_CUR_BUF LCDIF_BASE00._0x0040

// LCD Interface Next Buffer Address Register
#define LCDIF_NEXT_BUF LCDIF_BASE00._0x0060

// LCDIF VSYNC Mode and Dotclk Mode Control Register 0
#define LCDIF_VDCTRL0     LCDIF_BASE00._0x0070
#define LCDIF_VDCTRL0_SET LCDIF_BASE00._0x0074
#define LCDIF_VDCTRL0_CLR LCDIF_BASE00._0x0078
#define LCDIF_VDCTRL0_TOG LCDIF_BASE00._0x007c

// LCDIF VSYNC Mode and Dotclk Mode Control Register [1,4]
#define LCDIF_VDCTRL1 LCDIF_BASE00._0x0080
#define LCDIF_VDCTRL2 LCDIF_BASE00._0x0090
#define LCDIF_VDCTRL3 LCDIF_BASE00._0x00a0
#define LCDIF_VDCTRL4 LCDIF_BASE00._0x00b0

// Bus Master Error Status Register
#define LCDIF_BM_ERRSTAT LCDIF_BASE00._0x0190

// CRC and LCD Interface Status Registers
#define LCDIF_CRC_SR LCDIF_BASE00._0x01a0
#define LCDIF_SR     LCDIF_BASE00._0x01b0

// LCDIF Pigeon Mode Control Registers
#define LCDIF_PIGEONCTRL0     LCDIF_BASE00._0x0380
#define LCDIF_PIGEONCTRL0_SET LCDIF_BASE00._0x0384
#define LCDIF_PIGEONCTRL0_CLR LCDIF_BASE00._0x0388
#define LCDIF_PIGEONCTRL0_TOG LCDIF_BASE00._0x038c

#define LCDIF_PIGEONCTRL1     LCDIF_BASE00._0x0390
#define LCDIF_PIGEONCTRL1_SET LCDIF_BASE00._0x0394
#define LCDIF_PIGEONCTRL1_CLR LCDIF_BASE00._0x0398
#define LCDIF_PIGEONCTRL1_TOG LCDIF_BASE00._0x039c

#define LCDIF_PIGEONCTRL2     LCDIF_BASE00._0x03a0
#define LCDIF_PIGEONCTRL2_SET LCDIF_BASE00._0x03a4
#define LCDIF_PIGEONCTRL2_CLR LCDIF_BASE00._0x03a8
#define LCDIF_PIGEONCTRL2_TOG LCDIF_BASE00._0x03ac

#define LCDIF_BASE01     MAP_32BIT_REGISTER(0x402b8800)
#define LCDIF_PIGEON_0_0 LCDIF_BASE01._0x0000
#define LCDIF_PIGEON_0_1 LCDIF_BASE01._0x0010
#define LCDIF_PIGEON_0_2 LCDIF_BASE01._0x0020

#define LCDIF_PIGEON_1_0 LCDIF_BASE01._0x0040
#define LCDIF_PIGEON_1_1 LCDIF_BASE01._0x0050
#define LCDIF_PIGEON_1_2 LCDIF_BASE01._0x0060

#define LCDIF_PIGEON_2_0 LCDIF_BASE01._0x0080
#define LCDIF_PIGEON_2_1 LCDIF_BASE01._0x0090
#define LCDIF_PIGEON_2_2 LCDIF_BASE01._0x00a0

#define LCDIF_PIGEON_3_0 LCDIF_BASE01._0x00c0
#define LCDIF_PIGEON_3_1 LCDIF_BASE01._0x00d0
#define LCDIF_PIGEON_3_2 LCDIF_BASE01._0x00e0

#define LCDIF_PIGEON_4_0 LCDIF_BASE01._0x0100
#define LCDIF_PIGEON_4_1 LCDIF_BASE01._0x0110
#define LCDIF_PIGEON_4_2 LCDIF_BASE01._0x0120

#define LCDIF_PIGEON_5_0     LCDIF_BASE01._0x0140
#define LCDIF_PIGEON_5_1     LCDIF_BASE01._0x0150
#define LCDIF_PIGEON_5_2_SET LCDIF_BASE01._0x0160

#define LCDIF_PIGEON_6_0     LCDIF_BASE01._0x0180
#define LCDIF_PIGEON_6_1_TOG LCDIF_BASE01._0x0190
#define LCDIF_PIGEON_6_2     LCDIF_BASE01._0x01a0

#define LCDIF_PIGEON_7_0     LCDIF_BASE01._0x01c0
#define LCDIF_PIGEON_7_1_CLR LCDIF_BASE01._0x01d0
#define LCDIF_PIGEON_7_2_TOG LCDIF_BASE01._0x01e0

#define LCDIF_PIGEON_8_0     LCDIF_BASE01._0x0200
#define LCDIF_PIGEON_8_1_SET LCDIF_BASE01._0x0210
#define LCDIF_PIGEON_8_2_CLR LCDIF_BASE01._0x0220

#define LCDIF_PIGEON_9_0     LCDIF_BASE01._0x0240
#define LCDIF_PIGEON_9_1     LCDIF_BASE01._0x0250
#define LCDIF_PIGEON_9_2_SET LCDIF_BASE01._0x0260

#define LCDIF_PIGEON_10_0     LCDIF_BASE01._0x0280
#define LCDIF_PIGEON_10_1_TOG LCDIF_BASE01._0x0290
#define LCDIF_PIGEON_10_2     LCDIF_BASE01._0x02a0

#define LCDIF_PIGEON_11_0     LCDIF_BASE01._0x02c0
#define LCDIF_PIGEON_11_1_CLR LCDIF_BASE01._0x02d0
#define LCDIF_PIGEON_11_2_TOG LCDIF_BASE01._0x02e0

#define LCDIF_LUT_CTRL  LCDIF_BASE01._0x0300
#define LCDIF_LUT0_ADDR LCDIF_BASE01._0x0310
#define LCDIF_LUT0_DATA LCDIF_BASE01._0x0320
#define LCDIF_LUT1_ADDR LCDIF_BASE01._0x0340
#define LCDIF_LUT1_DATA LCDIF_BASE01._0x0350

/**
 * @brief: PXP, PiXel Pipeline Memory Map/Register
 * 36.8, p.1923
 * PXP base address: 0x402b4000
 **/
#define PXP_BASE00    MAP_32BIT_REGISTER(0x402b4000)
#define PXP_CTRL0     PXP_BASE00._0x0000
#define PXP_CTRL0_SET PXP_BASE00._0x0004
#define PXP_CTRL0_CLR PXP_BASE00._0x0008
#define PXP_CTRL0_TOG PXP_BASE00._0x000c

#define PXP_STAT     PXP_BASE00._0x0010
#define PXP_STAT_SET PXP_BASE00._0x0014
#define PXP_STAT_CLR PXP_BASE00._0x0018
#define PXP_STAT_TOG PXP_BASE00._0x001c

#define PXP_OUTBUF_CR     PXP_BASE00._0x0020
#define PXP_OUTBUF_CR_SET PXP_BASE00._0x0024
#define PXP_OUTBUF_CR_CLR PXP_BASE00._0x0028
#define PXP_OUTBUF_CR_TOG PXP_BASE00._0x002c

#define PXP_OUT_FRAMBUF   PXP_BASE00._0x0030
#define PXP_OUT_FRAMBUF2  PXP_BASE00._0x0040
#define PXP_OUT_BUF_PITCH PXP_BASE00._0x0050
#define PXP_OUT_LRC       PXP_BASE00._0x0060

#define PXP_OUT_PS_ULC PXP_BASE00._0x0070
#define PXP_OUT_PS_LRC PXP_BASE00._0x0080
#define PXP_OUT_AS_ULC PXP_BASE00._0x0090
#define PXP_OUT_AS_LRC PXP_BASE00._0x00a0

#define PXP_PS_CTRL     PXP_BASE00._0x00b0
#define PXP_PS_CTRL_SET PXP_BASE00._0x00b4
#define PXP_PS_CTRL_CLR PXP_BASE00._0x00b8
#define PXP_PS_CTRL_TOG PXP_BASE00._0x00bc

#define PXP_IN_PS_BUF PXP_BASE00._0x00c0
#define PXP_PS_UBUF   PXP_BASE00._0x00d0
#define PXP_IN_VBUF   PXP_BASE00._0x00e0
#define PXP_PS_PITCH  PXP_BASE00._0x00f0

#define PXP_PS_BG        PXP_BASE00._0x0100
#define PXP_PS_SCALE     PXP_BASE00._0x0110
#define PXP_PS_OFFSET    PXP_BASE00._0x0120
#define PXP_PS_CLRKEYLOW PXP_BASE00._0x0130

#define PXP_PS_CLRKEYHIGH PXP_BASE00._0x0140
#define PXP_AS_CTRL       PXP_BASE00._0x0150
#define PXP_AS_BUF        PXP_BASE00._0x0160
#define PXP_AS_PITCH      PXP_BASE00._0x0170

#define PXP_AS_CLRKEYLOW  PXP_BASE00._0x0180
#define PXP_AS_CLRKEYHIGH PXP_BASE00._0x0190

#define PXP_CSC1_COEF0 PXP_BASE00._0x01a0
#define PXP_CSC1_COEF1 PXP_BASE00._0x01b0
#define PXP_CSC1_COEF2 PXP_BASE00._0x01c0

#define PXP_POWER            PXP_BASE00._0x0320
#define PXP_NEXT             (PXP_BASE00._0x0100 + 0x0300)
#define PXP_PORTER_DUFF_CTRL (PXP_BASE00._0x0100 + 0x0340)

/**
 * @brief: SAI, Synchrounous Audio Interface Memory Map/Register
 * 38.5, p.1981
 * SAI1 base address: 0x40384000
 * SAI2 base address: 0x40388000
 * SAI3 base address: 0x4038c000
 **/
#define SAI1_BASE00 MAP_32BIT_REGISTER(0x40384000)
#define SAI2_BASE00 MAP_32BIT_REGISTER(0x40388000)
#define SAI3_BASE00 MAP_32BIT_REGISTER(0x4038c000)

// SAI1
#define SAI1_VERID  SAI1_BASE00._0x0000
#define SAI1_PARAMR SAI1_BASE00._0x0004
// TX ADDRESSES
#define SAI1_TX_CR     SAI1_BASE00._0x0008
#define SAI1_TX_CONFR1 SAI1_BASE00._0x000c
#define SAI1_TX_CONFR2 SAI1_BASE00._0x0010
#define SAI1_TX_CONFR3 SAI1_BASE00._0x0014
#define SAI1_TX_CONFR4 SAI1_BASE00._0x0018
#define SAI1_TX_CONFR5 SAI1_BASE00._0x001c
#define SAI1_TX_DR0    SAI1_BASE00._0x0020
#define SAI1_TX_DR1    SAI1_BASE00._0x0024
#define SAI1_TX_DR2    SAI1_BASE00._0x0028
#define SAI1_TX_DR3    SAI1_BASE00._0x002c
#define SAI1_TX_FR0    SAI1_BASE00._0x0040
#define SAI1_TX_FR1    SAI1_BASE00._0x0044
#define SAI1_TX_FR2    SAI1_BASE00._0x0048
#define SAI1_TX_FR3    SAI1_BASE00._0x004c
#define SAI1_TX_MR     SAI1_BASE00._0x0060
// RX ADDRESSES
#define SAI1_RX_CR     SAI1_BASE00._0x0088
#define SAI1_RX_CONFR1 SAI1_BASE00._0x008c
#define SAI1_RX_CONFR2 SAI1_BASE00._0x0090
#define SAI1_RX_CONFR3 SAI1_BASE00._0x0094
#define SAI1_RX_CONFR4 SAI1_BASE00._0x0098
#define SAI1_RX_CONFR5 SAI1_BASE00._0x009c
#define SAI1_RX_DR0    SAI1_BASE00._0x00a0
#define SAI1_RX_DR1    SAI1_BASE00._0x00a4
#define SAI1_RX_DR2    SAI1_BASE00._0x00a8
#define SAI1_RX_DR3    SAI1_BASE00._0x00ac
#define SAI1_RX_FR0    SAI1_BASE00._0x00c0
#define SAI1_RX_FR1    SAI1_BASE00._0x00c4
#define SAI1_RX_FR2    SAI1_BASE00._0x00c8
#define SAI1_RX_FR3    SAI1_BASE00._0x00cc
#define SAI1_RX_MR     SAI1_BASE00._0x00e0

// SAI2
#define SAI2_BASE00 MAP_32BIT_REGISTER(0x40388000)
#define SAI2_VERID  SAI2_BASE00._0x0000
#define SAI2_PARAMR SAI2_BASE00._0x0004
// TX ADDRESSES
#define SAI2_TX_CR     SAI2_BASE00._0x0008
#define SAI2_TX_CONFR1 SAI2_BASE00._0x000c
#define SAI2_TX_CONFR2 SAI2_BASE00._0x0010
#define SAI2_TX_CONFR3 SAI2_BASE00._0x0014
#define SAI2_TX_CONFR4 SAI2_BASE00._0x0018
#define SAI2_TX_CONFR5 SAI2_BASE00._0x001c
#define SAI2_TX_DR0    SAI2_BASE00._0x0020
#define SAI2_TX_DR1    SAI2_BASE00._0x0024
#define SAI2_TX_DR2    SAI2_BASE00._0x0028
#define SAI2_TX_DR3    SAI2_BASE00._0x002c
#define SAI2_TX_FR0    SAI2_BASE00._0x0040
#define SAI2_TX_FR1    SAI2_BASE00._0x0044
#define SAI2_TX_FR2    SAI2_BASE00._0x0048
#define SAI2_TX_FR3    SAI2_BASE00._0x004c
#define SAI2_TX_MR     SAI2_BASE00._0x0060
// RX ADDRESSES
#define SAI2_RX_CR     SAI2_BASE00._0x0088
#define SAI2_RX_CONFR1 SAI2_BASE00._0x008c
#define SAI2_RX_CONFR2 SAI2_BASE00._0x0090
#define SAI2_RX_CONFR3 SAI2_BASE00._0x0094
#define SAI2_RX_CONFR4 SAI2_BASE00._0x0098
#define SAI2_RX_CONFR5 SAI2_BASE00._0x009c
#define SAI2_RX_DR0    SAI2_BASE00._0x00a0
#define SAI2_RX_DR1    SAI2_BASE00._0x00a4
#define SAI2_RX_DR2    SAI2_BASE00._0x00a8
#define SAI2_RX_DR3    SAI2_BASE00._0x00ac
#define SAI2_RX_FR0    SAI2_BASE00._0x00c0
#define SAI2_RX_FR1    SAI2_BASE00._0x00c4
#define SAI2_RX_FR2    SAI2_BASE00._0x00c8
#define SAI2_RX_FR3    SAI2_BASE00._0x00cc
#define SAI2_RX_MR     SAI2_BASE00._0x00e0

// SAI3
#define SAI3_BASE00 MAP_32BIT_REGISTER(0x4038c000)
#define SAI3_VERID  SAI3_BASE00._0x0000
#define SAI3_PARAMR SAI3_BASE00._0x0004
// TX ADDRESSES
#define SAI3_TX_CR     SAI3_BASE00._0x0008
#define SAI3_TX_CONFR1 SAI3_BASE00._0x000c
#define SAI3_TX_CONFR2 SAI3_BASE00._0x0010
#define SAI3_TX_CONFR3 SAI3_BASE00._0x0014
#define SAI3_TX_CONFR4 SAI3_BASE00._0x0018
#define SAI3_TX_CONFR5 SAI3_BASE00._0x001c
#define SAI3_TX_DR0    SAI3_BASE00._0x0020
#define SAI3_TX_DR1    SAI3_BASE00._0x0024
#define SAI3_TX_DR2    SAI3_BASE00._0x0028
#define SAI3_TX_DR3    SAI3_BASE00._0x002c
#define SAI3_TX_FR0    SAI3_BASE00._0x0040
#define SAI3_TX_FR1    SAI3_BASE00._0x0044
#define SAI3_TX_FR2    SAI3_BASE00._0x0048
#define SAI3_TX_FR3    SAI3_BASE00._0x004c
#define SAI3_TX_MR     SAI3_BASE00._0x0060
// RX ADDRESSES
#define SAI3_RX_CR     SAI3_BASE00._0x0088
#define SAI3_RX_CONFR1 SAI3_BASE00._0x008c
#define SAI3_RX_CONFR2 SAI3_BASE00._0x0090
#define SAI3_RX_CONFR3 SAI3_BASE00._0x0094
#define SAI3_RX_CONFR4 SAI3_BASE00._0x0098
#define SAI3_RX_CONFR5 SAI3_BASE00._0x009c
#define SAI3_RX_DR0    SAI3_BASE00._0x00a0
#define SAI3_RX_DR1    SAI3_BASE00._0x00a4
#define SAI3_RX_DR2    SAI3_BASE00._0x00a8
#define SAI3_RX_DR3    SAI3_BASE00._0x00ac
#define SAI3_RX_FR0    SAI3_BASE00._0x00c0
#define SAI3_RX_FR1    SAI3_BASE00._0x00c4
#define SAI3_RX_FR2    SAI3_BASE00._0x00c8
#define SAI3_RX_FR3    SAI3_BASE00._0x00cc
#define SAI3_RX_MR     SAI3_BASE00._0x00e0

/**
 * @brief: SPDIF, Sony/Philips Digital Interface Memory Map/Register
 * 40.6, p.2036
 * SPDIF base address: 0x40380000
 **/
#define SPDIF_BASE   MAP_32BIT_REGISTER(0x4038c000)
#define SPDIF_SCR    SPDIF_BASE._0x0000
#define SPDIF_SRCD   SPDIF_BASE._0x0004
#define SPDIF_SRPC   SPDIF_BASE._0x0008
#define SPDIF_SIE    SPDIF_BASE._0x000c
#define SPDIF_SIS    SPDIF_BASE._0x0010
#define SPDIF_SIC    SPDIF_BASE._0x0010 // both at 0x10
#define SPDIF_SRL    SPDIF_BASE._0x0014
#define SPDIF_SRR    SPDIF_BASE._0x0018
#define SPDIF_SRCSH  SPDIF_BASE._0x001c
#define SPDIF_SRCSL  SPDIF_BASE._0x0020
#define SPDIF_SRU    SPDIF_BASE._0x0024
#define SPDIF_SRQ    SPDIF_BASE._0x0028
#define SPDIF_STL    SPDIF_BASE._0x002c
#define SPDIF_STR    SPDIF_BASE._0x0030
#define SPDIF_SRCSCH SPDIF_BASE._0x0034
#define SPDIF_STCSCL SPDIF_BASE._0x0038
#define SPDIF_SRFM   SPDIF_BASE._0x0044
#define SPDIF_STC    SPDIF_BASE._0x0050

/**
 * @brief: ENET, Ethernet MAC
 * 41.6, p.2068
 *
 * ENET registers must be read or written with 32-bit accesses.
 * Non-32 bit accesses willterminate with an error.
 * Reserved bits should be written with 0 and ignored on read.
 * Unused registers read zeroand a write has no effect
 *
 * Register Map Summary
 * 0x0000 – 0x01FF    Configuration
 *                    Core control and status registers
 *
 * 0x0200 – 0x03FF    Statistics counters
 *                    MIB and Remote Network Monitoring (RFC 2819) registers
 *
 * 0x0400 – 0x0430    1588 control
 *                    1588 adjustable timer (TSM) and 1588 frame control
 *
 * 0x0600 – 0x07FC    Capture/Comp block
 *                    Registers for the Capture/Compare block
 **/
#define ENET_BASE00   MAP_32BIT_REGISTER(0x402d4000)
#define ENET2_EIR     ENET_BASE00._0x0004
#define ENET2_EIMR    ENET_BASE00._0x0008
#define ENET2_RX_DAR  ENET_BASE00._0x0010
#define ENET2_TX_DAR  ENET_BASE00._0x0014
#define ENET2_ECR     ENET_BASE00._0x0024
#define ENET2_MMFR    ENET_BASE00._0x0040
#define ENET2_MSCR    ENET_BASE00._0x0044
#define ENET2_MIBC    ENET_BASE00._0x0064
#define ENET2_RX_CR   ENET_BASE00._0x0084
#define ENET2_TC_CR   ENET_BASE00._0x00c4
#define ENET2_PALR    ENET_BASE00._0x00e4
#define ENET2_PAUR    ENET_BASE00._0x00e8
#define ENET2_OPD     ENET_BASE00._0x00ec
#define ENET2_TX_IC   ENET_BASE00._0x00f0
#define ENET2_RX_IC   ENET_BASE00._0x0100
#define ENET2_IAUR    ENET_BASE00._0x0118
#define ENET2_IALR    ENET_BASE00._0x011c
#define ENET2_GAUR    ENET_BASE00._0x0120
#define ENET2_GALR    ENET_BASE00._0x0124
#define ENET2_TFWR    ENET_BASE00._0x0144
#define ENET2_RX_DSR  ENET_BASE00._0x0180
#define ENET2_TX_DSR  ENET_BASE00._0x0184
#define ENET2_MRBR    ENET_BASE00._0x0188
#define ENET2_RX_FSL  ENET_BASE00._0x0190
#define ENET2_RX_FSEM ENET_BASE00._0x0194
#define ENET2_RX_FAEM ENET_BASE00._0x0198
#define ENET2_RX_AFL  ENET_BASE00._0x019c
#define ENET2_TX_SEM  ENET_BASE00._0x01a0
#define ENET2_TX_AEM  ENET_BASE00._0x01a4
#define ENET2_TX_AFL  ENET_BASE00._0x01a8
#define ENET2_TX_IPG  ENET_BASE00._0x01ac
#define ENET2_FTRL    ENET_BASE00._0x01b0
#define ENET2_TX_ACC  ENET_BASE00._0x01c0
#define ENET2_RX_ACC  ENET_BASE00._0x01c4

// TX RMON
#define ENET2_RMON_TXDROP        ENET_BASE00._0x0200
#define ENET2_RMON_T_PACKETS     ENET_BASE00._0x0204
#define ENET2_RMON_T_BC_PKT      ENET_BASE00._0x0208
#define ENET2_RMON_T_MC_PKT      ENET_BASE00._0x020c
#define ENET2_RMON_T_CRC_ALIGN   ENET_BASE00._0x0210
#define ENET2_RMON_T_UNDERSIZE   ENET_BASE00._0x0214
#define ENET2_RMON_T_OVERSIZE    ENET_BASE00._0x0218
#define ENET2_RMON_T_FRAG        ENET_BASE00._0x021c
#define ENET2_RMON_T_JAB         ENET_BASE00._0x0220
#define ENET2_RMON_T_COL         ENET_BASE00._0x0224
#define ENET2_RMON_T_P64         ENET_BASE00._0x0228
#define ENET2_RMON_T_P65TO127    ENET_BASE00._0x022c
#define ENET2_RMON_T_P128TO255   ENET_BASE00._0x0230
#define ENET2_RMON_T_P256TO511   ENET_BASE00._0x0234
#define ENET2_RMON_T_P512TO1023  ENET_BASE00._0x0238
#define ENET2_RMON_T_P1024TO2047 ENET_BASE00._0x023c
#define ENET2_RMON_T_P_GTE2048   ENET_BASE00._0x0240
#define ENET2_RMON_T_OCTETS      ENET_BASE00._0x0244

// TX IEEE
#define ENET2_IEEE_T_DROP      ENET_BASE00._0x0248
#define ENET2_IEEE_T_FRAME_OK  ENET_BASE00._0x024c
#define ENET2_IEEE_T_1COL      ENET_BASE00._0x0250
#define ENET2_IEEE_T_MCOL      ENET_BASE00._0x0254
#define ENET2_IEEE_T_DEF       ENET_BASE00._0x0258
#define ENET2_IEEE_T_LCOL      ENET_BASE00._0x025c
#define ENET2_IEEE_T_EXCOL     ENET_BASE00._0x0260
#define ENET2_IEEE_T_MACERR    ENET_BASE00._0x0264
#define ENET2_IEEE_T_CSERR     ENET_BASE00._0x0268
#define ENET2_IEEE_T_SQE       ENET_BASE00._0x026c
#define ENET2_IEEE_T_FDXFC     ENET_BASE00._0x0270
#define ENET2_IEEE_T_OCTETS_OK ENET_BASE00._0x0274

