AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
// RX RMON
#define ENET2_RMON_R_PACKETS     ENET_BASE00._0x0284
#define ENET2_RMON_R_BC_PKT      ENET_BASE00._0x0288
#define ENET2_RMON_R_MC_PKT      ENET_BASE00._0x028c
#define ENET2_RMON_R_CRC_ALIGN   ENET_BASE00._0x0290
#define ENET2_RMON_R_UNDERSIZE   ENET_BASE00._0x0294
#define ENET2_RMON_R_OVERSIZE    ENET_BASE00._0x0298
#define ENET2_RMON_R_FRAG        ENET_BASE00._0x029c
#define ENET2_RMON_R_JAB         ENET_BASE00._0x02a0
#define ENET2_RMON_R_RESVD_0     ENET_BASE00._0x02a4
#define ENET2_RMON_R_P64         ENET_BASE00._0x02a8
#define ENET2_RMON_R_P65TO127    ENET_BASE00._0x02ac
#define ENET2_RMON_R_P128TO255   ENET_BASE00._0x02b0
#define ENET2_RMON_R_P256TO511   ENET_BASE00._0x02b4
#define ENET2_RMON_R_P512TO1023  ENET_BASE00._0x02b8
#define ENET2_RMON_R_P1024TO2047 ENET_BASE00._0x02bc
#define ENET2_RMON_R_P_GTE2048   ENET_BASE00._0x02c0
#define ENET2_RMON_R_OCTETS      ENET_BASE00._0x02c4

// RX IEEE
#define ENET2_IEEE_R_DROP      ENET_BASE00._0x02c8
#define ENET2_IEEE_R_FRAME_OK  ENET_BASE00._0x02cc
#define ENET2_IEEE_R_CRC       ENET_BASE00._0x02d0
#define ENET2_IEEE_R_ALIGN     ENET_BASE00._0x02d4
#define ENET2_IEEE_R_MACERR    ENET_BASE00._0x02d8
#define ENET2_IEEE_R_FDXFC     ENET_BASE00._0x02dc
#define ENET2_IEEE_R_OCTETS_OK ENET_BASE00._0x02e0

#define EB0          ENET_BASE00._0x0000
#define ENET2_ATCR   B_OFFSET(EB0, 0x400)
#define ENET2_ATVR   B_OFFSET(EB0, 0x404)
#define ENET2_ATOFF  B_OFFSET(EB0, 0x408)
#define ENET2_ATPER  B_OFFSET(EB0, 0x40c)
#define ENET2_ATCOR  B_OFFSET(EB0, 0x410)
#define ENET2_ATINC  B_OFFSET(EB0, 0x414)
#define ENET2_ATSTMP B_OFFSET(EB0, 0x418)
#define ENET2_TGSR   B_OFFSET(EB0, 0x604)
#define ENET2_TCSR0  B_OFFSET(EB0, 0x608)
#define ENET2_TCCR0  B_OFFSET(EB0, 0x60c)
#define ENET2_TCSR1  B_OFFSET(EB0, 0x610)
#define ENET2_TCCR1  B_OFFSET(EB0, 0x614)
#define ENET2_TCSR2  B_OFFSET(EB0, 0x618)
#define ENET2_TCCR2  B_OFFSET(EB0, 0x61c)
#define ENET2_TCSR3  B_OFFSET(EB0, 0x620)
#define ENET2_TCCR3  B_OFFSET(EB0, 0x624)

#define ENET_BASE20  MAP_32BIT_REGISTER(0x402d8000)
#define ENET_EIR     ENET_BASE20._0x0004
#define ENET_EIMR    ENET_BASE20._0x0008
#define ENET_RX_DAR  ENET_BASE20._0x0010
#define ENET_TX_DAR  ENET_BASE20._0x0014
#define ENET_ECR     ENET_BASE20._0x0024
#define ENET_MMFR    ENET_BASE20._0x0040
#define ENET_MSCR    ENET_BASE20._0x0044
#define ENET_MIBC    ENET_BASE20._0x0064
#define ENET_RX_CR   ENET_BASE20._0x0084
#define ENET_TC_CR   ENET_BASE20._0x00c4
#define ENET_PALR    ENET_BASE20._0x00e4
#define ENET_PAUR    ENET_BASE20._0x00e8
#define ENET_OPD     ENET_BASE20._0x00ec
#define ENET_TX_IC   ENET_BASE20._0x00f0
#define ENET_RX_IC   ENET_BASE20._0x0100
#define ENET_IAUR    ENET_BASE20._0x0118
#define ENET_IALR    ENET_BASE20._0x011c
#define ENET_GAUR    ENET_BASE20._0x0120
#define ENET_GALR    ENET_BASE20._0x0124
#define ENET_TFWR    ENET_BASE20._0x0144
#define ENET_RX_DSR  ENET_BASE20._0x0180
#define ENET_TX_DSR  ENET_BASE20._0x0184
#define ENET_MRBR    ENET_BASE20._0x0188
#define ENET_RX_FSL  ENET_BASE20._0x0190
#define ENET_RX_FSEM ENET_BASE20._0x0194
#define ENET_RX_FAEM ENET_BASE20._0x0198
#define ENET_RX_AFL  ENET_BASE20._0x019c
#define ENET_TX_SEM  ENET_BASE20._0x01a0
#define ENET_TX_AEM  ENET_BASE20._0x01a4
#define ENET_TX_AFL  ENET_BASE20._0x01a8
#define ENET_TX_IPG  ENET_BASE20._0x01ac
#define ENET_FTRL    ENET_BASE20._0x01b0
#define ENET_TX_ACC  ENET_BASE20._0x01c0
#define ENET_RX_ACC  ENET_BASE20._0x01c4

// TX RMON
#define ENET_RMON_TXDROP        ENET_BASE20._0x0200
#define ENET_RMON_T_PACKETS     ENET_BASE20._0x0204
#define ENET_RMON_T_BC_PKT      ENET_BASE20._0x0208
#define ENET_RMON_T_MC_PKT      ENET_BASE20._0x020c
#define ENET_RMON_T_CRC_ALIGN   ENET_BASE20._0x0210
#define ENET_RMON_T_UNDERSIZE   ENET_BASE20._0x0214
#define ENET_RMON_T_OVERSIZE    ENET_BASE20._0x0218
#define ENET_RMON_T_FRAG        ENET_BASE20._0x021c
#define ENET_RMON_T_JAB         ENET_BASE20._0x0220
#define ENET_RMON_T_COL         ENET_BASE20._0x0224
#define ENET_RMON_T_P64         ENET_BASE20._0x0228
#define ENET_RMON_T_P65TO127    ENET_BASE20._0x022c
#define ENET_RMON_T_P128TO255   ENET_BASE20._0x0230
#define ENET_RMON_T_P256TO511   ENET_BASE20._0x0234
#define ENET_RMON_T_P512TO1023  ENET_BASE20._0x0238
#define ENET_RMON_T_P1024TO2047 ENET_BASE20._0x023c
#define ENET_RMON_T_P_GTE2048   ENET_BASE20._0x0240
#define ENET_RMON_T_OCTETS      ENET_BASE20._0x0244

// TX IEEE
#define ENET_IEEE_T_DROP      ENET_BASE20._0x0248
#define ENET_IEEE_T_FRAME_OK  ENET_BASE20._0x024c
#define ENET_IEEE_T_1COL      ENET_BASE20._0x0250
#define ENET_IEEE_T_MCOL      ENET_BASE20._0x0254
#define ENET_IEEE_T_DEF       ENET_BASE20._0x0258
#define ENET_IEEE_T_LCOL      ENET_BASE20._0x025c
#define ENET_IEEE_T_EXCOL     ENET_BASE20._0x0260
#define ENET_IEEE_T_MACERR    ENET_BASE20._0x0264
#define ENET_IEEE_T_CSERR     ENET_BASE20._0x0268
#define ENET_IEEE_T_SQE       ENET_BASE20._0x026c
#define ENET_IEEE_T_FDXFC     ENET_BASE20._0x0270
#define ENET_IEEE_T_OCTETS_OK ENET_BASE20._0x0274

// RX RMON
#define ENET_RMON_R_PACKETS     ENET_BASE20._0x0284
#define ENET_RMON_R_BC_PKT      ENET_BASE20._0x0288
#define ENET_RMON_R_MC_PKT      ENET_BASE20._0x028c
#define ENET_RMON_R_CRC_ALIGN   ENET_BASE20._0x0290
#define ENET_RMON_R_UNDERSIZE   ENET_BASE20._0x0294
#define ENET_RMON_R_OVERSIZE    ENET_BASE20._0x0298
#define ENET_RMON_R_FRAG        ENET_BASE20._0x029c
#define ENET_RMON_R_JAB         ENET_BASE20._0x02a0
#define ENET_RMON_R_RESVD_0     ENET_BASE20._0x02a4
#define ENET_RMON_R_P64         ENET_BASE20._0x02a8
#define ENET_RMON_R_P65TO127    ENET_BASE20._0x02ac
#define ENET_RMON_R_P128TO255   ENET_BASE20._0x02b0
#define ENET_RMON_R_P256TO511   ENET_BASE20._0x02b4
#define ENET_RMON_R_P512TO1023  ENET_BASE20._0x02b8
#define ENET_RMON_R_P1024TO2047 ENET_BASE20._0x02bc
#define ENET_RMON_R_P_GTE2048   ENET_BASE20._0x02c0
#define ENET_RMON_R_OCTETS      ENET_BASE20._0x02c4

// RX IEEE
#define ENET_IEEE_R_DROP      ENET_BASE20._0x02c8
#define ENET_IEEE_R_FRAME_OK  ENET_BASE20._0x02cc
#define ENET_IEEE_R_CRC       ENET_BASE20._0x02d0
#define ENET_IEEE_R_ALIGN     ENET_BASE20._0x02d4
#define ENET_IEEE_R_MACERR    ENET_BASE20._0x02d8
#define ENET_IEEE_R_FDXFC     ENET_BASE20._0x02dc
#define ENET_IEEE_R_OCTETS_OK ENET_BASE20._0x02e0

#define EB1         ENET_BASE20._0x0000
#define ENET_ATCR   B_OFFSET(EB1, 0x400)
#define ENET_ATVR   B_OFFSET(EB1, 0x404)
#define ENET_ATOFF  B_OFFSET(EB1, 0x408)
#define ENET_ATPER  B_OFFSET(EB1, 0x40c)
#define ENET_ATCOR  B_OFFSET(EB1, 0x410)
#define ENET_ATINC  B_OFFSET(EB1, 0x414)
#define ENET_ATSTMP B_OFFSET(EB1, 0x418)
#define ENET_TGSR   B_OFFSET(EB1, 0x604)
#define ENET_TCSR0  B_OFFSET(EB1, 0x608)
#define ENET_TCCR0  B_OFFSET(EB1, 0x60c)
#define ENET_TCSR1  B_OFFSET(EB1, 0x610)
#define ENET_TCCR1  B_OFFSET(EB1, 0x614)
#define ENET_TCSR2  B_OFFSET(EB1, 0x618)
#define ENET_TCCR2  B_OFFSET(EB1, 0x61c)
#define ENET_TCSR3  B_OFFSET(EB1, 0x620)
#define ENET_TCCR3  B_OFFSET(EB1, 0x624)

/**
 * @brief: USB, Non-Core and Core Memory Map
 * 42.6 + 42.7, p.2376
 *
 **/
#define USBCORE_BASE              MAP_32BIT_REGISTER(0x402e0000)
#define USBCB0                    USBCORE_BASE._0x0000
#define USBNC_USB_OTG1_CTRL       B_OFFSET(USBCB0, 0x800)
#define USBNC_USB_OTG2_CTRL       B_OFFSET(USBCB0, 0x804)
#define USBNC_USB_OTG1_PHY_CTRL_0 B_OFFSET(USBCB0, 0x818)
#define USBNC_USB_OTG2_PHY_CTRL_0 B_OFFSET(USBCB0, 0x81c)

#define USB_UOG1_ID        USBCORE_BASE._0x0000
#define USB_UOG1_HWGENERAL USBCORE_BASE._0x0004
#define USB_UOG1_HWHOST    USBCORE_BASE._0x0008
#define USB_UOG1_HWDEVICE  USBCORE_BASE._0x000c
#define USB_UOG1_HWTXBUF   USBCORE_BASE._0x0010
#define USB_UOG1_HWRXBUF   USBCORE_BASE._0x0014

#define USB_UOG1_GPTIMER0LD   USBCORE_BASE._0x0080
#define USB_UOG1_GPTIMER0CTRL USBCORE_BASE._0x0084
#define USB_UOG1_GPTIMER1LD   USBCORE_BASE._0x0088
#define USB_UOG1_GPTIMER1CTRL USBCORE_BASE._0x008c
#define USB_UOG1_SBUSCFG      USBCORE_BASE._0x0090
#define USBCORE_BASE_8        MAP_8BIT_REGISTER(0x402e0100)
#define USBCORE_BASE_16       MAP_16BIT_REGISTER(0x402e0100)
#define USB_UOG1_CAPLENGTH    USBCORE_BASE_8._0x0000
#define USB_UOG1_HCIVERSION   USBCORE_BASE_16._0x0002

#define USB_UOG1_HCSPARAMS USBCORE_BASE._0x0104
#define USB_UOG1_HCCPARAMS USBCORE_BASE._0x0108

