AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
#define USB_UOG1_DCIVERSION USBCORE_BASE_16._0x0020

#define USB_UOG1_DCCPARAMS        USBCORE_BASE._0x0124
#define USB_UOG1_USBCMD           USBCORE_BASE._0x0140
#define USB_UOG1_USBSTS           USBCORE_BASE._0x0144
#define USB_UOG1_USBINTR          USBCORE_BASE._0x0148
#define USB_UOG1_FRINDEX          USBCORE_BASE._0x014c
#define USB_UOG1_PERIODICLISTBASE USBCORE_BASE._0x0154 // Host Controller Only
#define USB_UOG1_DEVICEADDR       USBCORE_BASE._0x0154 // Device Controller only
#define USB_UOG1_ASYNCLISTADDR    USBCORE_BASE._0x0158 // Host Controller Only
#define USB_UOG1_ENDPTLISTADDR    USBCORE_BASE._0x0158 // Device Controller Only

#define USB_UOG1_BURSTSIZE      USBCORE_BASE._0x0160
#define USB_UOG1_TXFILLTUNING   USBCORE_BASE._0x0164
#define USB_UOG1_ENDPTNAK       USBCORE_BASE._0x0178
#define USB_UOG1_ENDPTNAKEN     USBCORE_BASE._0x017c
#define USB_UOG1_CONFIGFLAG     USBCORE_BASE._0x0180
#define USB_UOG1_PORTSC1        USBCORE_BASE._0x0184
#define USB_UOG1_OTGSC          USBCORE_BASE._0x01a4
#define USB_UOG1_USBMODE        USBCORE_BASE._0x01a8
#define USB_UOG1_ENDPTSETUPSTAT USBCORE_BASE._0x01ac
#define USB_UOG1_ENDPTPRIME     USBCORE_BASE._0x01b0
#define USB_UOG1_ENDPTFLUSH     USBCORE_BASE._0x01b4
#define USB_UOG1_ENDPTSTAT      USBCORE_BASE._0x01b8
#define USB_UOG1_ENDPTCOMPLETE  USBCORE_BASE._0x01bc
#define USB_UOG1_ENDPTCTRL0     USBCORE_BASE._0x01c0
#define USB_UOG1_ENDPTCTRL1     USBCORE_BASE._0x01c4
#define USB_UOG1_ENDPTCTRL2     USBCORE_BASE._0x01c8
#define USB_UOG1_ENDPTCTRL3     USBCORE_BASE._0x01cc
#define USB_UOG1_ENDPTCTRL4     USBCORE_BASE._0x01d0
#define USB_UOG1_ENDPTCTRL5     USBCORE_BASE._0x01d4
#define USB_UOG1_ENDPTCTRL6     USBCORE_BASE._0x01d8
#define USB_UOG1_ENDPTCTRL7     USBCORE_BASE._0x01dc

// UOB2
#define USB_UOG2_ID           USBCORE_BASE._0x0200
#define USB_UOG2_HWGENERAL    USBCORE_BASE._0x0204
#define USB_UOG2_HWHOST       USBCORE_BASE._0x0208
#define USB_UOG2_HWDEVICE     USBCORE_BASE._0x020c
#define USB_UOG2_HWTXBUF      USBCORE_BASE._0x0210
#define USB_UOG2_HWRXBUF      USBCORE_BASE._0x0214
#define USB_UOG2_GPTIMER0LD   USBCORE_BASE._0x0280
#define USB_UOG2_GPTIMER0CTRL USBCORE_BASE._0x0284
#define USB_UOG2_GPTIMER1LD   USBCORE_BASE._0x0288
#define USB_UOG2_GPTIMER1CTRL USBCORE_BASE._0x028c
#define USB_UOG2_SBUSCFG      USBCORE_BASE._0x0290

#define USBCORE_BASE1_8     MAP_8BIT_REGISTER(0x402e0300)
#define USBCORE_BASE1_16    MAP_16BIT_REGISTER(0x402e0300)
#define USB_UOG2_CAPLENGTH  USBCORE_BASE1_8._0x0000
#define USB_UOG2_HCIVERSION USBCORE_BASE1_16._0x0002
#define USB_UOG2_HCSPARAMS  USBCORE_BASE._0x0304
#define USB_UOG2_HCCPARAMS  USBCORE_BASE._0x0308

#define USB_UOG2_DCIVERSION       USBCORE_BASE1_16._0x0020
#define USB_UOG2_DCCPARAMS        USBCORE_BASE._0x0324
#define USB_UOG2_USBCMD           USBCORE_BASE._0x0340
#define USB_UOG2_USBSTS           USBCORE_BASE._0x0344
#define USB_UOG2_USBINTR          USBCORE_BASE._0x0348
#define USB_UOG2_FRINDEX          USBCORE_BASE._0x034c
#define USB_UOG2_PERIODICLISTBASE USBCORE_BASE._0x0354 // Host Controller only
#define USB_UOG2_DEVICEADDR       USBCORE_BASE._0x0354 // Device Controller only
#define USB_UOG2_ASYNCLISTADDR    USBCORE_BASE._0x0358 // Host Controller only
#define USB_UOG2_ENDPTLISTADDR    USBCORE_BASE._0x0358 // Device Controller only

#define USB_UOG2_BURSTSIZE      USBCORE_BASE._0x0360
#define USB_UOG2_TXFILLTUNING   USBCORE_BASE._0x0364
#define USB_UOG2_ENDPTNAK       USBCORE_BASE._0x0378
#define USB_UOG2_ENDPTNAKEN     USBCORE_BASE._0x037c
#define USB_UOG2_CONFIGFLAG     USBCORE_BASE._0x0380
#define USB_UOG2_PORTSC1        USBCORE_BASE._0x0384
#define USB_UOG2_OTGSC          USBCORE_BASE._0x03a4
#define USB_UOG2_USBMODE        USBCORE_BASE._0x03a8
#define USB_UOG2_ENDPTSETUPSTAT USBCORE_BASE._0x03ac
#define USB_UOG2_ENDPTPRIME     USBCORE_BASE._0x03b0
#define USB_UOG2_ENDPTFLUSH     USBCORE_BASE._0x03b4
#define USB_UOG2_ENDPTSTAT      USBCORE_BASE._0x03b8
#define USB_UOG2_ENDPTCOMPLETE  USBCORE_BASE._0x03bc
#define USB_UOG2_ENDPTCTRL0     USBCORE_BASE._0x03c0
#define USB_UOG2_ENDPTCTRL1     USBCORE_BASE._0x03c4
#define USB_UOG2_ENDPTCTRL2     USBCORE_BASE._0x03c8
#define USB_UOG2_ENDPTCTRL3     USBCORE_BASE._0x03cc
#define USB_UOG2_ENDPTCTRL4     USBCORE_BASE._0x03d0
#define USB_UOG2_ENDPTCTRL5     USBCORE_BASE._0x03d4
#define USB_UOG2_ENDPTCTRL6     USBCORE_BASE._0x03d8
#define USB_UOG2_ENDPTCTRL7     USBCORE_BASE._0x03dc

/**
 * USB-PHY Chapter 43, p.2463
 */
/**
 * @brief: USBPHY Memory Map
 * 43.4, p.2475
 *
 * USBPHY Hardware Register Format Summary
 * Base Address: 0x400d9000
 * // 54 registers
 **/
#define USBPHY_BASE0          MAP_32BIT_REGISTER(0x400d9000)
#define USBPHY1_PWD           USBPHY_BASE0._0x0000
#define USBPHY1_PWD_SET       USBPHY_BASE0._0x0004
#define USBPHY1_PWD_CLR       USBPHY_BASE0._0x0008
#define USBPHY1_PWD_TOG       USBPHY_BASE0._0x000c
#define USBPHY1_TX            USBPHY_BASE0._0x0010
#define USBPHY1_TX_SET        USBPHY_BASE0._0x0014
#define USBPHY1_TX_CLR        USBPHY_BASE0._0x0018
#define USBPHY1_TX_TOG        USBPHY_BASE0._0x001c
#define USBPHY1_RX            USBPHY_BASE0._0x0020
#define USBPHY1_RX_SET        USBPHY_BASE0._0x0024
#define USBPHY1_RX_CLR        USBPHY_BASE0._0x0028
#define USBPHY1_RX_TOG        USBPHY_BASE0._0x002c
#define USBPHY1_CTRL          USBPHY_BASE0._0x0030
#define USBPHY1_CTRL_SET      USBPHY_BASE0._0x0034
#define USBPHY1_CTRL_CLR      USBPHY_BASE0._0x0038
#define USBPHY1_CTRL_TOG      USBPHY_BASE0._0x003c
#define USBPHY1_STATUS        USBPHY_BASE0._0x0040
#define USBPHY1_DEBUG         USBPHY_BASE0._0x0050
#define USBPHY1_DEBUG_SET     USBPHY_BASE0._0x0054
#define USBPHY1_DEBUG_CLR     USBPHY_BASE0._0x0058
#define USBPHY1_DEBUG_TOG     USBPHY_BASE0._0x005c
#define USBPHY1_DEBUG0_STATUS USBPHY_BASE0._0x0060
#define USBPHY1_DEBUG1        USBPHY_BASE0._0x0070
#define USBPHY1_DEBUG1_SET    USBPHY_BASE0._0x0074
#define USBPHY1_DEBUG1_CLR    USBPHY_BASE0._0x0078
#define USBPHY1_DEBUG1_TOG    USBPHY_BASE0._0x007c
#define USBPHY1_VERSION       USBPHY_BASE0._0x0080

#define USBPHY_BASE1          MAP_32BIT_REGISTER(0x400da000)
#define USBPHY2_PWD           USBPHY_BASE1._0x0000
#define USBPHY2_PWD_SET       USBPHY_BASE1._0x0004
#define USBPHY2_PWD_CLR       USBPHY_BASE1._0x0008
#define USBPHY2_PWD_TOG       USBPHY_BASE1._0x000c
#define USBPHY2_TX            USBPHY_BASE1._0x0010
#define USBPHY2_TX_SET        USBPHY_BASE1._0x0014
#define USBPHY2_TX_CLR        USBPHY_BASE1._0x0018
#define USBPHY2_TX_TOG        USBPHY_BASE1._0x001c
#define USBPHY2_RX            USBPHY_BASE1._0x0020
#define USBPHY2_RX_SET        USBPHY_BASE1._0x0024
#define USBPHY2_RX_CLR        USBPHY_BASE1._0x0028
#define USBPHY2_RX_TOG        USBPHY_BASE1._0x002c
#define USBPHY2_CTRL          USBPHY_BASE1._0x0030
#define USBPHY2_CTRL_SET      USBPHY_BASE1._0x0034
#define USBPHY2_CTRL_CLR      USBPHY_BASE1._0x0038
#define USBPHY2_CTRL_TOG      USBPHY_BASE1._0x003c
#define USBPHY2_STATUS        USBPHY_BASE1._0x0040
#define USBPHY2_DEBUG         USBPHY_BASE1._0x0050
#define USBPHY2_DEBUG_SET     USBPHY_BASE1._0x0054
#define USBPHY2_DEBUG_CLR     USBPHY_BASE1._0x0058
#define USBPHY2_DEBUG_TOG     USBPHY_BASE1._0x005c
#define USBPHY2_DEBUG0_STATUS USBPHY_BASE1._0x0060
#define USBPHY2_DEBUG1        USBPHY_BASE1._0x0070
#define USBPHY2_DEBUG1_SET    USBPHY_BASE1._0x0074
#define USBPHY2_DEBUG1_CLR    USBPHY_BASE1._0x0078
#define USBPHY2_DEBUG1_TOG    USBPHY_BASE1._0x007c
#define USBPHY2_VERSION       USBPHY_BASE1._0x0080

/**
 * @brief: USBPHY ANALOG Memory Map
 * 43.5, p.2491
 *
 * USBPHY Hardware Register Format Summary
 * Base Address: 0x400c81a0
 *
 * // 37 registers
 **/
// UBS1
#define USB_PA_BASE0                     MAP_32BIT_REGISTER(0x400c81a0)
#define USB_ANALOG_USB1_VBUS_DETECT      USB_PA_BASE0._0x0000
#define USB_ANALOG_USB1_VBUS_DETECT_SET  USB_PA_BASE0._0x0004
#define USB_ANALOG_USB1_VBUS_DETECT_CLR  USB_PA_BASE0._0x0008
#define USB_ANALOG_USB1_VBUS_DETECT_TOG  USB_PA_BASE0._0x000c
#define USB_ANALOG_USB1_CHRG_DETECT      USB_PA_BASE0._0x0010
#define USB_ANALOG_USB1_CHRG_DETECT_SET  USB_PA_BASE0._0x0014
#define USB_ANALOG_USB1_CHRG_DETECT_CLR  USB_PA_BASE0._0x0018
#define USB_ANALOG_USB1_CHRG_DETECT_TOG  USB_PA_BASE0._0x001c
#define USB_ANALOG_USB1_VBUS_DETECT_STAT USB_PA_BASE0._0x0020
#define USB_ANALOG_USB1_CHRG_DETECT_STAT USB_PA_BASE0._0x0030
#define USB_ANALOG_USB1_LOOPBACK         USB_PA_BASE0._0x0040
#define USB_ANALOG_USB1_LOOPBACK_SET     USB_PA_BASE0._0x0044
#define USB_ANALOG_USB1_LOOPBACK_CLR     USB_PA_BASE0._0x0048
#define USB_ANALOG_USB1_LOOPBACK_TOG     USB_PA_BASE0._0x004c
#define USB_ANALOG_USB1_MISC             USB_PA_BASE0._0x0050
#define USB_ANALOG_USB1_MISC_SET         USB_PA_BASE0._0x0054
#define USB_ANALOG_USB1_MISC_CLR         USB_PA_BASE0._0x0058
#define USB_ANALOG_USB1_MISC_TOG         USB_PA_BASE0._0x005c
// USB2
#define USB_ANALOG_USB2_VBUS_DETECT      USB_PA_BASE0._0x0060
#define USB_ANALOG_USB2_VBUS_DETECT_SET  USB_PA_BASE0._0x0064
#define USB_ANALOG_USB2_VBUS_DETECT_CLR  USB_PA_BASE0._0x0068
#define USB_ANALOG_USB2_VBUS_DETECT_TOG  USB_PA_BASE0._0x006c
#define USB_ANALOG_USB2_CHRG_DETECT      USB_PA_BASE0._0x0070
#define USB_ANALOG_USB2_CHRG_DETECT_SET  USB_PA_BASE0._0x0074
#define USB_ANALOG_USB2_CHRG_DETECT_CLR  USB_PA_BASE0._0x0078
#define USB_ANALOG_USB2_CHRG_DETECT_TOG  USB_PA_BASE0._0x007c
#define USB_ANALOG_USB2_VBUS_DETECT_STAT USB_PA_BASE0._0x0080
#define USB_ANALOG_USB2_CHRG_DETECT_STAT USB_PA_BASE0._0x0090
#define USB_ANALOG_USB2_LOOPBACK         USB_PA_BASE0._0x00a0
#define USB_ANALOG_USB2_LOOPBACK_SET     USB_PA_BASE0._0x0a4
#define USB_ANALOG_USB2_LOOPBACK_CLR     USB_PA_BASE0._0x00a8
#define USB_ANALOG_USB2_LOOPBACK_TOG     USB_PA_BASE0._0x00ac
#define USB_ANALOG_USB2_MISC             USB_PA_BASE0._0x00b0
#define USB_ANALOG_USB2_MISC_SET         USB_PA_BASE0._0x00b4
#define USB_ANALOG_USB2_MISC_CLR         USB_PA_BASE0._0x00b8
#define USB_ANALOG_USB2_MISC_TOG         USB_PA_BASE0._0x00bc

#define USB_ANALOG_DIGPROG USB_PA_BASE0._0x00c0

