AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
//  Low Speed periphials
/**
 * @brief: FLEXCAN, Flexible Controller Area Network Memory Map
 * 44.9, p.2555
 *
 * USBPHY Hardware Register Format Summary
 * Base Address: 0x401d0000
 *
 * // About 150+ registers
 **/
#define FLEXCAN_BASE00    MAP_32BIT_REGISTER(0x401d0000)
#define FLEXCAN1_MCR      FLEXCAN_BASE00._0x0000
#define FLEXCAN1_CTRL1    FLEXCAN_BASE00._0x0004
#define FLEXCAN1_TIMER    FLEXCAN_BASE00._0x0008
#define FLEXCAN1_RXMGMASK FLEXCAN_BASE00._0x0010
#define FLEXCAN1_RX14MASK FLEXCAN_BASE00._0x0014
#define FLEXCAN1_RX15MASK FLEXCAN_BASE00._0x0018
#define FLEXCAN1_ECR      FLEXCAN_BASE00._0x001c
#define FLEXCAN1_ESR1     FLEXCAN_BASE00._0x0020
#define FLEXCAN1_IMASK2   FLEXCAN_BASE00._0x0024
#define FLEXCAN1_IMASK1   FLEXCAN_BASE00._0x0028
#define FLEXCAN1_IFLAG2   FLEXCAN_BASE00._0x002c
#define FLEXCAN1_IFLAG1   FLEXCAN_BASE00._0x0030
#define FLEXCAN1_CTRL2    FLEXCAN_BASE00._0x0034
#define FLEXCAN1_ESR2     FLEXCAN_BASE00._0x0038
#define FLEXCAN1_CRCR     FLEXCAN_BASE00._0x0044
#define FLEXCAN1_RXFGMASK FLEXCAN_BASE00._0x0048
#define FLEXCAN1_RXFIR    FLEXCAN_BASE00._0x004c

#define FLEXCAN_BASE01   MAP_32BIT_REGISTER(0x401d0800)
#define FLEXCAN1_RXIMR0  FLEXCAN_BASE00._0x0080
#define FLEXCAN1_RXIMR1  FLEXCAN_BASE00._0x0084
#define FLEXCAN1_RXIMR2  FLEXCAN_BASE00._0x0088
#define FLEXCAN1_RXIMR3  FLEXCAN_BASE00._0x008c
#define FLEXCAN1_RXIMR4  FLEXCAN_BASE00._0x0090
#define FLEXCAN1_RXIMR5  FLEXCAN_BASE00._0x0094
#define FLEXCAN1_RXIMR6  FLEXCAN_BASE00._0x0098
#define FLEXCAN1_RXIMR7  FLEXCAN_BASE00._0x009c
#define FLEXCAN1_RXIMR8  FLEXCAN_BASE00._0x00a0
#define FLEXCAN1_RXIMR9  FLEXCAN_BASE00._0x00a4
#define FLEXCAN1_RXIMR10 FLEXCAN_BASE00._0x00a8
#define FLEXCAN1_RXIMR11 FLEXCAN_BASE00._0x00ac
#define FLEXCAN1_RXIMR12 FLEXCAN_BASE00._0x00b0
#define FLEXCAN1_RXIMR13 FLEXCAN_BASE00._0x00b4
#define FLEXCAN1_RXIMR14 FLEXCAN_BASE00._0x00b8
#define FLEXCAN1_RXIMR15 FLEXCAN_BASE00._0x00bc
#define FLEXCAN1_RXIMR16 FLEXCAN_BASE00._0x00c0
#define FLEXCAN1_RXIMR17 FLEXCAN_BASE00._0x00c4
#define FLEXCAN1_RXIMR18 FLEXCAN_BASE00._0x00c8
#define FLEXCAN1_RXIMR19 FLEXCAN_BASE00._0x00cc
#define FLEXCAN1_RXIMR20 FLEXCAN_BASE00._0x00d0
#define FLEXCAN1_RXIMR21 FLEXCAN_BASE00._0x00d4
#define FLEXCAN1_RXIMR22 FLEXCAN_BASE00._0x00d8
#define FLEXCAN1_RXIMR23 FLEXCAN_BASE00._0x00dc
#define FLEXCAN1_RXIMR24 FLEXCAN_BASE00._0x00e0
#define FLEXCAN1_RXIMR25 FLEXCAN_BASE00._0x00e4
#define FLEXCAN1_RXIMR26 FLEXCAN_BASE00._0x00e8
#define FLEXCAN1_RXIMR27 FLEXCAN_BASE00._0x00eC
#define FLEXCAN1_RXIMR28 FLEXCAN_BASE00._0x00f0
#define FLEXCAN1_RXIMR29 FLEXCAN_BASE00._0x00f4
#define FLEXCAN1_RXIMR30 FLEXCAN_BASE00._0x00f8
#define FLEXCAN1_RXIMR31 FLEXCAN_BASE00._0x00fc
#define FLEXCAN1_RXIMR32 FLEXCAN_BASE00._0x0100
#define FLEXCAN1_RXIMR33 FLEXCAN_BASE00._0x0104
#define FLEXCAN1_RXIMR34 FLEXCAN_BASE00._0x0108
#define FLEXCAN1_RXIMR35 FLEXCAN_BASE00._0x010c
#define FLEXCAN1_RXIMR36 FLEXCAN_BASE00._0x0110
#define FLEXCAN1_RXIMR37 FLEXCAN_BASE00._0x0114
#define FLEXCAN1_RXIMR38 FLEXCAN_BASE00._0x0118
#define FLEXCAN1_RXIMR39 FLEXCAN_BASE00._0x011c
#define FLEXCAN1_RXIMR40 FLEXCAN_BASE00._0x0120
#define FLEXCAN1_RXIMR41 FLEXCAN_BASE00._0x0124
#define FLEXCAN1_RXIMR42 FLEXCAN_BASE00._0x0128
#define FLEXCAN1_RXIMR43 FLEXCAN_BASE00._0x012c
#define FLEXCAN1_RXIMR44 FLEXCAN_BASE00._0x0130
#define FLEXCAN1_RXIMR45 FLEXCAN_BASE00._0x0134
#define FLEXCAN1_RXIMR46 FLEXCAN_BASE00._0x0138
#define FLEXCAN1_RXIMR47 FLEXCAN_BASE00._0x013c
#define FLEXCAN1_RXIMR48 FLEXCAN_BASE00._0x0140
#define FLEXCAN1_RXIMR49 FLEXCAN_BASE00._0x0144
#define FLEXCAN1_RXIMR50 FLEXCAN_BASE00._0x0148
#define FLEXCAN1_RXIMR51 FLEXCAN_BASE00._0x014c
#define FLEXCAN1_RXIMR52 FLEXCAN_BASE00._0x0150
#define FLEXCAN1_RXIMR53 FLEXCAN_BASE00._0x0154
#define FLEXCAN1_RXIMR54 FLEXCAN_BASE00._0x0158
#define FLEXCAN1_RXIMR55 FLEXCAN_BASE00._0x015c
#define FLEXCAN1_RXIMR56 FLEXCAN_BASE00._0x0160
#define FLEXCAN1_RXIMR57 FLEXCAN_BASE00._0x0164
#define FLEXCAN1_RXIMR58 FLEXCAN_BASE00._0x0168
#define FLEXCAN1_RXIMR59 FLEXCAN_BASE00._0x016c
#define FLEXCAN1_RXIMR60 FLEXCAN_BASE00._0x0170
#define FLEXCAN1_RXIMR61 FLEXCAN_BASE00._0x0174
#define FLEXCAN1_RXIMR62 FLEXCAN_BASE00._0x0178
#define FLEXCAN1_RXIMR63 FLEXCAN_BASE00._0x017c
#define FLEXCAN1_GFWR    FLEXCAN_BASE00._0x01e0

#define FLEXCAN_BASE02    MAP_32BIT_REGISTER(0x401d4000)
#define FLEXCAN2_MCR      FLEXCAN_BASE00._0x0000
#define FLEXCAN2_CTRL1    FLEXCAN_BASE00._0x0004
#define FLEXCAN2_TIMER    FLEXCAN_BASE00._0x0008
#define FLEXCAN2_RXMGMASK FLEXCAN_BASE00._0x0010
#define FLEXCAN2_RX14MASK FLEXCAN_BASE00._0x0014
#define FLEXCAN2_RX15MASK FLEXCAN_BASE00._0x0018
#define FLEXCAN2_ECR      FLEXCAN_BASE00._0x001c
#define FLEXCAN2_ESR1     FLEXCAN_BASE00._0x0020
#define FLEXCAN2_IMASK2   FLEXCAN_BASE00._0x0024
#define FLEXCAN2_IMASK1   FLEXCAN_BASE00._0x0028
#define FLEXCAN2_IFLAG2   FLEXCAN_BASE00._0x002c
#define FLEXCAN2_IFLAG1   FLEXCAN_BASE00._0x0030
#define FLEXCAN2_CTRL2    FLEXCAN_BASE00._0x0034
#define FLEXCAN2_ESR2     FLEXCAN_BASE00._0x0038
#define FLEXCAN2_CRCR     FLEXCAN_BASE00._0x0044
#define FLEXCAN2_RXFGMASK FLEXCAN_BASE00._0x0048
#define FLEXCAN2_RXFIR    FLEXCAN_BASE00._0x004c

#define FLEXCAN_BASE03   MAP_32BIT_REGISTER(0x401d4800)
#define FLEXCAN2_RXIMR0  FLEXCAN_BASE00._0x0080
#define FLEXCAN2_RXIMR1  FLEXCAN_BASE00._0x0084
#define FLEXCAN2_RXIMR2  FLEXCAN_BASE00._0x0088
#define FLEXCAN2_RXIMR3  FLEXCAN_BASE00._0x008c
#define FLEXCAN2_RXIMR4  FLEXCAN_BASE00._0x0090
#define FLEXCAN2_RXIMR5  FLEXCAN_BASE00._0x0094
#define FLEXCAN2_RXIMR6  FLEXCAN_BASE00._0x0098
#define FLEXCAN2_RXIMR7  FLEXCAN_BASE00._0x009c
#define FLEXCAN2_RXIMR8  FLEXCAN_BASE00._0x00a0
#define FLEXCAN2_RXIMR9  FLEXCAN_BASE00._0x00a4
#define FLEXCAN2_RXIMR10 FLEXCAN_BASE00._0x00a8
#define FLEXCAN2_RXIMR11 FLEXCAN_BASE00._0x00aC
#define FLEXCAN2_RXIMR12 FLEXCAN_BASE00._0x00b0
#define FLEXCAN2_RXIMR13 FLEXCAN_BASE00._0x00b4
#define FLEXCAN2_RXIMR14 FLEXCAN_BASE00._0x00b8
#define FLEXCAN2_RXIMR15 FLEXCAN_BASE00._0x00bC
#define FLEXCAN2_RXIMR16 FLEXCAN_BASE00._0x00c0
#define FLEXCAN2_RXIMR17 FLEXCAN_BASE00._0x00c4
#define FLEXCAN2_RXIMR18 FLEXCAN_BASE00._0x00c8
#define FLEXCAN2_RXIMR19 FLEXCAN_BASE00._0x00cc
#define FLEXCAN2_RXIMR20 FLEXCAN_BASE00._0x00d0
#define FLEXCAN2_RXIMR21 FLEXCAN_BASE00._0x00d4
#define FLEXCAN2_RXIMR22 FLEXCAN_BASE00._0x00d8
#define FLEXCAN2_RXIMR23 FLEXCAN_BASE00._0x00dc
#define FLEXCAN2_RXIMR24 FLEXCAN_BASE00._0x00e0
#define FLEXCAN2_RXIMR25 FLEXCAN_BASE00._0x00e4
#define FLEXCAN2_RXIMR26 FLEXCAN_BASE00._0x00e8
#define FLEXCAN2_RXIMR27 FLEXCAN_BASE00._0x00ec
#define FLEXCAN2_RXIMR28 FLEXCAN_BASE00._0x00f0
#define FLEXCAN2_RXIMR29 FLEXCAN_BASE00._0x00f4
#define FLEXCAN2_RXIMR30 FLEXCAN_BASE00._0x00f8
#define FLEXCAN2_RXIMR31 FLEXCAN_BASE00._0x00fc
#define FLEXCAN2_RXIMR32 FLEXCAN_BASE00._0x0100
#define FLEXCAN2_RXIMR33 FLEXCAN_BASE00._0x0104
#define FLEXCAN2_RXIMR34 FLEXCAN_BASE00._0x0108
#define FLEXCAN2_RXIMR35 FLEXCAN_BASE00._0x010c
#define FLEXCAN2_RXIMR36 FLEXCAN_BASE00._0x0110
#define FLEXCAN2_RXIMR37 FLEXCAN_BASE00._0x0114
#define FLEXCAN2_RXIMR38 FLEXCAN_BASE00._0x0118
#define FLEXCAN2_RXIMR39 FLEXCAN_BASE00._0x011c
#define FLEXCAN2_RXIMR40 FLEXCAN_BASE00._0x0120
#define FLEXCAN2_RXIMR41 FLEXCAN_BASE00._0x0124
#define FLEXCAN2_RXIMR42 FLEXCAN_BASE00._0x0128
#define FLEXCAN2_RXIMR43 FLEXCAN_BASE00._0x012c
#define FLEXCAN2_RXIMR44 FLEXCAN_BASE00._0x0130
#define FLEXCAN2_RXIMR45 FLEXCAN_BASE00._0x0134
#define FLEXCAN2_RXIMR46 FLEXCAN_BASE00._0x0138
#define FLEXCAN2_RXIMR47 FLEXCAN_BASE00._0x013c
#define FLEXCAN2_RXIMR48 FLEXCAN_BASE00._0x0140
#define FLEXCAN2_RXIMR49 FLEXCAN_BASE00._0x0144
#define FLEXCAN2_RXIMR50 FLEXCAN_BASE00._0x0148
#define FLEXCAN2_RXIMR51 FLEXCAN_BASE00._0x014c
#define FLEXCAN2_RXIMR52 FLEXCAN_BASE00._0x0150
#define FLEXCAN2_RXIMR53 FLEXCAN_BASE00._0x0154
#define FLEXCAN2_RXIMR54 FLEXCAN_BASE00._0x0158
#define FLEXCAN2_RXIMR55 FLEXCAN_BASE00._0x015c
#define FLEXCAN2_RXIMR56 FLEXCAN_BASE00._0x0160
#define FLEXCAN2_RXIMR57 FLEXCAN_BASE00._0x0164
#define FLEXCAN2_RXIMR58 FLEXCAN_BASE00._0x0168
#define FLEXCAN2_RXIMR59 FLEXCAN_BASE00._0x016c
#define FLEXCAN2_RXIMR60 FLEXCAN_BASE00._0x0170
#define FLEXCAN2_RXIMR61 FLEXCAN_BASE00._0x0174
#define FLEXCAN2_RXIMR62 FLEXCAN_BASE00._0x0178
#define FLEXCAN2_RXIMR63 FLEXCAN_BASE00._0x017c
#define FLEXCAN2_GFWR    FLEXCAN_BASE00._0x01e0

/**
 * @brief: CANFD/FlexCAN3, Flexible Data-rate Controller Area Network Memory Map
 * 45.6.2, p.2654
 **/
#define FLEXCANFD3_BASE00 MAP_32BIT_REGISTER(0x401d8000)
#define CANFD_MCR         FLEXCANFD3_BASE00._0x0000 // Module Configuration register
#define CANFD_CTRL1       FLEXCANFD3_BASE00._0x0004 // Control 1 register
#define CANFD_TIMER       FLEXCANFD3_BASE00._0x0008 // Free Running Timer
#define CANFD_RXMGMASK    FLEXCANFD3_BASE00._0x0010 // RX Mailboxs Globl Mask reg.
#define CANFD_RX14MASK    FLEXCANFD3_BASE00._0x0014 // RX 14 Mask register
#define CANFD_RX15MASK    FLEXCANFD3_BASE00._0x0018 // RX 15 Mask register
#define CANFD_ECR         FLEXCANFD3_BASE00._0x001C // Error Counter
#define CANFD_ESR1        FLEXCANFD3_BASE00._0x0020 // Error and Status 1 register
#define CANFD_IMASK2      FLEXCANFD3_BASE00._0x0024 // Interrupt Masks 2 register
#define CANFD_IMASK1      FLEXCANFD3_BASE00._0x0028 // Interrupt Masks 1 register
#define CANFD_IFLAG2      FLEXCANFD3_BASE00._0x002c // Interrupt Flags 2 register
#define CANFD_IFLAG1      FLEXCANFD3_BASE00._0x0030 // Interrupt Flags 1 register
#define CANFD_CTRL2       FLEXCANFD3_BASE00._0x0034 // Control 2 register
#define CANFD_ESR2        FLEXCANFD3_BASE00._0x0038 // Error and Status 2 register
#define CANFD_CRCR        FLEXCANFD3_BASE00._0x0044 // CRC register
#define CANFD_RXFGMASK    FLEXCANFD3_BASE00._0x0048 // Rx FIFO Global Mask register
#define CANFD_RXFIR       FLEXCANFD3_BASE00._0x004c // Rx FIFO Information register
#define CANFD_CBT         FLEXCANFD3_BASE00._0x0050 // CAN Bit Timing register

// CANFD RX Individual Mask Registers
#define FLEXCANFD3_BASE01 MAP_32BIT_REGISTER(0x401d8880)
#define CANFD_RXIMR00     FLEXCANFD3_BASE01._0x0000
#define CANFD_RXIMR01     FLEXCANFD3_BASE01._0x0004
#define CANFD_RXIMR02     FLEXCANFD3_BASE01._0x0008
#define CANFD_RXIMR03     FLEXCANFD3_BASE01._0x000c
#define CANFD_RXIMR04     FLEXCANFD3_BASE01._0x0010
#define CANFD_RXIMR05     FLEXCANFD3_BASE01._0x0014
#define CANFD_RXIMR06     FLEXCANFD3_BASE01._0x0018
#define CANFD_RXIMR07     FLEXCANFD3_BASE01._0x001c
#define CANFD_RXIMR08     FLEXCANFD3_BASE01._0x0020
#define CANFD_RXIMR09     FLEXCANFD3_BASE01._0x0024
#define CANFD_RXIMR10     FLEXCANFD3_BASE01._0x0028
#define CANFD_RXIMR11     FLEXCANFD3_BASE01._0x002c
#define CANFD_RXIMR12     FLEXCANFD3_BASE01._0x0030
#define CANFD_RXIMR13     FLEXCANFD3_BASE01._0x0034
#define CANFD_RXIMR14     FLEXCANFD3_BASE01._0x0038
#define CANFD_RXIMR15     FLEXCANFD3_BASE01._0x003c
#define CANFD_RXIMR16     FLEXCANFD3_BASE01._0x0040
#define CANFD_RXIMR17     FLEXCANFD3_BASE01._0x0044
#define CANFD_RXIMR18     FLEXCANFD3_BASE01._0x0048
#define CANFD_RXIMR19     FLEXCANFD3_BASE01._0x004c
#define CANFD_RXIMR20     FLEXCANFD3_BASE01._0x0050
#define CANFD_RXIMR21     FLEXCANFD3_BASE01._0x0054
#define CANFD_RXIMR22     FLEXCANFD3_BASE01._0x0058
#define CANFD_RXIMR23     FLEXCANFD3_BASE01._0x005c
#define CANFD_RXIMR24     FLEXCANFD3_BASE01._0x0060
#define CANFD_RXIMR25     FLEXCANFD3_BASE01._0x0064
#define CANFD_RXIMR26     FLEXCANFD3_BASE01._0x0068
#define CANFD_RXIMR27     FLEXCANFD3_BASE01._0x006c
#define CANFD_RXIMR28     FLEXCANFD3_BASE01._0x0070
#define CANFD_RXIMR29     FLEXCANFD3_BASE01._0x0074
#define CANFD_RXIMR30     FLEXCANFD3_BASE01._0x0078
#define CANFD_RXIMR31     FLEXCANFD3_BASE01._0x007c
#define CANFD_RXIMR32     FLEXCANFD3_BASE01._0x0080
#define CANFD_RXIMR33     FLEXCANFD3_BASE01._0x0084
#define CANFD_RXIMR34     FLEXCANFD3_BASE01._0x0088
#define CANFD_RXIMR35     FLEXCANFD3_BASE01._0x008c
#define CANFD_RXIMR36     FLEXCANFD3_BASE01._0x0090
#define CANFD_RXIMR37     FLEXCANFD3_BASE01._0x0094
#define CANFD_RXIMR38     FLEXCANFD3_BASE01._0x0098
#define CANFD_RXIMR39     FLEXCANFD3_BASE01._0x009c
#define CANFD_RXIMR40     FLEXCANFD3_BASE01._0x00a0
#define CANFD_RXIMR41     FLEXCANFD3_BASE01._0x00a4
#define CANFD_RXIMR42     FLEXCANFD3_BASE01._0x00a8
#define CANFD_RXIMR43     FLEXCANFD3_BASE01._0x00ac
#define CANFD_RXIMR44     FLEXCANFD3_BASE01._0x00b0
#define CANFD_RXIMR45     FLEXCANFD3_BASE01._0x00b4
#define CANFD_RXIMR46     FLEXCANFD3_BASE01._0x00b8
#define CANFD_RXIMR47     FLEXCANFD3_BASE01._0x00bc
#define CANFD_RXIMR48     FLEXCANFD3_BASE01._0x00c0
#define CANFD_RXIMR49     FLEXCANFD3_BASE01._0x00c4
#define CANFD_RXIMR50     FLEXCANFD3_BASE01._0x00c8
#define CANFD_RXIMR51     FLEXCANFD3_BASE01._0x00cc
#define CANFD_RXIMR52     FLEXCANFD3_BASE01._0x00d0
#define CANFD_RXIMR53     FLEXCANFD3_BASE01._0x00d4
#define CANFD_RXIMR54     FLEXCANFD3_BASE01._0x00d8
#define CANFD_RXIMR55     FLEXCANFD3_BASE01._0x00dc
#define CANFD_RXIMR56     FLEXCANFD3_BASE01._0x00e0
#define CANFD_RXIMR57     FLEXCANFD3_BASE01._0x00e4
#define CANFD_RXIMR58     FLEXCANFD3_BASE01._0x00e8
#define CANFD_RXIMR59     FLEXCANFD3_BASE01._0x00ec
#define CANFD_RXIMR60     FLEXCANFD3_BASE01._0x00f0
#define CANFD_RXIMR61     FLEXCANFD3_BASE01._0x00f4
#define CANFD_RXIMR62     FLEXCANFD3_BASE01._0x00f8
#define CANFD_RXIMR63     FLEXCANFD3_BASE01._0x00fc

#define CANFD00         FLEXCANFD3_BASE00._0x0000
#define CANFD_CTRL      B_OFFSET(CANFD00, 0xc00) // Rx FIFO Global Mask register
#define CANFD_BITTIMING B_OFFSET(CANFD00, 0xc04) // Rx FIFO Information register
#define CANFD_CRC       B_OFFSET(CANFD00, 0xc08) // CAN Bit Timing register

/**
 * @brief: KPP, Key Pad Port Memory Map
 * 46.7 p.2733
 *
 * USBPHY Hardware Register Format Summary
 * Base Address: 0x401d8000
 *
 **/
#define KPP_BASE MAP_16BIT_REGISTER(0x401fc000)
#define KPP_KPCR KPP_BASE._0x0000
#define KPP_KPSR KPP_BASE._0x0002
#define KPP_KDDR KPP_BASE._0x0004
#define KPP_KPDR KPP_BASE._0x0006

/**
 * @brief: LPI2C, Low Power Inter-Integrated Circuit, Memory Map
 * 47.4.1 p.2758
 *
 * // 112 registers , 28 registers per each LPSPI
 * Base addresses:
 * LPI2C1: 0x403f0000
 * LPI2C2: 0x403f4000
 * LPI2C3: 0x403f8000
 * LPI2C4: 0x403fc000
 **/
#define LPI2C1_BASE   MAP_32BIT_REGISTER(0x403f0000)
#define LPI2C1_VERID  LPI2C1_BASE._0x0000 // Version ID Register
#define LPI2C1_PARAM  LPI2C1_BASE._0x004  // Parameter Register
#define LPI2C1_MCR    LPI2C1_BASE._0x0010 // Master Control Register
#define LPI2C1_MSR    LPI2C1_BASE._0x0014 // Master Status Register
#define LPI2C1_MIER   LPI2C1_BASE._0x0018 // Master Interrupt Enable Register
#define LPI2C1_MDER   LPI2C1_BASE._0x001c // Master DMA Enable Register
#define LPI2C1_MCFGR0 LPI2C1_BASE._0x0020 // Master Config. Register 0
#define LPI2C1_MCFGR1 LPI2C1_BASE._0x0024 // Master Config. Register 1
#define LPI2C1_MCFGR2 LPI2C1_BASE._0x0028 // Master Config. Register 2
#define LPI2C1_MCFGR3 LPI2C1_BASE._0x002c // Master Config. Register 3
#define LPI2C1_MDMR   LPI2C1_BASE._0x0040 // Master Data Match Register
#define LPI2C1_MCCR0  LPI2C1_BASE._0x0048 // Master Clock Config. Register 0
#define LPI2C1_MCCR1  LPI2C1_BASE._0x0050 // Master Clock Config. Register 1
#define LPI2C1_MFCR   LPI2C1_BASE._0x0058 // Master FIFO Control Register
#define LPI2C1_MFSR   LPI2C1_BASE._0x005c // Master FIFO Status Register
#define LPI2C1_MTDR   LPI2C1_BASE._0x0060 // Master Transmit Data Register
#define LPI2C1_MRDR   LPI2C1_BASE._0x0070 // Master Receive Data Register
#define LPI2C1_SCR    LPI2C1_BASE._0x0110 // Slave Control Register
#define LPI2C1_SSR    LPI2C1_BASE._0x0114 // Slave Status Register
#define LPI2C1_SIER   LPI2C1_BASE._0x0118 // Slave Interrupt Enable Register
#define LPI2C1_SDER   LPI2C1_BASE._0x011C // Slave DMA Enable Register
#define LPI2C1_SCFGR1 LPI2C1_BASE._0x0124 // Slave Config. Register 1
#define LPI2C1_SCFGR2 LPI2C1_BASE._0x0128 // Slave Config. Register 2
#define LPI2C1_SAMR   LPI2C1_BASE._0x0140 // Slave Address Match Register
#define LPI2C1_SASR   LPI2C1_BASE._0x0150 // Slave Address Status Register
#define LPI2C1_STAR   LPI2C1_BASE._0x0154 // Slave Transmit ACK Register
#define LPI2C1_STDR   LPI2C1_BASE._0x0160 // Slave Transmit Data Register
#define LPI2C1_SRDR   LPI2C1_BASE._0x0170 // Slave Receive Data Register

#define LPI2C2_BASE   MAP_32BIT_REGISTER(0x403f4000)
#define LPI2C2_VERID  LPI2C2_BASE._0x0000 // Version ID Register
#define LPI2C2_PARAM  LPI2C2_BASE._0x004  // Parameter Register
#define LPI2C2_MCR    LPI2C2_BASE._0x0010 // Master Control Register
#define LPI2C2_MSR    LPI2C2_BASE._0x0014 // Master Status Register
#define LPI2C2_MIER   LPI2C2_BASE._0x0018 // Master Interrupt Enable Register
#define LPI2C2_MDER   LPI2C2_BASE._0x001c // Master DMA Enable Register
#define LPI2C2_MCFGR0 LPI2C2_BASE._0x0020 // Master Config. Register 0
#define LPI2C2_MCFGR1 LPI2C2_BASE._0x0024 // Master Config. Register 1
#define LPI2C2_MCFGR2 LPI2C2_BASE._0x0028 // Master Config. Register 2
#define LPI2C2_MCFGR3 LPI2C2_BASE._0x002c // Master Config. Register 3
#define LPI2C2_MDMR   LPI2C2_BASE._0x0040 // Master Data Match Register
#define LPI2C2_MCCR0  LPI2C2_BASE._0x0048 // Master Clock Config. Register 0
#define LPI2C2_MCCR1  LPI2C2_BASE._0x0050 // Master Clock Config. Register 1
#define LPI2C2_MFCR   LPI2C2_BASE._0x0058 // Master FIFO Control Register
#define LPI2C2_MFSR   LPI2C2_BASE._0x005c // Master FIFO Status Register
#define LPI2C2_MTDR   LPI2C2_BASE._0x0060 // Master Transmit Data Register
#define LPI2C2_MRDR   LPI2C2_BASE._0x0070 // Master Receive Data Register
#define LPI2C2_SCR    LPI2C2_BASE._0x0110 // Slave Control Register
#define LPI2C2_SSR    LPI2C2_BASE._0x0114 // Slave Status Register
#define LPI2C2_SIER   LPI2C2_BASE._0x0118 // Slave Interrupt Enable Register
#define LPI2C2_SDER   LPI2C2_BASE._0x011C // Slave DMA Enable Register
#define LPI2C2_SCFGR1 LPI2C2_BASE._0x0124 // Slave Config. Register 1
#define LPI2C2_SCFGR2 LPI2C2_BASE._0x0128 // Slave Config. Register 2
#define LPI2C2_SAMR   LPI2C2_BASE._0x0140 // Slave Address Match Register
#define LPI2C2_SASR   LPI2C2_BASE._0x0150 // Slave Address Status Register
#define LPI2C2_STAR   LPI2C2_BASE._0x0154 // Slave Transmit ACK Register
#define LPI2C2_STDR   LPI2C2_BASE._0x0160 // Slave Transmit Data Register
#define LPI2C2_SRDR   LPI2C2_BASE._0x0170 // Slave Receive Data Register

#define LPI2C3_BASE   MAP_32BIT_REGISTER(0x403f8000)
#define LPI2C3_VERID  LPI2C3_BASE._0x0000 // Version ID Register
#define LPI2C3_PARAM  LPI2C3_BASE._0x004  // Parameter Register
#define LPI2C3_MCR    LPI2C3_BASE._0x0010 // Master Control Register
#define LPI2C3_MSR    LPI2C3_BASE._0x0014 // Master Status Register
#define LPI2C3_MIER   LPI2C3_BASE._0x0018 // Master Interrupt Enable Register
#define LPI2C3_MDER   LPI2C3_BASE._0x001c // Master DMA Enable Register
#define LPI2C3_MCFGR0 LPI2C3_BASE._0x0020 // Master Config. Register 0
#define LPI2C3_MCFGR1 LPI2C3_BASE._0x0024 // Master Config. Register 1
#define LPI2C3_MCFGR2 LPI2C3_BASE._0x0028 // Master Config. Register 2
#define LPI2C3_MCFGR3 LPI2C3_BASE._0x002c // Master Config. Register 3
#define LPI2C3_MDMR   LPI2C3_BASE._0x0040 // Master Data Match Register
#define LPI2C3_MCCR0  LPI2C3_BASE._0x0048 // Master Clock Config. Register 0
#define LPI2C3_MCCR1  LPI2C3_BASE._0x0050 // Master Clock Config. Register 1
#define LPI2C3_MFCR   LPI2C3_BASE._0x0058 // Master FIFO Control Register
#define LPI2C3_MFSR   LPI2C3_BASE._0x005c // Master FIFO Status Register
#define LPI2C3_MTDR   LPI2C3_BASE._0x0060 // Master Transmit Data Register
#define LPI2C3_MRDR   LPI2C3_BASE._0x0070 // Master Receive Data Register
#define LPI2C3_SCR    LPI2C3_BASE._0x0110 // Slave Control Register
#define LPI2C3_SSR    LPI2C3_BASE._0x0114 // Slave Status Register
#define LPI2C3_SIER   LPI2C3_BASE._0x0118 // Slave Interrupt Enable Register
#define LPI2C3_SDER   LPI2C3_BASE._0x011C // Slave DMA Enable Register
#define LPI2C3_SCFGR1 LPI2C3_BASE._0x0124 // Slave Config. Register 1
#define LPI2C3_SCFGR2 LPI2C3_BASE._0x0128 // Slave Config. Register 2
#define LPI2C3_SAMR   LPI2C3_BASE._0x0140 // Slave Address Match Register
#define LPI2C3_SASR   LPI2C3_BASE._0x0150 // Slave Address Status Register
#define LPI2C3_STAR   LPI2C3_BASE._0x0154 // Slave Transmit ACK Register
#define LPI2C3_STDR   LPI2C3_BASE._0x0160 // Slave Transmit Data Register
#define LPI2C3_SRDR   LPI2C3_BASE._0x0170 // Slave Receive Data Register

#define LPI2C4_BASE   MAP_32BIT_REGISTER(0x403fc000)
#define LPI2C4_VERID  LPI2C4_BASE._0x0000 // Version ID Register
#define LPI2C4_PARAM  LPI2C4_BASE._0x004  // Parameter Register
#define LPI2C4_MCR    LPI2C4_BASE._0x0010 // Master Control Register
#define LPI2C4_MSR    LPI2C4_BASE._0x0014 // Master Status Register
#define LPI2C4_MIER   LPI2C4_BASE._0x0018 // Master Interrupt Enable Register
#define LPI2C4_MDER   LPI2C4_BASE._0x001c // Master DMA Enable Register
#define LPI2C4_MCFGR0 LPI2C4_BASE._0x0020 // Master Config. Register 0
#define LPI2C4_MCFGR1 LPI2C4_BASE._0x0024 // Master Config. Register 1
#define LPI2C4_MCFGR2 LPI2C4_BASE._0x0028 // Master Config. Register 2
#define LPI2C4_MCFGR3 LPI2C4_BASE._0x002c // Master Config. Register 3
#define LPI2C4_MDMR   LPI2C4_BASE._0x0040 // Master Data Match Register
#define LPI2C4_MCCR0  LPI2C4_BASE._0x0048 // Master Clock Config. Register 0
#define LPI2C4_MCCR1  LPI2C4_BASE._0x0050 // Master Clock Config. Register 1
#define LPI2C4_MFCR   LPI2C4_BASE._0x0058 // Master FIFO Control Register
#define LPI2C4_MFSR   LPI2C4_BASE._0x005c // Master FIFO Status Register
#define LPI2C4_MTDR   LPI2C4_BASE._0x0060 // Master Transmit Data Register
#define LPI2C4_MRDR   LPI2C4_BASE._0x0070 // Master Receive Data Register
#define LPI2C4_SCR    LPI2C4_BASE._0x0110 // Slave Control Register
#define LPI2C4_SSR    LPI2C4_BASE._0x0114 // Slave Status Register
#define LPI2C4_SIER   LPI2C4_BASE._0x0118 // Slave Interrupt Enable Register
#define LPI2C4_SDER   LPI2C4_BASE._0x011C // Slave DMA Enable Register
#define LPI2C4_SCFGR1 LPI2C4_BASE._0x0124 // Slave Configuration Register 1
#define LPI2C4_SCFGR2 LPI2C4_BASE._0x0128 // Slave Configuration Register 2
#define LPI2C4_SAMR   LPI2C4_BASE._0x0140 // Slave Address Match Register
#define LPI2C4_SASR   LPI2C4_BASE._0x0150 // Slave Address Status Register
#define LPI2C4_STAR   LPI2C4_BASE._0x0154 // Slave Transmit ACK Register
#define LPI2C4_STDR   LPI2C4_BASE._0x0160 // Slave Transmit Data Register
#define LPI2C4_SRDR   LPI2C4_BASE._0x0170 // Slave Receive Data Register

/**
 * @brief: LPSPI, Low Power Serial Peripheral Interface, Memory Map
 * 48.4.1 p.2810
 *
 * // 68 registers , 17 registers per each LPSPI
 * Base addresses:
 * LPSPI1: 0x40394000
 * LPSPI2: 0x40398000
 * LPSPI3: 0x4039c000
 * LPSPI4: 0x403a0000
 **/

