AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
// LPSPI1
#define LPSPI1_BASE  MAP_32BIT_REGISTER(0x40394000)
#define LPSPI1_VERID LPSPI1_BASE._0x0000 // Version ID Register
#define LPSPI1_PARAM LPSPI1_BASE._0x0004 // Parameter Register
#define LPSPI1_CR    LPSPI1_BASE._0x0010 // Control Register
#define LPSPI1_SR    LPSPI1_BASE._0x0014 // Status Register
#define LPSPI1_IER   LPSPI1_BASE._0x0018 // Interrupt Enable Register
#define LPSPI1_DER   LPSPI1_BASE._0x001c // DMA Enable Register
#define LPSPI1_CFGR0 LPSPI1_BASE._0x0020 // Configuration Register 0
#define LPSPI1_CFGR1 LPSPI1_BASE._0x0024 // Configuration Register 1
#define LPSPI1_DMR0  LPSPI1_BASE._0x0030 // Data Match Register 0
#define LPSPI1_DMR1  LPSPI1_BASE._0x0034 // Data Match Register 1
#define LPSPI1_CCR   LPSPI1_BASE._0x0040 // Clock Configuration Register
#define LPSPI1_FCR   LPSPI1_BASE._0x0058 // FIFO Control Register
#define LPSPI1_FSR   LPSPI1_BASE._0x005c // FIFO Status Register
#define LPSPI1_TCR   LPSPI1_BASE._0x0060 // Transmit Command Register
#define LPSPI1_TDR   LPSPI1_BASE._0x0064 // Transmit Data Register
#define LPSPI1_RSR   LPSPI1_BASE._0x0070 // Receive Status Register
#define LPSPI1_RDR   LPSPI1_BASE._0x0074 // Receive Data Register

// LPSPI2
#define LPSPI2_BASE  MAP_32BIT_REGISTER(0x40394000)
#define LPSPI2_VERID LPSPI2_BASE._0x0000 // Version ID Register
#define LPSPI2_PARAM LPSPI2_BASE._0x0004 // Parameter Register
#define LPSPI2_CR    LPSPI2_BASE._0x0010 // Control Register
#define LPSPI2_SR    LPSPI2_BASE._0x0014 // Status Register
#define LPSPI2_IER   LPSPI2_BASE._0x0018 // Interrupt Enable Register
#define LPSPI2_DER   LPSPI2_BASE._0x001c // DMA Enable Register
#define LPSPI2_CFGR0 LPSPI2_BASE._0x0020 // Configuration Register 0
#define LPSPI2_CFGR1 LPSPI2_BASE._0x0024 // Configuration Register 1
#define LPSPI2_DMR0  LPSPI2_BASE._0x0030 // Data Match Register 0
#define LPSPI2_DMR1  LPSPI2_BASE._0x0034 // Data Match Register 1
#define LPSPI2_CCR   LPSPI2_BASE._0x0040 // Clock Configuration Register
#define LPSPI2_FCR   LPSPI2_BASE._0x0058 // FIFO Control Register
#define LPSPI2_FSR   LPSPI2_BASE._0x005c // FIFO Status Register
#define LPSPI2_TCR   LPSPI2_BASE._0x0060 // Transmit Command Register
#define LPSPI2_TDR   LPSPI2_BASE._0x0064 // Transmit Data Register
#define LPSPI2_RSR   LPSPI2_BASE._0x0070 // Receive Status Register
#define LPSPI2_RDR   LPSPI2_BASE._0x0074 // Receive Data Register

// LPSPI3
#define LPSPI3_BASE  MAP_32BIT_REGISTER(0x40394000)
#define LPSPI3_VERID LPSPI3_BASE._0x0000 // Version ID Register
#define LPSPI3_PARAM LPSPI3_BASE._0x0004 // Parameter Register
#define LPSPI3_CR    LPSPI3_BASE._0x0010 // Control Register
#define LPSPI3_SR    LPSPI3_BASE._0x0014 // Status Register
#define LPSPI3_IER   LPSPI3_BASE._0x0018 // Interrupt Enable Register
#define LPSPI3_DER   LPSPI3_BASE._0x001c // DMA Enable Register
#define LPSPI3_CFGR0 LPSPI3_BASE._0x0020 // Configuration Register 0
#define LPSPI3_CFGR1 LPSPI3_BASE._0x0024 // Configuration Register 1
#define LPSPI3_DMR0  LPSPI3_BASE._0x0030 // Data Match Register 0
#define LPSPI3_DMR1  LPSPI3_BASE._0x0034 // Data Match Register 1
#define LPSPI3_CCR   LPSPI3_BASE._0x0040 // Clock Configuration Register
#define LPSPI3_FCR   LPSPI3_BASE._0x0058 // FIFO Control Register
#define LPSPI3_FSR   LPSPI3_BASE._0x005c // FIFO Status Register
#define LPSPI3_TCR   LPSPI3_BASE._0x0060 // Transmit Command Register
#define LPSPI3_TDR   LPSPI3_BASE._0x0064 // Transmit Data Register
#define LPSPI3_RSR   LPSPI3_BASE._0x0070 // Receive Status Register
#define LPSPI3_RDR   LPSPI3_BASE._0x0074 // Receive Data Register

// LPSPI4
#define LPSPI4_BASE  MAP_32BIT_REGISTER(0x40394000)
#define LPSPI4_VERID LPSPI4_BASE._0x0000 // Version ID Register
#define LPSPI4_PARAM LPSPI4_BASE._0x0004 // Parameter Register
#define LPSPI4_CR    LPSPI4_BASE._0x0010 // Control Register
#define LPSPI4_SR    LPSPI4_BASE._0x0014 // Status Register
#define LPSPI4_IER   LPSPI4_BASE._0x0018 // Interrupt Enable Register
#define LPSPI4_DER   LPSPI4_BASE._0x001c // DMA Enable Register
#define LPSPI4_CFGR0 LPSPI4_BASE._0x0020 // Configuration Register 0
#define LPSPI4_CFGR1 LPSPI4_BASE._0x0024 // Configuration Register 1
#define LPSPI4_DMR0  LPSPI4_BASE._0x0030 // Data Match Register 0
#define LPSPI4_DMR1  LPSPI4_BASE._0x0034 // Data Match Register 1
#define LPSPI4_CCR   LPSPI4_BASE._0x0040 // Clock Configuration Register
#define LPSPI4_FCR   LPSPI4_BASE._0x0058 // FIFO Control Register
#define LPSPI4_FSR   LPSPI4_BASE._0x005c // FIFO Status Register
#define LPSPI4_TCR   LPSPI4_BASE._0x0060 // Transmit Command Register
#define LPSPI4_TDR   LPSPI4_BASE._0x0064 // Transmit Data Register
#define LPSPI4_RSR   LPSPI4_BASE._0x0070 // Receive Status Register
#define LPSPI4_RDR   LPSPI4_BASE._0x0074 // Receive Data Register

/**
 * @brief: LPUART, Low Power Universal Async. Receiver/transmitter, Memory Map
 * 49.4 p.2853
 *
 * // 96 registers ,12 registers per each LPUART
 * Base addresses:
 * LPUART(n): 0x40184000 + (n-1) * 0x4000,
 *
 * LPUART1: 0x40184000
 * LPUART2: 0x40188000
 * LPUART3: 0x4018c000
 * LPUART4: 0x40190000
 * LPUART5: 0x40194000
 * LPUART6: 0x40198000
 * LPUART7: 0x4019c000
 * LPUART8: 0x401a0000
 * where n goes from 1 to 8.
 **/

// LPUART1
#define LPUART1_BASE   MAP_32BIT_REGISTER(0x40184000)
#define LPUART1_VERID  LPUART1_BASE._0x0000 // Version ID Register
#define LPUART1_PARAM  LPUART1_BASE._0x0004 // Parameter Register
#define LPUART1_GLOBAL LPUART1_BASE._0x0008 // LPUART Global Register
#define LPUART1_PINCFG LPUART1_BASE._0x000c // LPUART Pin Configuration Register
#define LPUART1_BAUD   LPUART1_BASE._0x0010 // LPUART Baud Rate Register
#define LPUART1_STAT   LPUART1_BASE._0x0014 // LPUART Status Register
#define LPUART1_CTRL   LPUART1_BASE._0x0018 // LPUART Control Register
#define LPUART1_DATA   LPUART1_BASE._0x001c // LPUART Data Register
#define LPUART1_MATCH  LPUART1_BASE._0x0020 // LPUART Match Address Register
#define LPUART1_MODIR  LPUART1_BASE._0x0024 // LPUART Modem IrDA Register
#define LPUART1_FIFO   LPUART1_BASE._0x0028 // LPUART FIFO Register
#define LPUART1_WATER  LPUART1_BASE._0x002c // LPUART Watermark Register

