AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
// LPUART2
#define LPUART2_BASE   MAP_32BIT_REGISTER(0x40188000)
#define LPUART2_VERID  LPUART2_BASE._0x0000 // Version ID Register
#define LPUART2_PARAM  LPUART2_BASE._0x0004 // Parameter Register
#define LPUART2_GLOBAL LPUART2_BASE._0x0008 // LPUART Global Register
#define LPUART2_PINCFG LPUART2_BASE._0x000c // LPUART Pin Configuration Register
#define LPUART2_BAUD   LPUART2_BASE._0x0010 // LPUART Baud Rate Register
#define LPUART2_STAT   LPUART2_BASE._0x0014 // LPUART Status Register
#define LPUART2_CTRL   LPUART2_BASE._0x0018 // LPUART Control Register
#define LPUART2_DATA   LPUART2_BASE._0x001c // LPUART Data Register
#define LPUART2_MATCH  LPUART2_BASE._0x0020 // LPUART Match Address Register
#define LPUART2_MODIR  LPUART2_BASE._0x0024 // LPUART Modem IrDA Register
#define LPUART2_FIFO   LPUART2_BASE._0x0028 // LPUART FIFO Register
#define LPUART2_WATER  LPUART2_BASE._0x002c // LPUART Watermark Register

// LPUART3
#define LPUART3_BASE   MAP_32BIT_REGISTER(0x4018c000)
#define LPUART3_VERID  LPUART3_BASE._0x0000 // Version ID Register
#define LPUART3_PARAM  LPUART3_BASE._0x0004 // Parameter Register
#define LPUART3_GLOBAL LPUART3_BASE._0x0008 // LPUART Global Register
#define LPUART3_PINCFG LPUART3_BASE._0x000c // LPUART Pin Configuration Register
#define LPUART3_BAUD   LPUART3_BASE._0x0010 // LPUART Baud Rate Register
#define LPUART3_STAT   LPUART3_BASE._0x0014 // LPUART Status Register
#define LPUART3_CTRL   LPUART3_BASE._0x0018 // LPUART Control Register
#define LPUART3_DATA   LPUART3_BASE._0x001c // LPUART Data Register
#define LPUART3_MATCH  LPUART3_BASE._0x0020 // LPUART Match Address Register
#define LPUART3_MODIR  LPUART3_BASE._0x0024 // LPUART Modem IrDA Register
#define LPUART3_FIFO   LPUART3_BASE._0x0028 // LPUART FIFO Register
#define LPUART3_WATER  LPUART3_BASE._0x002c // LPUART Watermark Register

// LPUART4
#define LPUART4_BASE   MAP_32BIT_REGISTER(0x40190000)
#define LPUART4_VERID  LPUART4_BASE._0x0000 // Version ID Register
#define LPUART4_PARAM  LPUART4_BASE._0x0004 // Parameter Register
#define LPUART4_GLOBAL LPUART4_BASE._0x0008 // LPUART Global Register
#define LPUART4_PINCFG LPUART4_BASE._0x000c // LPUART Pin Configuration Register
#define LPUART4_BAUD   LPUART4_BASE._0x0010 // LPUART Baud Rate Register
#define LPUART4_STAT   LPUART4_BASE._0x0014 // LPUART Status Register
#define LPUART4_CTRL   LPUART4_BASE._0x0018 // LPUART Control Register
#define LPUART4_DATA   LPUART4_BASE._0x001c // LPUART Data Register
#define LPUART4_MATCH  LPUART4_BASE._0x0020 // LPUART Match Address Register
#define LPUART4_MODIR  LPUART4_BASE._0x0024 // LPUART Modem IrDA Register
#define LPUART4_FIFO   LPUART4_BASE._0x0028 // LPUART FIFO Register
#define LPUART4_WATER  LPUART4_BASE._0x002c // LPUART Watermark Register

// LPUART5
#define LPUART5_BASE   MAP_32BIT_REGISTER(0x40194000)
#define LPUART5_VERID  LPUART5_BASE._0x0000 // Version ID Register
#define LPUART5_PARAM  LPUART5_BASE._0x0004 // Parameter Register
#define LPUART5_GLOBAL LPUART5_BASE._0x0008 // LPUART Global Register
#define LPUART5_PINCFG LPUART5_BASE._0x000c // LPUART Pin Configuration Register
#define LPUART5_BAUD   LPUART5_BASE._0x0010 // LPUART Baud Rate Register
#define LPUART5_STAT   LPUART5_BASE._0x0014 // LPUART Status Register
#define LPUART5_CTRL   LPUART5_BASE._0x0018 // LPUART Control Register
#define LPUART5_DATA   LPUART5_BASE._0x001c // LPUART Data Register
#define LPUART5_MATCH  LPUART5_BASE._0x0020 // LPUART Match Address Register
#define LPUART5_MODIR  LPUART5_BASE._0x0024 // LPUART Modem IrDA Register
#define LPUART5_FIFO   LPUART5_BASE._0x0028 // LPUART FIFO Register
#define LPUART5_WATER  LPUART5_BASE._0x002c // LPUART Watermark Register

// LPUART6
#define LPUART6_BASE   MAP_32BIT_REGISTER(0x40198000)
#define LPUART6_VERID  LPUART6_BASE._0x0000 // Version ID Register
#define LPUART6_PARAM  LPUART6_BASE._0x0004 // Parameter Register
#define LPUART6_GLOBAL LPUART6_BASE._0x0008 // LPUART Global Register
#define LPUART6_PINCFG LPUART6_BASE._0x000c // LPUART Pin Configuration Register
#define LPUART6_BAUD   LPUART6_BASE._0x0010 // LPUART Baud Rate Register
#define LPUART6_STAT   LPUART6_BASE._0x0014 // LPUART Status Register
#define LPUART6_CTRL   LPUART6_BASE._0x0018 // LPUART Control Register
#define LPUART6_DATA   LPUART6_BASE._0x001c // LPUART Data Register
#define LPUART6_MATCH  LPUART6_BASE._0x0020 // LPUART Match Address Register
#define LPUART6_MODIR  LPUART6_BASE._0x0024 // LPUART Modem IrDA Register
#define LPUART6_FIFO   LPUART6_BASE._0x0028 // LPUART FIFO Register
#define LPUART6_WATER  LPUART6_BASE._0x002c // LPUART Watermark Register

// LPUART7
#define LPUART7_BASE   MAP_32BIT_REGISTER(0x4019c000)
#define LPUART7_VERID  LPUART7_BASE._0x0000 // Version ID Register
#define LPUART7_PARAM  LPUART7_BASE._0x0004 // Parameter Register
#define LPUART7_GLOBAL LPUART7_BASE._0x0008 // LPUART Global Register
#define LPUART7_PINCFG LPUART7_BASE._0x000c // LPUART Pin Configuration Register
#define LPUART7_BAUD   LPUART7_BASE._0x0010 // LPUART Baud Rate Register
#define LPUART7_STAT   LPUART7_BASE._0x0014 // LPUART Status Register
#define LPUART7_CTRL   LPUART7_BASE._0x0018 // LPUART Control Register
#define LPUART7_DATA   LPUART7_BASE._0x001c // LPUART Data Register
#define LPUART7_MATCH  LPUART7_BASE._0x0020 // LPUART Match Address Register
#define LPUART7_MODIR  LPUART7_BASE._0x0024 // LPUART Modem IrDA Register
#define LPUART7_FIFO   LPUART7_BASE._0x0028 // LPUART FIFO Register
#define LPUART7_WATER  LPUART7_BASE._0x002c // LPUART Watermark Register

// LPUART8
#define LPUART8_BASE   MAP_32BIT_REGISTER(0x401a0000)
#define LPUART8_VERID  LPUART8_BASE._0x0000 // Version ID Register
#define LPUART8_PARAM  LPUART8_BASE._0x0004 // Parameter Register
#define LPUART8_GLOBAL LPUART8_BASE._0x0008 // LPUART Global Register
#define LPUART8_PINCFG LPUART8_BASE._0x000c // LPUART Pin Configuration Register
#define LPUART8_BAUD   LPUART8_BASE._0x0010 // LPUART Baud Rate Register
#define LPUART8_STAT   LPUART8_BASE._0x0014 // LPUART Status Register
#define LPUART8_CTRL   LPUART8_BASE._0x0018 // LPUART Control Register
#define LPUART8_DATA   LPUART8_BASE._0x001c // LPUART Data Register
#define LPUART8_MATCH  LPUART8_BASE._0x0020 // LPUART Match Address Register
#define LPUART8_MODIR  LPUART8_BASE._0x0024 // LPUART Modem IrDA Register
#define LPUART8_FIFO   LPUART8_BASE._0x0028 // LPUART FIFO Register
#define LPUART8_WATER  LPUART8_BASE._0x002c // LPUART Watermark Register

/**
 * @brief: FLEXIO, Flexible Input/Output, Memory Map
 * 50.5 p.2853
 *
 * Per each: 180 registers, (12 + (4*12)) = 60 registers per each FLEXIO
 * Number of Pin IO is 2^4 for FlexIO1,
 * 2^5 for FlexIO2 and FlexIO3
 *
 * Base addresses:
 * FlexIO1: 0x401ac000
 * FlexIO2: 0x401b0000
 * FlexIO3: 0x42020000
 **/

// FLEXIO 1
#define FLEXIO1_BASE         MAP_32BIT_REGISTER(0x401ac000)
#define FLEXIO1_VERID        FLEXIO1_BASE._0x0000 // Version ID
#define FLEXIO1_PARAM        FLEXIO1_BASE._0x0004 // Parameter
#define FLEXIO1_CTRL         FLEXIO1_BASE._0x0008 // FlexIO Control
#define FLEXIO1_PIN          FLEXIO1_BASE._0x0000 // hPin State
#define FLEXIO1_SHIFTSTAT    FLEXIO1_BASE._0x0010 // Shifter Status
#define FLEXIO1_SHIFTERR     FLEXIO1_BASE._0x0014 // Shifter Error
#define FLEXIO1_TIMSTAT      FLEXIO1_BASE._0x0018 // Timer Status
#define FLEXIO1_SHIFTSIEN    FLEXIO1_BASE._0x0020 // Shifter Status Intrpt Enable
#define FLEXIO1_SHIFTEIEN    FLEXIO1_BASE._0x0024 // Shifter Error Intrpt Enable
#define FLEXIO1_TIMIEN       FLEXIO1_BASE._0x0028 // Timer Interrupt Enable
#define FLEXIO1_SHIFTSDEN    FLEXIO1_BASE._0x0030 // Shifter Status DMA Enable
#define FLEXIO1_SHIFTSTATE   FLEXIO1_BASE._0x0040 // Shifter State
#define FLEXIO1_SHIFTCTL0    FLEXIO1_BASE._0x0080 // Shifter Control
#define FLEXIO1_SHIFTCTL1    FLEXIO1_BASE._0x0080 // Shifter Control
#define FLEXIO1_SHIFTCTL2    FLEXIO1_BASE._0x0080 // Shifter Control
#define FLEXIO1_SHIFTCTL3    FLEXIO1_BASE._0x0080 // Shifter Control
#define FLEXIO1_SHIFTCFG0    FLEXIO1_BASE._0x0080 // Shifter Conf.
#define FLEXIO1_SHIFTCFG1    FLEXIO1_BASE._0x0080 // Shifter Conf.
#define FLEXIO1_SHIFTCFG2    FLEXIO1_BASE._0x0080 // Shifter Conf.
#define FLEXIO1_SHIFTCFG3    FLEXIO1_BASE._0x0080 // Shifter Conf.
#define FLEXIO1_SHIFTBUF0    FLEXIO1_BASE._0x0080 // Shifter Buffer
#define FLEXIO1_SHIFTBUF1    FLEXIO1_BASE._0x0080 // Shifter Buffer
#define FLEXIO1_SHIFTBUF2    FLEXIO1_BASE._0x0080 // Shifter Buffer
#define FLEXIO1_SHIFTBUF3    FLEXIO1_BASE._0x0080 // Shifter Buffer
#define FLEXIO1_SHIFTBUFBIS0 FLEXIO1_BASE._0x0080 // Shifter bi Swap
#define FLEXIO1_SHIFTBUFBIS1 FLEXIO1_BASE._0x0080 // Shifter bi Swap
#define FLEXIO1_SHIFTBUFBIS2 FLEXIO1_BASE._0x0080 // Shifter bi Swap
#define FLEXIO1_SHIFTBUFBIS3 FLEXIO1_BASE._0x0080 // Shifter bi Swap
#define FLEXIO1_SHIFTBUFBYS0 FLEXIO1_BASE._0x0080 // Shifter By Swap
#define FLEXIO1_SHIFTBUFBYS1 FLEXIO1_BASE._0x0080 // Shifter By Swap
#define FLEXIO1_SHIFTBUFBYS2 FLEXIO1_BASE._0x0080 // Shifter By Swap
#define FLEXIO1_SHIFTBUFBYS3 FLEXIO1_BASE._0x0080 // Shifter By Swap
#define FLEXIO1_SHIFTBUFBBS0 FLEXIO1_BASE._0x0080 // Shifter biBy Swap
#define FLEXIO1_SHIFTBUFBBS1 FLEXIO1_BASE._0x0080 // Shifter biBy Swap
#define FLEXIO1_SHIFTBUFBBS2 FLEXIO1_BASE._0x0080 // Shifter biBy Swap
#define FLEXIO1_SHIFTBUFBBS3 FLEXIO1_BASE._0x0080 // Shifter biBy Swap
#define FLEXIO1_TIMCTL0      FLEXIO1_BASE._0x0080 // Timer Control
#define FLEXIO1_TIMCTL1      FLEXIO1_BASE._0x0080 // Timer Control
#define FLEXIO1_TIMCTL2      FLEXIO1_BASE._0x0080 // Timer Control
#define FLEXIO1_TIMCTL3      FLEXIO1_BASE._0x0080 // Timer Control
#define FLEXIO1_TIMCFG0      FLEXIO1_BASE._0x0080 // Timer Conf.
#define FLEXIO1_TIMCFG1      FLEXIO1_BASE._0x0080 // Timer Conf.
#define FLEXIO1_TIMCFG2      FLEXIO1_BASE._0x0080 // Timer Conf.
#define FLEXIO1_TIMCFG3      FLEXIO1_BASE._0x0080 // Timer Conf.
#define FLEXIO1_TIMCMP0      FLEXIO1_BASE._0x0080 // Timer Comp.
#define FLEXIO1_TIMCMP1      FLEXIO1_BASE._0x0080 // Timer Comp.
#define FLEXIO1_TIMCMP2      FLEXIO1_BASE._0x0080 // Timer Comp.
#define FLEXIO1_TIMCMP3      FLEXIO1_BASE._0x0080 // Timer Comp.
#define FLEXIO1_SHIFTBUFNBS0 FLEXIO1_BASE._0x0080 // Shifter nibble By
#define FLEXIO1_SHIFTBUFNBS1 FLEXIO1_BASE._0x0080 // Shifter nibble By
#define FLEXIO1_SHIFTBUFNBS2 FLEXIO1_BASE._0x0080 // Shifter nibble By
#define FLEXIO1_SHIFTBUFNBS3 FLEXIO1_BASE._0x0080 // Shifter nibble By
#define FLEXIO1_SHIFTBUFHWS0 FLEXIO1_BASE._0x0080 // Shifter nibble Wo
#define FLEXIO1_SHIFTBUFHWS1 FLEXIO1_BASE._0x0080 // Shifter nibble Wo
#define FLEXIO1_SHIFTBUFHWS2 FLEXIO1_BASE._0x0080 // Shifter nibble Wo
#define FLEXIO1_SHIFTBUFHWS3 FLEXIO1_BASE._0x0080 // Shifter nibble Wo
#define FLEXIO1_SHIFTBUFNIS0 FLEXIO1_BASE._0x0080 // Shifter nibble Swapped
#define FLEXIO1_SHIFTBUFNIS1 FLEXIO1_BASE._0x0080 // Shifter nibble Swapped
#define FLEXIO1_SHIFTBUFNIS2 FLEXIO1_BASE._0x0080 // Shifter nibble Swapped
#define FLEXIO1_SHIFTBUFNIS3 FLEXIO1_BASE._0x0080 // Shifter nibble Swapped

// FLEXIO 2
#define FLEXIO2_BASE         MAP_32BIT_REGISTER(0x401ac000)
#define FLEXIO2_VERID        FLEXIO2_BASE._0x0000 // Version ID
#define FLEXIO2_PARAM        FLEXIO2_BASE._0x0004 // Parameter
#define FLEXIO2_CTRL         FLEXIO2_BASE._0x0008 // FlexIO Control
#define FLEXIO2_PIN          FLEXIO2_BASE._0x0000 // hPin State
#define FLEXIO2_SHIFTSTAT    FLEXIO2_BASE._0x0010 // Shifter Status
#define FLEXIO2_SHIFTERR     FLEXIO2_BASE._0x0014 // Shifter Error
#define FLEXIO2_TIMSTAT      FLEXIO2_BASE._0x0018 // Timer Status
#define FLEXIO2_SHIFTSIEN    FLEXIO2_BASE._0x0020 // Shifter Status Intrpt Enable
#define FLEXIO2_SHIFTEIEN    FLEXIO2_BASE._0x0024 // Shifter Error Intrpt Enable
#define FLEXIO2_TIMIEN       FLEXIO2_BASE._0x0028 // Timer Interrupt Enable
#define FLEXIO2_SHIFTSDEN    FLEXIO2_BASE._0x0030 // Shifter Status DMA Enable
#define FLEXIO2_SHIFTSTATE   FLEXIO2_BASE._0x0040 // Shifter State
#define FLEXIO2_SHIFTCTL0    FLEXIO2_BASE._0x0080 // Shifter Control
#define FLEXIO2_SHIFTCTL1    FLEXIO2_BASE._0x0080 // Shifter Control
#define FLEXIO2_SHIFTCTL2    FLEXIO2_BASE._0x0080 // Shifter Control
#define FLEXIO2_SHIFTCTL3    FLEXIO2_BASE._0x0080 // Shifter Control
#define FLEXIO2_SHIFTCFG0    FLEXIO2_BASE._0x0080 // Shifter Conf.
#define FLEXIO2_SHIFTCFG1    FLEXIO2_BASE._0x0080 // Shifter Conf.
#define FLEXIO2_SHIFTCFG2    FLEXIO2_BASE._0x0080 // Shifter Conf.
#define FLEXIO2_SHIFTCFG3    FLEXIO2_BASE._0x0080 // Shifter Conf.
#define FLEXIO2_SHIFTBUF0    FLEXIO2_BASE._0x0080 // Shifter Buffer
#define FLEXIO2_SHIFTBUF1    FLEXIO2_BASE._0x0080 // Shifter Buffer
#define FLEXIO2_SHIFTBUF2    FLEXIO2_BASE._0x0080 // Shifter Buffer
#define FLEXIO2_SHIFTBUF3    FLEXIO2_BASE._0x0080 // Shifter Buffer
#define FLEXIO2_SHIFTBUFBIS0 FLEXIO2_BASE._0x0080 // Shifter bi Swap
#define FLEXIO2_SHIFTBUFBIS1 FLEXIO2_BASE._0x0080 // Shifter bi Swap
#define FLEXIO2_SHIFTBUFBIS2 FLEXIO2_BASE._0x0080 // Shifter bi Swap
#define FLEXIO2_SHIFTBUFBIS3 FLEXIO2_BASE._0x0080 // Shifter bi Swap
#define FLEXIO2_SHIFTBUFBYS0 FLEXIO2_BASE._0x0080 // Shifter By Swap
#define FLEXIO2_SHIFTBUFBYS1 FLEXIO2_BASE._0x0080 // Shifter By Swap
#define FLEXIO2_SHIFTBUFBYS2 FLEXIO2_BASE._0x0080 // Shifter By Swap
#define FLEXIO2_SHIFTBUFBYS3 FLEXIO2_BASE._0x0080 // Shifter By Swap
#define FLEXIO2_SHIFTBUFBBS0 FLEXIO2_BASE._0x0080 // Shifter biBy Swap
#define FLEXIO2_SHIFTBUFBBS1 FLEXIO2_BASE._0x0080 // Shifter biBy Swap
#define FLEXIO2_SHIFTBUFBBS2 FLEXIO2_BASE._0x0080 // Shifter biBy Swap
#define FLEXIO2_SHIFTBUFBBS3 FLEXIO2_BASE._0x0080 // Shifter biBy Swap
#define FLEXIO2_TIMCTL0      FLEXIO2_BASE._0x0080 // Timer Control
#define FLEXIO2_TIMCTL1      FLEXIO2_BASE._0x0080 // Timer Control
#define FLEXIO2_TIMCTL2      FLEXIO2_BASE._0x0080 // Timer Control
#define FLEXIO2_TIMCTL3      FLEXIO2_BASE._0x0080 // Timer Control
#define FLEXIO2_TIMCFG0      FLEXIO2_BASE._0x0080 // Timer Conf.
#define FLEXIO2_TIMCFG1      FLEXIO2_BASE._0x0080 // Timer Conf.
#define FLEXIO2_TIMCFG2      FLEXIO2_BASE._0x0080 // Timer Conf.
#define FLEXIO2_TIMCFG3      FLEXIO2_BASE._0x0080 // Timer Conf.
#define FLEXIO2_TIMCMP0      FLEXIO2_BASE._0x0080 // Timer Comp.
#define FLEXIO2_TIMCMP1      FLEXIO2_BASE._0x0080 // Timer Comp.
#define FLEXIO2_TIMCMP2      FLEXIO2_BASE._0x0080 // Timer Comp.
#define FLEXIO2_TIMCMP3      FLEXIO2_BASE._0x0080 // Timer Comp.
#define FLEXIO2_SHIFTBUFNBS0 FLEXIO2_BASE._0x0080 // Shifter nibble By
#define FLEXIO2_SHIFTBUFNBS1 FLEXIO2_BASE._0x0080 // Shifter nibble By
#define FLEXIO2_SHIFTBUFNBS2 FLEXIO2_BASE._0x0080 // Shifter nibble By
#define FLEXIO2_SHIFTBUFNBS3 FLEXIO2_BASE._0x0080 // Shifter nibble By
#define FLEXIO2_SHIFTBUFHWS0 FLEXIO2_BASE._0x0080 // Shifter nibble Wo
#define FLEXIO2_SHIFTBUFHWS1 FLEXIO2_BASE._0x0080 // Shifter nibble Wo
#define FLEXIO2_SHIFTBUFHWS2 FLEXIO2_BASE._0x0080 // Shifter nibble Wo
#define FLEXIO2_SHIFTBUFHWS3 FLEXIO2_BASE._0x0080 // Shifter nibble Wo
#define FLEXIO2_SHIFTBUFNIS0 FLEXIO2_BASE._0x0080 // Shifter nibble Swapped
#define FLEXIO2_SHIFTBUFNIS1 FLEXIO2_BASE._0x0080 // Shifter nibble Swapped
#define FLEXIO2_SHIFTBUFNIS2 FLEXIO2_BASE._0x0080 // Shifter nibble Swapped
#define FLEXIO2_SHIFTBUFNIS3 FLEXIO2_BASE._0x0080 // Shifter nibble Swapped

// FLEXIO 3
#define FLEXIO3_BASE         MAP_32BIT_REGISTER(0x401ac000)
#define FLEXIO3_VERID        FLEXIO3_BASE._0x0000 // Version ID
#define FLEXIO3_PARAM        FLEXIO3_BASE._0x0004 // Parameter
#define FLEXIO3_CTRL         FLEXIO3_BASE._0x0008 // FlexIO Control
#define FLEXIO3_PIN          FLEXIO3_BASE._0x0000 // hPin State
#define FLEXIO3_SHIFTSTAT    FLEXIO3_BASE._0x0010 // Shifter Status
#define FLEXIO3_SHIFTERR     FLEXIO3_BASE._0x0014 // Shifter Error
#define FLEXIO3_TIMSTAT      FLEXIO3_BASE._0x0018 // Timer Status
#define FLEXIO3_SHIFTSIEN    FLEXIO3_BASE._0x0020 // Shifter Status Intrpt Enable
#define FLEXIO3_SHIFTEIEN    FLEXIO3_BASE._0x0024 // Shifter Error Intrpt Enable
#define FLEXIO3_TIMIEN       FLEXIO3_BASE._0x0028 // Timer Interrupt Enable
#define FLEXIO3_SHIFTSDEN    FLEXIO3_BASE._0x0030 // Shifter Status DMA Enable
#define FLEXIO3_SHIFTSTATE   FLEXIO3_BASE._0x0040 // Shifter State
#define FLEXIO3_SHIFTCTL0    FLEXIO3_BASE._0x0080 // Shifter Control
#define FLEXIO3_SHIFTCTL1    FLEXIO3_BASE._0x0080 // Shifter Control
#define FLEXIO3_SHIFTCTL2    FLEXIO3_BASE._0x0080 // Shifter Control
#define FLEXIO3_SHIFTCTL3    FLEXIO3_BASE._0x0080 // Shifter Control
#define FLEXIO3_SHIFTCFG0    FLEXIO3_BASE._0x0080 // Shifter Conf.
#define FLEXIO3_SHIFTCFG1    FLEXIO3_BASE._0x0080 // Shifter Conf.
#define FLEXIO3_SHIFTCFG2    FLEXIO3_BASE._0x0080 // Shifter Conf.
#define FLEXIO3_SHIFTCFG3    FLEXIO3_BASE._0x0080 // Shifter Conf.
#define FLEXIO3_SHIFTBUF0    FLEXIO3_BASE._0x0080 // Shifter Buffer
#define FLEXIO3_SHIFTBUF1    FLEXIO3_BASE._0x0080 // Shifter Buffer
#define FLEXIO3_SHIFTBUF2    FLEXIO3_BASE._0x0080 // Shifter Buffer
#define FLEXIO3_SHIFTBUF3    FLEXIO3_BASE._0x0080 // Shifter Buffer
#define FLEXIO3_SHIFTBUFBIS0 FLEXIO3_BASE._0x0080 // Shifter bi Swap
#define FLEXIO3_SHIFTBUFBIS1 FLEXIO3_BASE._0x0080 // Shifter bi Swap
#define FLEXIO3_SHIFTBUFBIS2 FLEXIO3_BASE._0x0080 // Shifter bi Swap
#define FLEXIO3_SHIFTBUFBIS3 FLEXIO3_BASE._0x0080 // Shifter bi Swap
#define FLEXIO3_SHIFTBUFBYS0 FLEXIO3_BASE._0x0080 // Shifter By Swap
#define FLEXIO3_SHIFTBUFBYS1 FLEXIO3_BASE._0x0080 // Shifter By Swap
#define FLEXIO3_SHIFTBUFBYS2 FLEXIO3_BASE._0x0080 // Shifter By Swap
#define FLEXIO3_SHIFTBUFBYS3 FLEXIO3_BASE._0x0080 // Shifter By Swap
#define FLEXIO3_SHIFTBUFBBS0 FLEXIO3_BASE._0x0080 // Shifter biBy Swap
#define FLEXIO3_SHIFTBUFBBS1 FLEXIO3_BASE._0x0080 // Shifter biBy Swap
#define FLEXIO3_SHIFTBUFBBS2 FLEXIO3_BASE._0x0080 // Shifter biBy Swap
#define FLEXIO3_SHIFTBUFBBS3 FLEXIO3_BASE._0x0080 // Shifter biBy Swap
#define FLEXIO3_TIMCTL0      FLEXIO3_BASE._0x0080 // Timer Control
#define FLEXIO3_TIMCTL1      FLEXIO3_BASE._0x0080 // Timer Control
#define FLEXIO3_TIMCTL2      FLEXIO3_BASE._0x0080 // Timer Control
#define FLEXIO3_TIMCTL3      FLEXIO3_BASE._0x0080 // Timer Control
#define FLEXIO3_TIMCFG0      FLEXIO3_BASE._0x0080 // Timer Conf.
#define FLEXIO3_TIMCFG1      FLEXIO3_BASE._0x0080 // Timer Conf.
#define FLEXIO3_TIMCFG2      FLEXIO3_BASE._0x0080 // Timer Conf.
#define FLEXIO3_TIMCFG3      FLEXIO3_BASE._0x0080 // Timer Conf.
#define FLEXIO3_TIMCMP0      FLEXIO3_BASE._0x0080 // Timer Comp.
#define FLEXIO3_TIMCMP1      FLEXIO3_BASE._0x0080 // Timer Comp.
#define FLEXIO3_TIMCMP2      FLEXIO3_BASE._0x0080 // Timer Comp.
#define FLEXIO3_TIMCMP3      FLEXIO3_BASE._0x0080 // Timer Comp.
#define FLEXIO3_SHIFTBUFNBS0 FLEXIO3_BASE._0x0080 // Shifter nibble By
#define FLEXIO3_SHIFTBUFNBS1 FLEXIO3_BASE._0x0080 // Shifter nibble By
#define FLEXIO3_SHIFTBUFNBS2 FLEXIO3_BASE._0x0080 // Shifter nibble By
#define FLEXIO3_SHIFTBUFNBS3 FLEXIO3_BASE._0x0080 // Shifter nibble By
#define FLEXIO3_SHIFTBUFHWS0 FLEXIO3_BASE._0x0080 // Shifter nibble Wo
#define FLEXIO3_SHIFTBUFHWS1 FLEXIO3_BASE._0x0080 // Shifter nibble Wo
#define FLEXIO3_SHIFTBUFHWS2 FLEXIO3_BASE._0x0080 // Shifter nibble Wo
#define FLEXIO3_SHIFTBUFHWS3 FLEXIO3_BASE._0x0080 // Shifter nibble Wo
#define FLEXIO3_SHIFTBUFNIS0 FLEXIO3_BASE._0x0080 // Shifter nibble Swapped
#define FLEXIO3_SHIFTBUFNIS1 FLEXIO3_BASE._0x0080 // Shifter nibble Swapped
#define FLEXIO3_SHIFTBUFNIS2 FLEXIO3_BASE._0x0080 // Shifter nibble Swapped
#define FLEXIO3_SHIFTBUFNIS3 FLEXIO3_BASE._0x0080 // Shifter nibble Swapped

/**
 * @brief: GPT, General Purpose Timers, Memory Map/Register
 * 52.7 p.2957
 *
 **/
#define GPT_BASE0 MAP_32BIT_REGISTER(0x401ec000)
#define GPT1_CR   GPT_BASE0._0x0000 // Control Register
#define GPT1_PR   GPT_BASE0._0x0004 // Prescaler Register
#define GPT1_SR   GPT_BASE0._0x0008 // Status Register
#define GPT1_IR   GPT_BASE0._0x000c // Interrupt Register
#define GPT1_OCR1 GPT_BASE0._0x0010 // Output Compare Register 1
#define GPT1_OCR2 GPT_BASE0._0x0014 // Output Compare Register 2
#define GPT1_OCR3 GPT_BASE0._0x0018 // Output Compare Register 3
#define GPT1_ICR1 GPT_BASE0._0x001c // Input Capture Register 1
#define GPT1_ICR2 GPT_BASE0._0x0020 // Input Capture Register 2
#define GPT1_CNT  GPT_BASE0._0x0024 // Counter Register

#define GPT_BASE1 MAP_32BIT_REGISTER(0x401f0000)
#define GPT2_CR   GPT_BASE1._0x0000 // Control Register
#define GPT2_PR   GPT_BASE1._0x0004 // Prescaler Register
#define GPT2_SR   GPT_BASE1._0x0008 // Status Register
#define GPT2_IR   GPT_BASE1._0x000c // Interrupt Register
#define GPT2_OCR1 GPT_BASE1._0x0010 // Output Compare Register 1
#define GPT2_OCR2 GPT_BASE1._0x0014 // Output Compare Register 2
#define GPT2_OCR3 GPT_BASE1._0x0018 // Output Compare Register 3
#define GPT2_ICR1 GPT_BASE1._0x001c // Input Capture Register 1
#define GPT2_ICR2 GPT_BASE1._0x0020 // Input Capture Register 2
#define GPT2_CNT  GPT_BASE1._0x0024 // Counter Register

/**
 * @brief: PIT, Periodic Interrupt Timer, Memory Map/Register
 * 53.9 p.2978
 *
 * Base address:
 * PIT : 0x40084000
 *
 **/

#define PIT_BASE    MAP_32BIT_REGISTER(0x40084000)
#define PIT_MCR     PIT_BASE._0x0000 // Module Control Register
#define PIT_LTMR64H PIT_BASE._0x00e0 // Upper Lifetime Timer Register
#define PIT_LTMR64L PIT_BASE._0x00e4 // Lower Lifetime Timer Register
#define PIT_LDVAL0  PIT_BASE._0x0100 // Timer Load Value Register
#define PIT_LDVAL1  PIT_BASE._0x0110 // Timer Load Value Register
#define PIT_LDVAL2  PIT_BASE._0x0120 // Timer Load Value Register
#define PIT_LDVAL3  PIT_BASE._0x0130 // Timer Load Value Register
#define PIT_CVAL0   PIT_BASE._0x0104 // Current Timer Value Register
#define PIT_CVAL1   PIT_BASE._0x0114 // Current Timer Value Register
#define PIT_CVAL2   PIT_BASE._0x0124 // Current Timer Value Register
#define PIT_CVAL3   PIT_BASE._0x0134 // Current Timer Value Register
#define PIT_TCTRL0  PIT_BASE._0x0108 // Timer Control Register
#define PIT_TCTRL1  PIT_BASE._0x0118 // Timer Control Register
#define PIT_TCTRL2  PIT_BASE._0x0128 // Timer Control Register
#define PIT_TCTRL3  PIT_BASE._0x0138 // Timer Control Register
#define PIT_TFLG0   PIT_BASE._0x010c // Timer Flag Register
#define PIT_TFLG1   PIT_BASE._0x011c // Timer Flag Register
#define PIT_TFLG2   PIT_BASE._0x012c // Timer Flag Register
#define PIT_TFLG3   PIT_BASE._0x013c // Timer Flag Register

