AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
/**
 * @brief: TMR, Quad Timer, Memory Map/Register
 * 54.6 p.2990
 *
 * Base address:
 * TMR : 0x401dc000
 *
 **/
#define TMR1_BASE     MAP_16BIT_REGISTER(0x401dc000)
#define TMR1_COMP1_0  TMR1_BASE._0x0000
#define TMR1_COMP2_0  TMR1_BASE._0x0002
#define TMR1_CAPT_0   TMR1_BASE._0x0004
#define TMR1_LOAD_0   TMR1_BASE._0x0006
#define TMR1_HOLD_0   TMR1_BASE._0x0008
#define TMR1_CNTR_0   TMR1_BASE._0x000a
#define TMR1_CTRL_0   TMR1_BASE._0x000c
#define TMR1_SCTRL_0  TMR1_BASE._0x000e
#define TMR1_CMPLD1_0 TMR1_BASE._0x0010
#define TMR1_CMPLD2_0 TMR1_BASE._0x0012
#define TMR1_CSCTRL_0 TMR1_BASE._0x0014
#define TMR1_FILT_0   TMR1_BASE._0x0016
#define TMR1_DMA_0    TMR1_BASE._0x0018
#define TMR1_ENBL     TMR1_BASE._0x001e
#define TMR1_COMP1_1  TMR1_BASE._0x0020
#define TMR1_COMP2_1  TMR1_BASE._0x0022
#define TMR1_CAPT_1   TMR1_BASE._0x0024
#define TMR1_LOAD_1   TMR1_BASE._0x0026
#define TMR1_HOLD_1   TMR1_BASE._0x0028
#define TMR1_CNTR_1   TMR1_BASE._0x002a
#define TMR1_CTRL_1   TMR1_BASE._0x002c
#define TMR1_SCTRL_1  TMR1_BASE._0x002e
#define TMR1_CMPLD1_1 TMR1_BASE._0x0030
#define TMR1_CMPLD2_1 TMR1_BASE._0x0032
#define TMR1_CSCTRL_1 TMR1_BASE._0x0034
#define TMR1_FILT_1   TMR1_BASE._0x0036
#define TMR1_DMA_1    TMR1_BASE._0x0038
#define TMR1_COMP1_2  TMR1_BASE._0x0040
#define TMR1_COMP2_2  TMR1_BASE._0x0042
#define TMR1_CAPT_2   TMR1_BASE._0x0044
#define TMR1_LOAD_2   TMR1_BASE._0x0046
#define TMR1_HOLD_2   TMR1_BASE._0x0048
#define TMR1_CNTR_2   TMR1_BASE._0x004a
#define TMR1_CTRL_2   TMR1_BASE._0x004c
#define TMR1_SCTRL_2  TMR1_BASE._0x004e
#define TMR1_CMPLD1_2 TMR1_BASE._0x0050
#define TMR1_CMPLD2_2 TMR1_BASE._0x0052
#define TMR1_CSCTRL_2 TMR1_BASE._0x0054
#define TMR1_FILT_2   TMR1_BASE._0x0056
#define TMR1_DMA_2    TMR1_BASE._0x0058
#define TMR1_COMP1_3  TMR1_BASE._0x0060
#define TMR1_COMP2_3  TMR1_BASE._0x0062
#define TMR1_CAPT_3   TMR1_BASE._0x0064
#define TMR1_LOAD_3   TMR1_BASE._0x0066
#define TMR1_HOLD_3   TMR1_BASE._0x0068
#define TMR1_CNTR_3   TMR1_BASE._0x006a
#define TMR1_CTRL_3   TMR1_BASE._0x006c
#define TMR1_SCTRL_3  TMR1_BASE._0x006e
#define TMR1_CMPLD1_3 TMR1_BASE._0x0070
#define TMR1_CMPLD2_3 TMR1_BASE._0x0072
#define TMR1_CSCTRL_3 TMR1_BASE._0x0074
#define TMR1_FILT_3   TMR1_BASE._0x0076
#define TMR1_DMA_3    TMR1_BASE._0x0078

#define TMR2_BASE     MAP_16BIT_REGISTER(0x401e0000)
#define TMR2_COMP1_0  TMR1_BASE._0x40000
#define TMR2_COMP2_0  TMR1_BASE._0x40002
#define TMR2_CAPT_0   TMR1_BASE._0x40004
#define TMR2_LOAD_0   TMR1_BASE._0x40006
#define TMR2_HOLD_0   TMR1_BASE._0x40008
#define TMR2_CNTR_0   TMR1_BASE._0x4000a
#define TMR2_CTRL_0   TMR1_BASE._0x4000c
#define TMR2_SCTRL_0  TMR1_BASE._0x4000e
#define TMR2_CMPLD1_0 TMR1_BASE._0x40010
#define TMR2_CMPLD2_0 TMR1_BASE._0x40012
#define TMR2_CSCTRL_0 TMR1_BASE._0x40014
#define TMR2_FILT_0   TMR1_BASE._0x40016
#define TMR2_DMA_0    TMR1_BASE._0x40018
#define TMR2_ENBL     TMR1_BASE._0x4001e
#define TMR2_COMP1_1  TMR1_BASE._0x40020
#define TMR2_COMP2_1  TMR1_BASE._0x40022
#define TMR2_CAPT_1   TMR1_BASE._0x40024
#define TMR2_LOAD_1   TMR1_BASE._0x40026
#define TMR2_HOLD_1   TMR1_BASE._0x40028
#define TMR2_CNTR_1   TMR1_BASE._0x4002a
#define TMR2_CTRL_1   TMR1_BASE._0x4002c
#define TMR2_SCTRL_1  TMR1_BASE._0x4002e
#define TMR2_CMPLD1_1 TMR1_BASE._0x40030
#define TMR2_CMPLD2_1 TMR1_BASE._0x40032
#define TMR2_CSCTRL_1 TMR1_BASE._0x40034
#define TMR2_FILT_1   TMR1_BASE._0x40036
#define TMR2_DMA_1    TMR1_BASE._0x40038
#define TMR2_COMP1_2  TMR1_BASE._0x40040
#define TMR2_COMP2_2  TMR1_BASE._0x40042
#define TMR2_CAPT_2   TMR1_BASE._0x40044
#define TMR2_LOAD_2   TMR1_BASE._0x40046
#define TMR2_HOLD_2   TMR1_BASE._0x40048
#define TMR2_CNTR_2   TMR1_BASE._0x4004a
#define TMR2_CTRL_2   TMR1_BASE._0x4004c
#define TMR2_SCTRL_2  TMR1_BASE._0x4004e
#define TMR2_CMPLD1_2 TMR1_BASE._0x40050
#define TMR2_CMPLD2_2 TMR1_BASE._0x40052
#define TMR2_CSCTRL_2 TMR1_BASE._0x40054
#define TMR2_FILT_2   TMR1_BASE._0x40056
#define TMR2_DMA_2    TMR1_BASE._0x40058
#define TMR2_COMP1_3  TMR1_BASE._0x40060
#define TMR2_COMP2_3  TMR1_BASE._0x40062
#define TMR2_CAPT_3   TMR1_BASE._0x40064
#define TMR2_LOAD_3   TMR1_BASE._0x40066
#define TMR2_HOLD_3   TMR1_BASE._0x40068
#define TMR2_CNTR_3   TMR1_BASE._0x4006a
#define TMR2_CTRL_3   TMR1_BASE._0x4006c
#define TMR2_SCTRL_3  TMR1_BASE._0x4006e
#define TMR2_CMPLD1_3 TMR1_BASE._0x40070
#define TMR2_CMPLD2_3 TMR1_BASE._0x40072
#define TMR2_CSCTRL_3 TMR1_BASE._0x40074
#define TMR2_FILT_3   TMR1_BASE._0x40076
#define TMR2_DMA_3    TMR1_BASE._0x40078

#define TMR3_BASE     MAP_16BIT_REGISTER(0x401e4000)
#define TMR3_COMP1_0  TMR1_BASE._0x0000
#define TMR3_COMP2_0  TMR1_BASE._0x0002
#define TMR3_CAPT_0   TMR1_BASE._0x0004
#define TMR3_LOAD_0   TMR1_BASE._0x0006
#define TMR3_HOLD_0   TMR1_BASE._0x0008
#define TMR3_CNTR_0   TMR1_BASE._0x000a
#define TMR3_CTRL_0   TMR1_BASE._0x000c
#define TMR3_SCTRL_0  TMR1_BASE._0x000e
#define TMR3_CMPLD1_0 TMR1_BASE._0x0010
#define TMR3_CMPLD2_0 TMR1_BASE._0x0012
#define TMR3_CSCTRL_0 TMR1_BASE._0x0014
#define TMR3_FILT_0   TMR1_BASE._0x0016
#define TMR3_DMA_0    TMR1_BASE._0x0018
#define TMR3_ENBL     TMR1_BASE._0x001e
#define TMR3_COMP1_1  TMR1_BASE._0x0020
#define TMR3_COMP2_1  TMR1_BASE._0x0022
#define TMR3_CAPT_1   TMR1_BASE._0x0024
#define TMR3_LOAD_1   TMR1_BASE._0x0026
#define TMR3_HOLD_1   TMR1_BASE._0x0028
#define TMR3_CNTR_1   TMR1_BASE._0x002a
#define TMR3_CTRL_1   TMR1_BASE._0x002c
#define TMR3_SCTRL_1  TMR1_BASE._0x002e
#define TMR3_CMPLD1_1 TMR1_BASE._0x0030
#define TMR3_CMPLD2_1 TMR1_BASE._0x0032
#define TMR3_CSCTRL_1 TMR1_BASE._0x0034
#define TMR3_FILT_1   TMR1_BASE._0x0036
#define TMR3_DMA_1    TMR1_BASE._0x0038
#define TMR3_COMP1_2  TMR1_BASE._0x0040
#define TMR3_COMP2_2  TMR1_BASE._0x0042
#define TMR3_CAPT_2   TMR1_BASE._0x0044
#define TMR3_LOAD_2   TMR1_BASE._0x0046
#define TMR3_HOLD_2   TMR1_BASE._0x0048
#define TMR3_CNTR_2   TMR1_BASE._0x004a
#define TMR3_CTRL_2   TMR1_BASE._0x004c
#define TMR3_SCTRL_2  TMR1_BASE._0x004e
#define TMR3_CMPLD1_2 TMR1_BASE._0x0050
#define TMR3_CMPLD2_2 TMR1_BASE._0x0052
#define TMR3_CSCTRL_2 TMR1_BASE._0x0054
#define TMR3_FILT_2   TMR1_BASE._0x0056
#define TMR3_DMA_2    TMR1_BASE._0x0058
#define TMR3_COMP1_3  TMR1_BASE._0x0060
#define TMR3_COMP2_3  TMR1_BASE._0x0062
#define TMR3_CAPT_3   TMR1_BASE._0x0064
#define TMR3_LOAD_3   TMR1_BASE._0x0066
#define TMR3_HOLD_3   TMR1_BASE._0x0068
#define TMR3_CNTR_3   TMR1_BASE._0x006a
#define TMR3_CTRL_3   TMR1_BASE._0x006c
#define TMR3_SCTRL_3  TMR1_BASE._0x006e
#define TMR3_CMPLD1_3 TMR1_BASE._0x0070
#define TMR3_CMPLD2_3 TMR1_BASE._0x0072
#define TMR3_CSCTRL_3 TMR1_BASE._0x0074
#define TMR3_FILT_3   TMR1_BASE._0x0076
#define TMR3_DMA_3    TMR1_BASE._0x0078

#define TMR4_BASE     MAP_16BIT_REGISTER(0x401e8000)
#define TMR4_COMP1_0  TMR4_BASE._0x0000
#define TMR4_COMP2_0  TMR4_BASE._0x0002
#define TMR4_CAPT_0   TMR4_BASE._0x0004
#define TMR4_LOAD_0   TMR4_BASE._0x0006
#define TMR4_HOLD_0   TMR4_BASE._0x0008
#define TMR4_CNTR_0   TMR4_BASE._0x000a
#define TMR4_CTRL_0   TMR4_BASE._0x000c
#define TMR4_SCTRL_0  TMR4_BASE._0x000e
#define TMR4_CMPLD1_0 TMR4_BASE._0x0010
#define TMR4_CMPLD2_0 TMR4_BASE._0x0012
#define TMR4_CSCTRL_0 TMR4_BASE._0x0014
#define TMR4_FILT_0   TMR4_BASE._0x0016
#define TMR4_DMA_0    TMR4_BASE._0x0018
#define TMR4_ENBL     TMR4_BASE._0x001e
#define TMR4_COMP1_1  TMR4_BASE._0x0020
#define TMR4_COMP2_1  TMR4_BASE._0x0022
#define TMR4_CAPT_1   TMR4_BASE._0x0024
#define TMR4_LOAD_1   TMR4_BASE._0x0026
#define TMR4_HOLD_1   TMR4_BASE._0x0028
#define TMR4_CNTR_1   TMR4_BASE._0x002a
#define TMR4_CTRL_1   TMR4_BASE._0x002c
#define TMR4_SCTRL_1  TMR4_BASE._0x002e
#define TMR4_CMPLD1_1 TMR4_BASE._0x0030
#define TMR4_CMPLD2_1 TMR4_BASE._0x0032
#define TMR4_CSCTRL_1 TMR4_BASE._0x0034
#define TMR4_FILT_1   TMR4_BASE._0x0036
#define TMR4_DMA_1    TMR4_BASE._0x0038
#define TMR4_COMP1_2  TMR4_BASE._0x0040
#define TMR4_COMP2_2  TMR4_BASE._0x0042
#define TMR4_CAPT_2   TMR4_BASE._0x0044
#define TMR4_LOAD_2   TMR4_BASE._0x0046
#define TMR4_HOLD_2   TMR4_BASE._0x0048
#define TMR4_CNTR_2   TMR4_BASE._0x004a
#define TMR4_CTRL_2   TMR4_BASE._0x004c
#define TMR4_SCTRL_2  TMR4_BASE._0x004e
#define TMR4_CMPLD1_2 TMR4_BASE._0x0050
#define TMR4_CMPLD2_2 TMR4_BASE._0x0052
#define TMR4_CSCTRL_2 TMR4_BASE._0x0054
#define TMR4_FILT_2   TMR4_BASE._0x0056
#define TMR4_DMA_2    TMR4_BASE._0x0058
#define TMR4_COMP1_3  TMR4_BASE._0x0060
#define TMR4_COMP2_3  TMR4_BASE._0x0062
#define TMR4_CAPT_3   TMR4_BASE._0x0064
#define TMR4_LOAD_3   TMR4_BASE._0x0066
#define TMR4_HOLD_3   TMR4_BASE._0x0068
#define TMR4_CNTR_3   TMR4_BASE._0x006a
#define TMR4_CTRL_3   TMR4_BASE._0x006C
#define TMR4_SCTRL_3  TMR4_BASE._0x006e
#define TMR4_CMPLD1_3 TMR4_BASE._0x0070
#define TMR4_CMPLD2_3 TMR4_BASE._0x0072
#define TMR4_CSCTRL_3 TMR4_BASE._0x0074
#define TMR4_FILT_3   TMR4_BASE._0x0076
#define TMR4_DMA_3    TMR4_BASE._0x0078

/**
 * @brief: PWM, Enhanced Flex Pulse Widh Modulator (eFlexPWM), Memory
 *Map/Register 55.8.1, p.3074
 *
 * Base addresses:
 * FlexPWM1: 0x403dc000
 * FlexPWM2: 0x403e0000
 * FlexPWM3: 0x403e4000
 * FlexPWM4: 0x403e8000
 *
 * NOTE: PWM_X only applicable to FlexPWM1,
 * while FlexPWM2/3/4do not have the PWMX outputs or inputs.
 *
 **/

// FlexPWM1
#define PWM1_BASE         MAP_16BIT_REGISTER(0x403dc000)
#define PWM1_SM0CNT       PWM1_BASE._0x0000
#define PWM1_SM0INIT      PWM1_BASE._0x0002
#define PWM1_SM0CTRL2     PWM1_BASE._0x0004
#define PWM1_SM0CTRL      PWM1_BASE._0x0006
#define PWM1_SM0VAL0      PWM1_BASE._0x000A
#define PWM1_SM0FRACVAL1  PWM1_BASE._0x000C
#define PWM1_SM0VAL1      PWM1_BASE._0x000E
#define PWM1_SM0FRACVAL2  PWM1_BASE._0x0010
#define PWM1_SM0VAL2      PWM1_BASE._0x0012
#define PWM1_SM0FRACVAL3  PWM1_BASE._0x0014
#define PWM1_SM0VAL3      PWM1_BASE._0x0016
#define PWM1_SM0FRACVAL4  PWM1_BASE._0x0018
#define PWM1_SM0VAL4      PWM1_BASE._0x001A
#define PWM1_SM0FRACVAL5  PWM1_BASE._0x001C
#define PWM1_SM0VAL5      PWM1_BASE._0x001E
#define PWM1_SM0FRCTRL    PWM1_BASE._0x0020
#define PWM1_SM0OCTRL     PWM1_BASE._0x0022
#define PWM1_SM0STS       PWM1_BASE._0x0024
#define PWM1_SM0INTEN     PWM1_BASE._0x0026
#define PWM1_SM0DMAEN     PWM1_BASE._0x0028
#define PWM1_SM0TCTRL     PWM1_BASE._0x002A
#define PWM1_SM0DISMAP0   PWM1_BASE._0x002C
#define PWM1_SM0DISMAP1   PWM1_BASE._0x002E
#define PWM1_SM0DTCNT0    PWM1_BASE._0x0030
#define PWM1_SM0DTCNT1    PWM1_BASE._0x0032
#define PWM1_SM0CAPTCTRLA PWM1_BASE._0x0034
#define PWM1_SM0CAPTCOMPA PWM1_BASE._0x0036
#define PWM1_SM0CAPTCTRLB PWM1_BASE._0x0038
#define PWM1_SM0CAPTCOMPB PWM1_BASE._0x003A
#define PWM1_SM0CAPTCTRLX PWM1_BASE._0x003C
#define PWM1_SM0CAPTCOMPX PWM1_BASE._0x003E
#define PWM1_SM0CVAL0     PWM1_BASE._0x0040
#define PWM1_SM0CVAL0CYC  PWM1_BASE._0x0042
#define PWM1_SM0CVAL1     PWM1_BASE._0x0044
#define PWM1_SM0CVAL1CYC  PWM1_BASE._0x0046
#define PWM1_SM0CVAL2     PWM1_BASE._0x0048
#define PWM1_SM0CVAL2CYC  PWM1_BASE._0x004A
#define PWM1_SM0CVAL3     PWM1_BASE._0x004C
#define PWM1_SM0CVAL3CYC  PWM1_BASE._0x004E
#define PWM1_SM0CVAL4     PWM1_BASE._0x0050
#define PWM1_SM0CVAL4CYC  PWM1_BASE._0x0052
#define PWM1_SM0CVAL5     PWM1_BASE._0x0054
#define PWM1_SM0CVAL5CYC  PWM1_BASE._0x0056
#define PWM1_SM1CNT       PWM1_BASE._0x0060
#define PWM1_SM1INIT      PWM1_BASE._0x0062
#define PWM1_SM1CTRL2     PWM1_BASE._0x0064
#define PWM1_SM1CTRL      PWM1_BASE._0x0066
#define PWM1_SM1VAL0      PWM1_BASE._0x006A
#define PWM1_SM1FRACVAL1  PWM1_BASE._0x006C
#define PWM1_SM1VAL1      PWM1_BASE._0x006E
#define PWM1_SM1FRACVAL2  PWM1_BASE._0x0070
#define PWM1_SM1VAL2      PWM1_BASE._0x0072
#define PWM1_SM1FRACVAL3  PWM1_BASE._0x0074
#define PWM1_SM1VAL3      PWM1_BASE._0x0076
#define PWM1_SM1FRACVAL4  PWM1_BASE._0x0078
#define PWM1_SM1VAL4      PWM1_BASE._0x007A
#define PWM1_SM1FRACVAL5  PWM1_BASE._0x007C
#define PWM1_SM1VAL5      PWM1_BASE._0x007E
#define PWM1_SM1FRCTRL    PWM1_BASE._0x0080
#define PWM1_SM1OCTRL     PWM1_BASE._0x0082
#define PWM1_SM1STS       PWM1_BASE._0x0084
#define PWM1_SM1INTEN     PWM1_BASE._0x0086
#define PWM1_SM1DMAEN     PWM1_BASE._0x0088
#define PWM1_SM1TCTRL     PWM1_BASE._0x008A
#define PWM1_SM1DISMAP0   PWM1_BASE._0x008C
#define PWM1_SM1DISMAP1   PWM1_BASE._0x008E
#define PWM1_SM1DTCNT0    PWM1_BASE._0x0090
#define PWM1_SM1DTCNT1    PWM1_BASE._0x0092
#define PWM1_SM1CAPTCTRLA PWM1_BASE._0x0094
#define PWM1_SM1CAPTCOMPA PWM1_BASE._0x0096
#define PWM1_SM1CAPTCTRLB PWM1_BASE._0x0098
#define PWM1_SM1CAPTCOMPB PWM1_BASE._0x009A
#define PWM1_SM1CAPTCTRLX PWM1_BASE._0x009C
#define PWM1_SM1CAPTCOMPX PWM1_BASE._0x009E
#define PWM1_SM1CVAL0     PWM1_BASE._0x00A0
#define PWM1_SM1CVAL0CYC  PWM1_BASE._0x00A2
#define PWM1_SM1CVAL1     PWM1_BASE._0x00A4
#define PWM1_SM1CVAL1CYC  PWM1_BASE._0x00A6
#define PWM1_SM1CVAL2     PWM1_BASE._0x00A8
#define PWM1_SM1CVAL2CYC  PWM1_BASE._0x00AA
#define PWM1_SM1CVAL3     PWM1_BASE._0x00AC
#define PWM1_SM1CVAL3CYC  PWM1_BASE._0x00AE
#define PWM1_SM1CVAL4     PWM1_BASE._0x00B0
#define PWM1_SM1CVAL4CYC  PWM1_BASE._0x00B2
#define PWM1_SM1CVAL5     PWM1_BASE._0x00B4
#define PWM1_SM1CVAL5CYC  PWM1_BASE._0x00B6
#define PWM1_SM2CNT       PWM1_BASE._0x00C0
#define PWM1_SM2INIT      PWM1_BASE._0x00C2
#define PWM1_SM2CTRL2     PWM1_BASE._0x00C4
#define PWM1_SM2CTRL      PWM1_BASE._0x00C6
#define PWM1_SM2VAL0      PWM1_BASE._0x00CA
#define PWM1_SM2FRACVAL1  PWM1_BASE._0x00CC
#define PWM1_SM2VAL1      PWM1_BASE._0x00CE
#define PWM1_SM2FRACVAL2  PWM1_BASE._0x00D0
#define PWM1_SM2VAL2      PWM1_BASE._0x00D2
#define PWM1_SM2FRACVAL3  PWM1_BASE._0x00D4
#define PWM1_SM2VAL3      PWM1_BASE._0x00D6
#define PWM1_SM2FRACVAL4  PWM1_BASE._0x00D8
#define PWM1_SM2VAL4      PWM1_BASE._0x00DA
#define PWM1_SM2FRACVAL5  PWM1_BASE._0x00DC
#define PWM1_SM2VAL5      PWM1_BASE._0x00DE
#define PWM1_SM2FRCTRL    PWM1_BASE._0x00E0
#define PWM1_SM2OCTRL     PWM1_BASE._0x00E2
#define PWM1_SM2STS       PWM1_BASE._0x00E4
#define PWM1_SM2INTEN     PWM1_BASE._0x00E6
#define PWM1_SM2DMAEN     PWM1_BASE._0x00E8
#define PWM1_SM2TCTRL     PWM1_BASE._0x00EA
#define PWM1_SM2DISMAP0   PWM1_BASE._0x00EC
#define PWM1_SM2DISMAP1   PWM1_BASE._0x00EE
#define PWM1_SM2DTCNT0    PWM1_BASE._0x00F0
#define PWM1_SM2DTCNT1    PWM1_BASE._0x00F2
#define PWM1_SM2CAPTCTRLA PWM1_BASE._0x00F4
#define PWM1_SM2CAPTCOMPA PWM1_BASE._0x00F6
#define PWM1_SM2CAPTCTRLB PWM1_BASE._0x00F8
#define PWM1_SM2CAPTCOMPB PWM1_BASE._0x00FA
#define PWM1_SM2CAPTCTRLX PWM1_BASE._0x00FC
#define PWM1_SM2CAPTCOMPX PWM1_BASE._0x00FE
#define PWM1_SM2CVAL0     PWM1_BASE._0x0100
#define PWM1_SM2CVAL0CYC  PWM1_BASE._0x0102
#define PWM1_SM2CVAL1     PWM1_BASE._0x0104
#define PWM1_SM2CVAL1CYC  PWM1_BASE._0x0106
#define PWM1_SM2CVAL2     PWM1_BASE._0x0108
#define PWM1_SM2CVAL2CYC  PWM1_BASE._0x010a
#define PWM1_SM2CVAL3     PWM1_BASE._0x010c
#define PWM1_SM2CVAL3CYC  PWM1_BASE._0x010e
#define PWM1_SM2CVAL4     PWM1_BASE._0x0110
#define PWM1_SM2CVAL4CYC  PWM1_BASE._0x0112
#define PWM1_SM2CVAL5     PWM1_BASE._0x0114
#define PWM1_SM2CVAL5CYC  PWM1_BASE._0x0116
#define PWM1_SM3CNT       PWM1_BASE._0x0120
#define PWM1_SM3INIT      PWM1_BASE._0x0122
#define PWM1_SM3CTRL2     PWM1_BASE._0x0124
#define PWM1_SM3CTRL      PWM1_BASE._0x0126
#define PWM1_SM3VAL0      PWM1_BASE._0x012a
#define PWM1_SM3FRACVAL1  PWM1_BASE._0x012c
#define PWM1_SM3VAL1      PWM1_BASE._0x012e
#define PWM1_SM3FRACVAL2  PWM1_BASE._0x0130
#define PWM1_SM3VAL2      PWM1_BASE._0x0132
#define PWM1_SM3FRACVAL3  PWM1_BASE._0x0134
#define PWM1_SM3VAL3      PWM1_BASE._0x0136
#define PWM1_SM3FRACVAL4  PWM1_BASE._0x0138
#define PWM1_SM3VAL4      PWM1_BASE._0x013a
#define PWM1_SM3FRACVAL5  PWM1_BASE._0x013c
#define PWM1_SM3VAL5      PWM1_BASE._0x013e
#define PWM1_SM3FRCTRL    PWM1_BASE._0x0140
#define PWM1_SM3OCTRL     PWM1_BASE._0x0142
#define PWM1_SM3STS       PWM1_BASE._0x0144
#define PWM1_SM3INTEN     PWM1_BASE._0x0146
#define PWM1_SM3DMAEN     PWM1_BASE._0x0148
#define PWM1_SM3TCTRL     PWM1_BASE._0x014a
#define PWM1_SM3DISMAP0   PWM1_BASE._0x014c
#define PWM1_SM3DISMAP1   PWM1_BASE._0x014e
#define PWM1_SM3DTCNT0    PWM1_BASE._0x0150
#define PWM1_SM3DTCNT1    PWM1_BASE._0x0152
#define PWM1_SM3CAPTCTRLA PWM1_BASE._0x0154
#define PWM1_SM3CAPTCOMPA PWM1_BASE._0x0156
#define PWM1_SM3CAPTCTRLB PWM1_BASE._0x0158
#define PWM1_SM3CAPTCOMPB PWM1_BASE._0x015a
#define PWM1_SM3CAPTCTRLX PWM1_BASE._0x015c
#define PWM1_SM3CAPTCOMPX PWM1_BASE._0x015e
#define PWM1_SM3CVAL0     PWM1_BASE._0x0160
#define PWM1_SM3CVAL0CYC  PWM1_BASE._0x0162
#define PWM1_SM3CVAL1     PWM1_BASE._0x0164
#define PWM1_SM3CVAL1CYC  PWM1_BASE._0x0166
#define PWM1_SM3CVAL2     PWM1_BASE._0x0168
#define PWM1_SM3CVAL2CYC  PWM1_BASE._0x016a
#define PWM1_SM3CVAL3     PWM1_BASE._0x016c
#define PWM1_SM3CVAL3CYC  PWM1_BASE._0x016e
#define PWM1_SM3CVAL4     PWM1_BASE._0x0170
#define PWM1_SM3CVAL4CYC  PWM1_BASE._0x0172
#define PWM1_SM3CVAL5     PWM1_BASE._0x0174
#define PWM1_SM3CVAL5CYC  PWM1_BASE._0x0176
#define PWM1_OUTEN        PWM1_BASE._0x0180
#define PWM1_MASK         PWM1_BASE._0x018
#define PWM1_SWCOUT       PWM1_BASE._0x0184
#define PWM1_DTSRCSEL     PWM1_BASE._0x0186
#define PWM1_MCTRL        PWM1_BASE._0x0188
#define PWM1_MCTRL2       PWM1_BASE._0x018a
#define PWM1_FCTRL0       PWM1_BASE._0x018c
#define PWM1_FSTS0        PWM1_BASE._0x018e
#define PWM1_FFILT0       PWM1_BASE._0x0190
#define PWM1_FTST0        PWM1_BASE._0x0192
#define PWM1_FCTRL20      PWM1_BASE._0x0194

