AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
// FlexPWM2
#define PWM2_BASE         MAP_16BIT_REGISTER(0x403e0000)
#define PWM2_SM0CNT       PWM2_BASE._0x0000
#define PWM2_SM0INIT      PWM2_BASE._0x0002
#define PWM2_SM0CTRL2     PWM2_BASE._0x0004
#define PWM2_SM0CTRL      PWM2_BASE._0x0006
#define PWM2_SM0VAL0      PWM2_BASE._0x000A
#define PWM2_SM0FRACVAL1  PWM2_BASE._0x000C
#define PWM2_SM0VAL1      PWM2_BASE._0x000E
#define PWM2_SM0FRACVAL2  PWM2_BASE._0x0010
#define PWM2_SM0VAL2      PWM2_BASE._0x0012
#define PWM2_SM0FRACVAL3  PWM2_BASE._0x0014
#define PWM2_SM0VAL3      PWM2_BASE._0x0016
#define PWM2_SM0FRACVAL4  PWM2_BASE._0x0018
#define PWM2_SM0VAL4      PWM2_BASE._0x001A
#define PWM2_SM0FRACVAL5  PWM2_BASE._0x001C
#define PWM2_SM0VAL5      PWM2_BASE._0x001E
#define PWM2_SM0FRCTRL    PWM2_BASE._0x0020
#define PWM2_SM0OCTRL     PWM2_BASE._0x0022
#define PWM2_SM0STS       PWM2_BASE._0x0024
#define PWM2_SM0INTEN     PWM2_BASE._0x0026
#define PWM2_SM0DMAEN     PWM2_BASE._0x0028
#define PWM2_SM0TCTRL     PWM2_BASE._0x002A
#define PWM2_SM0DISMAP0   PWM2_BASE._0x002C
#define PWM2_SM0DISMAP1   PWM2_BASE._0x002E
#define PWM2_SM0DTCNT0    PWM2_BASE._0x0030
#define PWM2_SM0DTCNT1    PWM2_BASE._0x0032
#define PWM2_SM0CAPTCTRLA PWM2_BASE._0x0034
#define PWM2_SM0CAPTCOMPA PWM2_BASE._0x0036
#define PWM2_SM0CAPTCTRLB PWM2_BASE._0x0038
#define PWM2_SM0CAPTCOMPB PWM2_BASE._0x003A
#define PWM2_SM0CAPTCTRLX PWM2_BASE._0x003C
#define PWM2_SM0CAPTCOMPX PWM2_BASE._0x003E
#define PWM2_SM0CVAL0     PWM2_BASE._0x0040
#define PWM2_SM0CVAL0CYC  PWM2_BASE._0x0042
#define PWM2_SM0CVAL1     PWM2_BASE._0x0044
#define PWM2_SM0CVAL1CYC  PWM2_BASE._0x0046
#define PWM2_SM0CVAL2     PWM2_BASE._0x0048
#define PWM2_SM0CVAL2CYC  PWM2_BASE._0x004A
#define PWM2_SM0CVAL3     PWM2_BASE._0x004C
#define PWM2_SM0CVAL3CYC  PWM2_BASE._0x004E
#define PWM2_SM0CVAL4     PWM2_BASE._0x0050
#define PWM2_SM0CVAL4CYC  PWM2_BASE._0x0052
#define PWM2_SM0CVAL5     PWM2_BASE._0x0054
#define PWM2_SM0CVAL5CYC  PWM2_BASE._0x0056
#define PWM2_SM1CNT       PWM2_BASE._0x0060
#define PWM2_SM1INIT      PWM2_BASE._0x0062
#define PWM2_SM1CTRL2     PWM2_BASE._0x0064
#define PWM2_SM1CTRL      PWM2_BASE._0x0066
#define PWM2_SM1VAL0      PWM2_BASE._0x006A
#define PWM2_SM1FRACVAL1  PWM2_BASE._0x006C
#define PWM2_SM1VAL1      PWM2_BASE._0x006E
#define PWM2_SM1FRACVAL2  PWM2_BASE._0x0070
#define PWM2_SM1VAL2      PWM2_BASE._0x0072
#define PWM2_SM1FRACVAL3  PWM2_BASE._0x0074
#define PWM2_SM1VAL3      PWM2_BASE._0x0076
#define PWM2_SM1FRACVAL4  PWM2_BASE._0x0078
#define PWM2_SM1VAL4      PWM2_BASE._0x007A
#define PWM2_SM1FRACVAL5  PWM2_BASE._0x007C
#define PWM2_SM1VAL5      PWM2_BASE._0x007E
#define PWM2_SM1FRCTRL    PWM2_BASE._0x0080
#define PWM2_SM1OCTRL     PWM2_BASE._0x0082
#define PWM2_SM1STS       PWM2_BASE._0x0084
#define PWM2_SM1INTEN     PWM2_BASE._0x0086
#define PWM2_SM1DMAEN     PWM2_BASE._0x0088
#define PWM2_SM1TCTRL     PWM2_BASE._0x008A
#define PWM2_SM1DISMAP0   PWM2_BASE._0x008C
#define PWM2_SM1DISMAP1   PWM2_BASE._0x008E
#define PWM2_SM1DTCNT0    PWM2_BASE._0x0090
#define PWM2_SM1DTCNT1    PWM2_BASE._0x0092
#define PWM2_SM1CAPTCTRLA PWM2_BASE._0x0094
#define PWM2_SM1CAPTCOMPA PWM2_BASE._0x0096
#define PWM2_SM1CAPTCTRLB PWM2_BASE._0x0098
#define PWM2_SM1CAPTCOMPB PWM2_BASE._0x009A
#define PWM2_SM1CAPTCTRLX PWM2_BASE._0x009C
#define PWM2_SM1CAPTCOMPX PWM2_BASE._0x009E
#define PWM2_SM1CVAL0     PWM2_BASE._0x00A0
#define PWM2_SM1CVAL0CYC  PWM2_BASE._0x00A2
#define PWM2_SM1CVAL1     PWM2_BASE._0x00A4
#define PWM2_SM1CVAL1CYC  PWM2_BASE._0x00A6
#define PWM2_SM1CVAL2     PWM2_BASE._0x00A8
#define PWM2_SM1CVAL2CYC  PWM2_BASE._0x00AA
#define PWM2_SM1CVAL3     PWM2_BASE._0x00AC
#define PWM2_SM1CVAL3CYC  PWM2_BASE._0x00AE
#define PWM2_SM1CVAL4     PWM2_BASE._0x00B0
#define PWM2_SM1CVAL4CYC  PWM2_BASE._0x00B2
#define PWM2_SM1CVAL5     PWM2_BASE._0x00B4
#define PWM2_SM1CVAL5CYC  PWM2_BASE._0x00B6
#define PWM2_SM2CNT       PWM2_BASE._0x00C0
#define PWM2_SM2INIT      PWM2_BASE._0x00C2
#define PWM2_SM2CTRL2     PWM2_BASE._0x00C4
#define PWM2_SM2CTRL      PWM2_BASE._0x00C6
#define PWM2_SM2VAL0      PWM2_BASE._0x00CA
#define PWM2_SM2FRACVAL1  PWM2_BASE._0x00CC
#define PWM2_SM2VAL1      PWM2_BASE._0x00CE
#define PWM2_SM2FRACVAL2  PWM2_BASE._0x00D0
#define PWM2_SM2VAL2      PWM2_BASE._0x00D2
#define PWM2_SM2FRACVAL3  PWM2_BASE._0x00D4
#define PWM2_SM2VAL3      PWM2_BASE._0x00D6
#define PWM2_SM2FRACVAL4  PWM2_BASE._0x00D8
#define PWM2_SM2VAL4      PWM2_BASE._0x00DA
#define PWM2_SM2FRACVAL5  PWM2_BASE._0x00DC
#define PWM2_SM2VAL5      PWM2_BASE._0x00DE
#define PWM2_SM2FRCTRL    PWM2_BASE._0x00E0
#define PWM2_SM2OCTRL     PWM2_BASE._0x00E2
#define PWM2_SM2STS       PWM2_BASE._0x00E4
#define PWM2_SM2INTEN     PWM2_BASE._0x00E6
#define PWM2_SM2DMAEN     PWM2_BASE._0x00E8
#define PWM2_SM2TCTRL     PWM2_BASE._0x00EA
#define PWM2_SM2DISMAP0   PWM2_BASE._0x00EC
#define PWM2_SM2DISMAP1   PWM2_BASE._0x00EE
#define PWM2_SM2DTCNT0    PWM2_BASE._0x00F0
#define PWM2_SM2DTCNT1    PWM2_BASE._0x00F2
#define PWM2_SM2CAPTCTRLA PWM2_BASE._0x00F4
#define PWM2_SM2CAPTCOMPA PWM2_BASE._0x00F6
#define PWM2_SM2CAPTCTRLB PWM2_BASE._0x00F8
#define PWM2_SM2CAPTCOMPB PWM2_BASE._0x00FA
#define PWM2_SM2CAPTCTRLX PWM2_BASE._0x00FC
#define PWM2_SM2CAPTCOMPX PWM2_BASE._0x00FE
#define PWM2_SM2CVAL0     PWM2_BASE._0x0100
#define PWM2_SM2CVAL0CYC  PWM2_BASE._0x0102
#define PWM2_SM2CVAL1     PWM2_BASE._0x0104
#define PWM2_SM2CVAL1CYC  PWM2_BASE._0x0106
#define PWM2_SM2CVAL2     PWM2_BASE._0x0108
#define PWM2_SM2CVAL2CYC  PWM2_BASE._0x010a
#define PWM2_SM2CVAL3     PWM2_BASE._0x010c
#define PWM2_SM2CVAL3CYC  PWM2_BASE._0x010e
#define PWM2_SM2CVAL4     PWM2_BASE._0x0110
#define PWM2_SM2CVAL4CYC  PWM2_BASE._0x0112
#define PWM2_SM2CVAL5     PWM2_BASE._0x0114
#define PWM2_SM2CVAL5CYC  PWM2_BASE._0x0116
#define PWM2_SM3CNT       PWM2_BASE._0x0120
#define PWM2_SM3INIT      PWM2_BASE._0x0122
#define PWM2_SM3CTRL2     PWM2_BASE._0x0124
#define PWM2_SM3CTRL      PWM2_BASE._0x0126
#define PWM2_SM3VAL0      PWM2_BASE._0x012a
#define PWM2_SM3FRACVAL1  PWM2_BASE._0x012c
#define PWM2_SM3VAL1      PWM2_BASE._0x012e
#define PWM2_SM3FRACVAL2  PWM2_BASE._0x0130
#define PWM2_SM3VAL2      PWM2_BASE._0x0132
#define PWM2_SM3FRACVAL3  PWM2_BASE._0x0134
#define PWM2_SM3VAL3      PWM2_BASE._0x0136
#define PWM2_SM3FRACVAL4  PWM2_BASE._0x0138
#define PWM2_SM3VAL4      PWM2_BASE._0x013a
#define PWM2_SM3FRACVAL5  PWM2_BASE._0x013c
#define PWM2_SM3VAL5      PWM2_BASE._0x013e
#define PWM2_SM3FRCTRL    PWM2_BASE._0x0140
#define PWM2_SM3OCTRL     PWM2_BASE._0x0142
#define PWM2_SM3STS       PWM2_BASE._0x0144
#define PWM2_SM3INTEN     PWM2_BASE._0x0146
#define PWM2_SM3DMAEN     PWM2_BASE._0x0148
#define PWM2_SM3TCTRL     PWM2_BASE._0x014a
#define PWM2_SM3DISMAP0   PWM2_BASE._0x014c
#define PWM2_SM3DISMAP1   PWM2_BASE._0x014e
#define PWM2_SM3DTCNT0    PWM2_BASE._0x0150
#define PWM2_SM3DTCNT1    PWM2_BASE._0x0152
#define PWM2_SM3CAPTCTRLA PWM2_BASE._0x0154
#define PWM2_SM3CAPTCOMPA PWM2_BASE._0x0156
#define PWM2_SM3CAPTCTRLB PWM2_BASE._0x0158
#define PWM2_SM3CAPTCOMPB PWM2_BASE._0x015a
#define PWM2_SM3CAPTCTRLX PWM2_BASE._0x015c
#define PWM2_SM3CAPTCOMPX PWM2_BASE._0x015e
#define PWM2_SM3CVAL0     PWM2_BASE._0x0160
#define PWM2_SM3CVAL0CYC  PWM2_BASE._0x0162
#define PWM2_SM3CVAL1     PWM2_BASE._0x0164
#define PWM2_SM3CVAL1CYC  PWM2_BASE._0x0166
#define PWM2_SM3CVAL2     PWM2_BASE._0x0168
#define PWM2_SM3CVAL2CYC  PWM2_BASE._0x016a
#define PWM2_SM3CVAL3     PWM2_BASE._0x016c
#define PWM2_SM3CVAL3CYC  PWM2_BASE._0x016e
#define PWM2_SM3CVAL4     PWM2_BASE._0x0170
#define PWM2_SM3CVAL4CYC  PWM2_BASE._0x0172
#define PWM2_SM3CVAL5     PWM2_BASE._0x0174
#define PWM2_SM3CVAL5CYC  PWM2_BASE._0x0176
#define PWM2_OUTEN        PWM2_BASE._0x0180
#define PWM2_MASK         PWM2_BASE._0x018
#define PWM2_SWCOUT       PWM2_BASE._0x0184
#define PWM2_DTSRCSEL     PWM2_BASE._0x0186
#define PWM2_MCTRL        PWM2_BASE._0x0188
#define PWM2_MCTRL2       PWM2_BASE._0x018a
#define PWM2_FCTRL0       PWM2_BASE._0x018c
#define PWM2_FSTS0        PWM2_BASE._0x018e
#define PWM2_FFILT0       PWM2_BASE._0x0190
#define PWM2_FTST0        PWM2_BASE._0x0192
#define PWM2_FCTRL20      PWM2_BASE._0x0194

// FlexPWM3
#define PWM3_BASE         MAP_16BIT_REGISTER(0x403e4000)
#define PWM3_SM0CNT       PWM3_BASE._0x0000
#define PWM3_SM0INIT      PWM3_BASE._0x0002
#define PWM3_SM0CTRL2     PWM3_BASE._0x0004
#define PWM3_SM0CTRL      PWM3_BASE._0x0006
#define PWM3_SM0VAL0      PWM3_BASE._0x000A
#define PWM3_SM0FRACVAL1  PWM3_BASE._0x000C
#define PWM3_SM0VAL1      PWM3_BASE._0x000E
#define PWM3_SM0FRACVAL2  PWM3_BASE._0x0010
#define PWM3_SM0VAL2      PWM3_BASE._0x0012
#define PWM3_SM0FRACVAL3  PWM3_BASE._0x0014
#define PWM3_SM0VAL3      PWM3_BASE._0x0016
#define PWM3_SM0FRACVAL4  PWM3_BASE._0x0018
#define PWM3_SM0VAL4      PWM3_BASE._0x001A
#define PWM3_SM0FRACVAL5  PWM3_BASE._0x001C
#define PWM3_SM0VAL5      PWM3_BASE._0x001E
#define PWM3_SM0FRCTRL    PWM3_BASE._0x0020
#define PWM3_SM0OCTRL     PWM3_BASE._0x0022
#define PWM3_SM0STS       PWM3_BASE._0x0024
#define PWM3_SM0INTEN     PWM3_BASE._0x0026
#define PWM3_SM0DMAEN     PWM3_BASE._0x0028
#define PWM3_SM0TCTRL     PWM3_BASE._0x002A
#define PWM3_SM0DISMAP0   PWM3_BASE._0x002C
#define PWM3_SM0DISMAP1   PWM3_BASE._0x002E
#define PWM3_SM0DTCNT0    PWM3_BASE._0x0030
#define PWM3_SM0DTCNT1    PWM3_BASE._0x0032
#define PWM3_SM0CAPTCTRLA PWM3_BASE._0x0034
#define PWM3_SM0CAPTCOMPA PWM3_BASE._0x0036
#define PWM3_SM0CAPTCTRLB PWM3_BASE._0x0038
#define PWM3_SM0CAPTCOMPB PWM3_BASE._0x003A
#define PWM3_SM0CAPTCTRLX PWM3_BASE._0x003C
#define PWM3_SM0CAPTCOMPX PWM3_BASE._0x003E
#define PWM3_SM0CVAL0     PWM3_BASE._0x0040
#define PWM3_SM0CVAL0CYC  PWM3_BASE._0x0042
#define PWM3_SM0CVAL1     PWM3_BASE._0x0044
#define PWM3_SM0CVAL1CYC  PWM3_BASE._0x0046
#define PWM3_SM0CVAL2     PWM3_BASE._0x0048
#define PWM3_SM0CVAL2CYC  PWM3_BASE._0x004A
#define PWM3_SM0CVAL3     PWM3_BASE._0x004C
#define PWM3_SM0CVAL3CYC  PWM3_BASE._0x004E
#define PWM3_SM0CVAL4     PWM3_BASE._0x0050
#define PWM3_SM0CVAL4CYC  PWM3_BASE._0x0052
#define PWM3_SM0CVAL5     PWM3_BASE._0x0054
#define PWM3_SM0CVAL5CYC  PWM3_BASE._0x0056
#define PWM3_SM1CNT       PWM3_BASE._0x0060
#define PWM3_SM1INIT      PWM3_BASE._0x0062
#define PWM3_SM1CTRL2     PWM3_BASE._0x0064
#define PWM3_SM1CTRL      PWM3_BASE._0x0066
#define PWM3_SM1VAL0      PWM3_BASE._0x006A
#define PWM3_SM1FRACVAL1  PWM3_BASE._0x006C
#define PWM3_SM1VAL1      PWM3_BASE._0x006E
#define PWM3_SM1FRACVAL2  PWM3_BASE._0x0070
#define PWM3_SM1VAL2      PWM3_BASE._0x0072
#define PWM3_SM1FRACVAL3  PWM3_BASE._0x0074
#define PWM3_SM1VAL3      PWM3_BASE._0x0076
#define PWM3_SM1FRACVAL4  PWM3_BASE._0x0078
#define PWM3_SM1VAL4      PWM3_BASE._0x007A
#define PWM3_SM1FRACVAL5  PWM3_BASE._0x007C
#define PWM3_SM1VAL5      PWM3_BASE._0x007E
#define PWM3_SM1FRCTRL    PWM3_BASE._0x0080
#define PWM3_SM1OCTRL     PWM3_BASE._0x0082
#define PWM3_SM1STS       PWM3_BASE._0x0084
#define PWM3_SM1INTEN     PWM3_BASE._0x0086
#define PWM3_SM1DMAEN     PWM3_BASE._0x0088
#define PWM3_SM1TCTRL     PWM3_BASE._0x008A
#define PWM3_SM1DISMAP0   PWM3_BASE._0x008C
#define PWM3_SM1DISMAP1   PWM3_BASE._0x008E
#define PWM3_SM1DTCNT0    PWM3_BASE._0x0090
#define PWM3_SM1DTCNT1    PWM3_BASE._0x0092
#define PWM3_SM1CAPTCTRLA PWM3_BASE._0x0094
#define PWM3_SM1CAPTCOMPA PWM3_BASE._0x0096
#define PWM3_SM1CAPTCTRLB PWM3_BASE._0x0098
#define PWM3_SM1CAPTCOMPB PWM3_BASE._0x009A
#define PWM3_SM1CAPTCTRLX PWM3_BASE._0x009C
#define PWM3_SM1CAPTCOMPX PWM3_BASE._0x009E
#define PWM3_SM1CVAL0     PWM3_BASE._0x00A0
#define PWM3_SM1CVAL0CYC  PWM3_BASE._0x00A2
#define PWM3_SM1CVAL1     PWM3_BASE._0x00A4
#define PWM3_SM1CVAL1CYC  PWM3_BASE._0x00A6
#define PWM3_SM1CVAL2     PWM3_BASE._0x00A8
#define PWM3_SM1CVAL2CYC  PWM3_BASE._0x00AA
#define PWM3_SM1CVAL3     PWM3_BASE._0x00AC
#define PWM3_SM1CVAL3CYC  PWM3_BASE._0x00AE
#define PWM3_SM1CVAL4     PWM3_BASE._0x00B0
#define PWM3_SM1CVAL4CYC  PWM3_BASE._0x00B2
#define PWM3_SM1CVAL5     PWM3_BASE._0x00B4
#define PWM3_SM1CVAL5CYC  PWM3_BASE._0x00B6
#define PWM3_SM2CNT       PWM3_BASE._0x00C0
#define PWM3_SM2INIT      PWM3_BASE._0x00C2
#define PWM3_SM2CTRL2     PWM3_BASE._0x00C4
#define PWM3_SM2CTRL      PWM3_BASE._0x00C6
#define PWM3_SM2VAL0      PWM3_BASE._0x00CA
#define PWM3_SM2FRACVAL1  PWM3_BASE._0x00CC
#define PWM3_SM2VAL1      PWM3_BASE._0x00CE
#define PWM3_SM2FRACVAL2  PWM3_BASE._0x00D0
#define PWM3_SM2VAL2      PWM3_BASE._0x00D2
#define PWM3_SM2FRACVAL3  PWM3_BASE._0x00D4
#define PWM3_SM2VAL3      PWM3_BASE._0x00D6
#define PWM3_SM2FRACVAL4  PWM3_BASE._0x00D8
#define PWM3_SM2VAL4      PWM3_BASE._0x00DA
#define PWM3_SM2FRACVAL5  PWM3_BASE._0x00DC
#define PWM3_SM2VAL5      PWM3_BASE._0x00DE
#define PWM3_SM2FRCTRL    PWM3_BASE._0x00E0
#define PWM3_SM2OCTRL     PWM3_BASE._0x00E2
#define PWM3_SM2STS       PWM3_BASE._0x00E4
#define PWM3_SM2INTEN     PWM3_BASE._0x00E6
#define PWM3_SM2DMAEN     PWM3_BASE._0x00E8
#define PWM3_SM2TCTRL     PWM3_BASE._0x00EA
#define PWM3_SM2DISMAP0   PWM3_BASE._0x00EC
#define PWM3_SM2DISMAP1   PWM3_BASE._0x00EE
#define PWM3_SM2DTCNT0    PWM3_BASE._0x00F0
#define PWM3_SM2DTCNT1    PWM3_BASE._0x00F2
#define PWM3_SM2CAPTCTRLA PWM3_BASE._0x00F4
#define PWM3_SM2CAPTCOMPA PWM3_BASE._0x00F6
#define PWM3_SM2CAPTCTRLB PWM3_BASE._0x00F8
#define PWM3_SM2CAPTCOMPB PWM3_BASE._0x00FA
#define PWM3_SM2CAPTCTRLX PWM3_BASE._0x00FC
#define PWM3_SM2CAPTCOMPX PWM3_BASE._0x00FE
#define PWM3_SM2CVAL0     PWM3_BASE._0x0100
#define PWM3_SM2CVAL0CYC  PWM3_BASE._0x0102
#define PWM3_SM2CVAL1     PWM3_BASE._0x0104
#define PWM3_SM2CVAL1CYC  PWM3_BASE._0x0106
#define PWM3_SM2CVAL2     PWM3_BASE._0x0108
#define PWM3_SM2CVAL2CYC  PWM3_BASE._0x010a
#define PWM3_SM2CVAL3     PWM3_BASE._0x010c
#define PWM3_SM2CVAL3CYC  PWM3_BASE._0x010e
#define PWM3_SM2CVAL4     PWM3_BASE._0x0110
#define PWM3_SM2CVAL4CYC  PWM3_BASE._0x0112
#define PWM3_SM2CVAL5     PWM3_BASE._0x0114
#define PWM3_SM2CVAL5CYC  PWM3_BASE._0x0116
#define PWM3_SM3CNT       PWM3_BASE._0x0120
#define PWM3_SM3INIT      PWM3_BASE._0x0122
#define PWM3_SM3CTRL2     PWM3_BASE._0x0124
#define PWM3_SM3CTRL      PWM3_BASE._0x0126
#define PWM3_SM3VAL0      PWM3_BASE._0x012a
#define PWM3_SM3FRACVAL1  PWM3_BASE._0x012c
#define PWM3_SM3VAL1      PWM3_BASE._0x012e
#define PWM3_SM3FRACVAL2  PWM3_BASE._0x0130
#define PWM3_SM3VAL2      PWM3_BASE._0x0132
#define PWM3_SM3FRACVAL3  PWM3_BASE._0x0134
#define PWM3_SM3VAL3      PWM3_BASE._0x0136
#define PWM3_SM3FRACVAL4  PWM3_BASE._0x0138
#define PWM3_SM3VAL4      PWM3_BASE._0x013a
#define PWM3_SM3FRACVAL5  PWM3_BASE._0x013c
#define PWM3_SM3VAL5      PWM3_BASE._0x013e
#define PWM3_SM3FRCTRL    PWM3_BASE._0x0140
#define PWM3_SM3OCTRL     PWM3_BASE._0x0142
#define PWM3_SM3STS       PWM3_BASE._0x0144
#define PWM3_SM3INTEN     PWM3_BASE._0x0146
#define PWM3_SM3DMAEN     PWM3_BASE._0x0148
#define PWM3_SM3TCTRL     PWM3_BASE._0x014a
#define PWM3_SM3DISMAP0   PWM3_BASE._0x014c
#define PWM3_SM3DISMAP1   PWM3_BASE._0x014e
#define PWM3_SM3DTCNT0    PWM3_BASE._0x0150
#define PWM3_SM3DTCNT1    PWM3_BASE._0x0152
#define PWM3_SM3CAPTCTRLA PWM3_BASE._0x0154
#define PWM3_SM3CAPTCOMPA PWM3_BASE._0x0156
#define PWM3_SM3CAPTCTRLB PWM3_BASE._0x0158
#define PWM3_SM3CAPTCOMPB PWM3_BASE._0x015a
#define PWM3_SM3CAPTCTRLX PWM3_BASE._0x015c
#define PWM3_SM3CAPTCOMPX PWM3_BASE._0x015e
#define PWM3_SM3CVAL0     PWM3_BASE._0x0160
#define PWM3_SM3CVAL0CYC  PWM3_BASE._0x0162
#define PWM3_SM3CVAL1     PWM3_BASE._0x0164
#define PWM3_SM3CVAL1CYC  PWM3_BASE._0x0166
#define PWM3_SM3CVAL2     PWM3_BASE._0x0168
#define PWM3_SM3CVAL2CYC  PWM3_BASE._0x016a
#define PWM3_SM3CVAL3     PWM3_BASE._0x016c
#define PWM3_SM3CVAL3CYC  PWM3_BASE._0x016e
#define PWM3_SM3CVAL4     PWM3_BASE._0x0170
#define PWM3_SM3CVAL4CYC  PWM3_BASE._0x0172
#define PWM3_SM3CVAL5     PWM3_BASE._0x0174
#define PWM3_SM3CVAL5CYC  PWM3_BASE._0x0176
#define PWM3_OUTEN        PWM3_BASE._0x0180
#define PWM3_MASK         PWM3_BASE._0x018
#define PWM3_SWCOUT       PWM3_BASE._0x0184
#define PWM3_DTSRCSEL     PWM3_BASE._0x0186
#define PWM3_MCTRL        PWM3_BASE._0x0188
#define PWM3_MCTRL2       PWM3_BASE._0x018a
#define PWM3_FCTRL0       PWM3_BASE._0x018c
#define PWM3_FSTS0        PWM3_BASE._0x018e
#define PWM3_FFILT0       PWM3_BASE._0x0190
#define PWM3_FTST0        PWM3_BASE._0x0192
#define PWM3_FCTRL20      PWM3_BASE._0x0194

