AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
// FlexPWM4
#define PWM4_BASE         MAP_16BIT_REGISTER(0x403e8000)
#define PWM4_SM0CNT       PWM4_BASE._0x0000
#define PWM4_SM0INIT      PWM4_BASE._0x0002
#define PWM4_SM0CTRL2     PWM4_BASE._0x0004
#define PWM4_SM0CTRL      PWM4_BASE._0x0006
#define PWM4_SM0VAL0      PWM4_BASE._0x000A
#define PWM4_SM0FRACVAL1  PWM4_BASE._0x000C
#define PWM4_SM0VAL1      PWM4_BASE._0x000E
#define PWM4_SM0FRACVAL2  PWM4_BASE._0x0010
#define PWM4_SM0VAL2      PWM4_BASE._0x0012
#define PWM4_SM0FRACVAL3  PWM4_BASE._0x0014
#define PWM4_SM0VAL3      PWM4_BASE._0x0016
#define PWM4_SM0FRACVAL4  PWM4_BASE._0x0018
#define PWM4_SM0VAL4      PWM4_BASE._0x001A
#define PWM4_SM0FRACVAL5  PWM4_BASE._0x001C
#define PWM4_SM0VAL5      PWM4_BASE._0x001E
#define PWM4_SM0FRCTRL    PWM4_BASE._0x0020
#define PWM4_SM0OCTRL     PWM4_BASE._0x0022
#define PWM4_SM0STS       PWM4_BASE._0x0024
#define PWM4_SM0INTEN     PWM4_BASE._0x0026
#define PWM4_SM0DMAEN     PWM4_BASE._0x0028
#define PWM4_SM0TCTRL     PWM4_BASE._0x002A
#define PWM4_SM0DISMAP0   PWM4_BASE._0x002C
#define PWM4_SM0DISMAP1   PWM4_BASE._0x002E
#define PWM4_SM0DTCNT0    PWM4_BASE._0x0030
#define PWM4_SM0DTCNT1    PWM4_BASE._0x0032
#define PWM4_SM0CAPTCTRLA PWM4_BASE._0x0034
#define PWM4_SM0CAPTCOMPA PWM4_BASE._0x0036
#define PWM4_SM0CAPTCTRLB PWM4_BASE._0x0038
#define PWM4_SM0CAPTCOMPB PWM4_BASE._0x003A
#define PWM4_SM0CAPTCTRLX PWM4_BASE._0x003C
#define PWM4_SM0CAPTCOMPX PWM4_BASE._0x003E
#define PWM4_SM0CVAL0     PWM4_BASE._0x0040
#define PWM4_SM0CVAL0CYC  PWM4_BASE._0x0042
#define PWM4_SM0CVAL1     PWM4_BASE._0x0044
#define PWM4_SM0CVAL1CYC  PWM4_BASE._0x0046
#define PWM4_SM0CVAL2     PWM4_BASE._0x0048
#define PWM4_SM0CVAL2CYC  PWM4_BASE._0x004A
#define PWM4_SM0CVAL3     PWM4_BASE._0x004C
#define PWM4_SM0CVAL3CYC  PWM4_BASE._0x004E
#define PWM4_SM0CVAL4     PWM4_BASE._0x0050
#define PWM4_SM0CVAL4CYC  PWM4_BASE._0x0052
#define PWM4_SM0CVAL5     PWM4_BASE._0x0054
#define PWM4_SM0CVAL5CYC  PWM4_BASE._0x0056
#define PWM4_SM1CNT       PWM4_BASE._0x0060
#define PWM4_SM1INIT      PWM4_BASE._0x0062
#define PWM4_SM1CTRL2     PWM4_BASE._0x0064
#define PWM4_SM1CTRL      PWM4_BASE._0x0066
#define PWM4_SM1VAL0      PWM4_BASE._0x006A
#define PWM4_SM1FRACVAL1  PWM4_BASE._0x006C
#define PWM4_SM1VAL1      PWM4_BASE._0x006E
#define PWM4_SM1FRACVAL2  PWM4_BASE._0x0070
#define PWM4_SM1VAL2      PWM4_BASE._0x0072
#define PWM4_SM1FRACVAL3  PWM4_BASE._0x0074
#define PWM4_SM1VAL3      PWM4_BASE._0x0076
#define PWM4_SM1FRACVAL4  PWM4_BASE._0x0078
#define PWM4_SM1VAL4      PWM4_BASE._0x007A
#define PWM4_SM1FRACVAL5  PWM4_BASE._0x007C
#define PWM4_SM1VAL5      PWM4_BASE._0x007E
#define PWM4_SM1FRCTRL    PWM4_BASE._0x0080
#define PWM4_SM1OCTRL     PWM4_BASE._0x0082
#define PWM4_SM1STS       PWM4_BASE._0x0084
#define PWM4_SM1INTEN     PWM4_BASE._0x0086
#define PWM4_SM1DMAEN     PWM4_BASE._0x0088
#define PWM4_SM1TCTRL     PWM4_BASE._0x008A
#define PWM4_SM1DISMAP0   PWM4_BASE._0x008C
#define PWM4_SM1DISMAP1   PWM4_BASE._0x008E
#define PWM4_SM1DTCNT0    PWM4_BASE._0x0090
#define PWM4_SM1DTCNT1    PWM4_BASE._0x0092
#define PWM4_SM1CAPTCTRLA PWM4_BASE._0x0094
#define PWM4_SM1CAPTCOMPA PWM4_BASE._0x0096
#define PWM4_SM1CAPTCTRLB PWM4_BASE._0x0098
#define PWM4_SM1CAPTCOMPB PWM4_BASE._0x009A
#define PWM4_SM1CAPTCTRLX PWM4_BASE._0x009C
#define PWM4_SM1CAPTCOMPX PWM4_BASE._0x009E
#define PWM4_SM1CVAL0     PWM4_BASE._0x00A0
#define PWM4_SM1CVAL0CYC  PWM4_BASE._0x00A2
#define PWM4_SM1CVAL1     PWM4_BASE._0x00A4
#define PWM4_SM1CVAL1CYC  PWM4_BASE._0x00A6
#define PWM4_SM1CVAL2     PWM4_BASE._0x00A8
#define PWM4_SM1CVAL2CYC  PWM4_BASE._0x00AA
#define PWM4_SM1CVAL3     PWM4_BASE._0x00AC
#define PWM4_SM1CVAL3CYC  PWM4_BASE._0x00AE
#define PWM4_SM1CVAL4     PWM4_BASE._0x00B0
#define PWM4_SM1CVAL4CYC  PWM4_BASE._0x00B2
#define PWM4_SM1CVAL5     PWM4_BASE._0x00B4
#define PWM4_SM1CVAL5CYC  PWM4_BASE._0x00B6
#define PWM4_SM2CNT       PWM4_BASE._0x00C0
#define PWM4_SM2INIT      PWM4_BASE._0x00C2
#define PWM4_SM2CTRL2     PWM4_BASE._0x00C4
#define PWM4_SM2CTRL      PWM4_BASE._0x00C6
#define PWM4_SM2VAL0      PWM4_BASE._0x00CA
#define PWM4_SM2FRACVAL1  PWM4_BASE._0x00CC
#define PWM4_SM2VAL1      PWM4_BASE._0x00CE
#define PWM4_SM2FRACVAL2  PWM4_BASE._0x00D0
#define PWM4_SM2VAL2      PWM4_BASE._0x00D2
#define PWM4_SM2FRACVAL3  PWM4_BASE._0x00D4
#define PWM4_SM2VAL3      PWM4_BASE._0x00D6
#define PWM4_SM2FRACVAL4  PWM4_BASE._0x00D8
#define PWM4_SM2VAL4      PWM4_BASE._0x00DA
#define PWM4_SM2FRACVAL5  PWM4_BASE._0x00DC
#define PWM4_SM2VAL5      PWM4_BASE._0x00DE
#define PWM4_SM2FRCTRL    PWM4_BASE._0x00E0
#define PWM4_SM2OCTRL     PWM4_BASE._0x00E2
#define PWM4_SM2STS       PWM4_BASE._0x00E4
#define PWM4_SM2INTEN     PWM4_BASE._0x00E6
#define PWM4_SM2DMAEN     PWM4_BASE._0x00E8
#define PWM4_SM2TCTRL     PWM4_BASE._0x00EA
#define PWM4_SM2DISMAP0   PWM4_BASE._0x00EC
#define PWM4_SM2DISMAP1   PWM4_BASE._0x00EE
#define PWM4_SM2DTCNT0    PWM4_BASE._0x00F0
#define PWM4_SM2DTCNT1    PWM4_BASE._0x00F2
#define PWM4_SM2CAPTCTRLA PWM4_BASE._0x00F4
#define PWM4_SM2CAPTCOMPA PWM4_BASE._0x00F6
#define PWM4_SM2CAPTCTRLB PWM4_BASE._0x00F8
#define PWM4_SM2CAPTCOMPB PWM4_BASE._0x00FA
#define PWM4_SM2CAPTCTRLX PWM4_BASE._0x00FC
#define PWM4_SM2CAPTCOMPX PWM4_BASE._0x00FE
#define PWM4_SM2CVAL0     PWM4_BASE._0x0100
#define PWM4_SM2CVAL0CYC  PWM4_BASE._0x0102
#define PWM4_SM2CVAL1     PWM4_BASE._0x0104
#define PWM4_SM2CVAL1CYC  PWM4_BASE._0x0106
#define PWM4_SM2CVAL2     PWM4_BASE._0x0108
#define PWM4_SM2CVAL2CYC  PWM4_BASE._0x010a
#define PWM4_SM2CVAL3     PWM4_BASE._0x010c
#define PWM4_SM2CVAL3CYC  PWM4_BASE._0x010e
#define PWM4_SM2CVAL4     PWM4_BASE._0x0110
#define PWM4_SM2CVAL4CYC  PWM4_BASE._0x0112
#define PWM4_SM2CVAL5     PWM4_BASE._0x0114
#define PWM4_SM2CVAL5CYC  PWM4_BASE._0x0116
#define PWM4_SM3CNT       PWM4_BASE._0x0120
#define PWM4_SM3INIT      PWM4_BASE._0x0122
#define PWM4_SM3CTRL2     PWM4_BASE._0x0124
#define PWM4_SM3CTRL      PWM4_BASE._0x0126
#define PWM4_SM3VAL0      PWM4_BASE._0x012a
#define PWM4_SM3FRACVAL1  PWM4_BASE._0x012c
#define PWM4_SM3VAL1      PWM4_BASE._0x012e
#define PWM4_SM3FRACVAL2  PWM4_BASE._0x0130
#define PWM4_SM3VAL2      PWM4_BASE._0x0132
#define PWM4_SM3FRACVAL3  PWM4_BASE._0x0134
#define PWM4_SM3VAL3      PWM4_BASE._0x0136
#define PWM4_SM3FRACVAL4  PWM4_BASE._0x0138
#define PWM4_SM3VAL4      PWM4_BASE._0x013a
#define PWM4_SM3FRACVAL5  PWM4_BASE._0x013c
#define PWM4_SM3VAL5      PWM4_BASE._0x013e
#define PWM4_SM3FRCTRL    PWM4_BASE._0x0140
#define PWM4_SM3OCTRL     PWM4_BASE._0x0142
#define PWM4_SM3STS       PWM4_BASE._0x0144
#define PWM4_SM3INTEN     PWM4_BASE._0x0146
#define PWM4_SM3DMAEN     PWM4_BASE._0x0148
#define PWM4_SM3TCTRL     PWM4_BASE._0x014a
#define PWM4_SM3DISMAP0   PWM4_BASE._0x014c
#define PWM4_SM3DISMAP1   PWM4_BASE._0x014e
#define PWM4_SM3DTCNT0    PWM4_BASE._0x0150
#define PWM4_SM3DTCNT1    PWM4_BASE._0x0152
#define PWM4_SM3CAPTCTRLA PWM4_BASE._0x0154
#define PWM4_SM3CAPTCOMPA PWM4_BASE._0x0156
#define PWM4_SM3CAPTCTRLB PWM4_BASE._0x0158
#define PWM4_SM3CAPTCOMPB PWM4_BASE._0x015a
#define PWM4_SM3CAPTCTRLX PWM4_BASE._0x015c
#define PWM4_SM3CAPTCOMPX PWM4_BASE._0x015e
#define PWM4_SM3CVAL0     PWM4_BASE._0x0160
#define PWM4_SM3CVAL0CYC  PWM4_BASE._0x0162
#define PWM4_SM3CVAL1     PWM4_BASE._0x0164
#define PWM4_SM3CVAL1CYC  PWM4_BASE._0x0166
#define PWM4_SM3CVAL2     PWM4_BASE._0x0168
#define PWM4_SM3CVAL2CYC  PWM4_BASE._0x016a
#define PWM4_SM3CVAL3     PWM4_BASE._0x016c
#define PWM4_SM3CVAL3CYC  PWM4_BASE._0x016e
#define PWM4_SM3CVAL4     PWM4_BASE._0x0170
#define PWM4_SM3CVAL4CYC  PWM4_BASE._0x0172
#define PWM4_SM3CVAL5     PWM4_BASE._0x0174
#define PWM4_SM3CVAL5CYC  PWM4_BASE._0x0176
#define PWM4_OUTEN        PWM4_BASE._0x0180
#define PWM4_MASK         PWM4_BASE._0x018
#define PWM4_SWCOUT       PWM4_BASE._0x0184
#define PWM4_DTSRCSEL     PWM4_BASE._0x0186
#define PWM4_MCTRL        PWM4_BASE._0x0188
#define PWM4_MCTRL2       PWM4_BASE._0x018a
#define PWM4_FCTRL0       PWM4_BASE._0x018c
#define PWM4_FSTS0        PWM4_BASE._0x018e
#define PWM4_FFILT0       PWM4_BASE._0x0190
#define PWM4_FTST0        PWM4_BASE._0x0192
#define PWM4_FCTRL20      PWM4_BASE._0x0194

/**
 * @brief: ENC, Quadrature Encoder/decoder, Memory Map/Register
 * 56.8, p.3187
 *
 * Base addresses:
 * ENCn base address: 403C_8000h + (n-1)×4000h, where n is from 1 to 4.
 *
 * NOTE: The address of a register is the sum of a base address and an address
 *offset. •  Base address is defined at the MCU level •  Address offset is
 *defined at the module level
 *
 * For the base address, see the specific chip documentation.
 * All memory locations base andoffsets are given in hex.
 **/

// ENC 1
#define ENC1_BASE  MAP_16BIT_REGISTER(0x403c8000)
#define ENC1_CTRL  ENC1_BASE._0x0000 // Control Register
#define ENC1_FILT  ENC1_BASE._0x0002 // Input Filter Register
#define ENC1_WTR   ENC1_BASE._0x000h // Watchdog Timeout Registe
#define ENC1_POSD  ENC1_BASE._0x0006 // Position Difference Counter Register
#define ENC1_POSDH ENC1_BASE._0x0008 // Position Difference Hold Register
#define ENC1_REV   ENC1_BASE._0x000a // Revolution Counter Register
#define ENC1_REVH  ENC1_BASE._0x000c // Revolution Hold Register
#define ENC1_UPOS  ENC1_BASE._0x000e // Upper Position Counter Register
#define ENC1_LPOS  ENC1_BASE._0x0010 // Lower Position Counter Register
#define ENC1_UPOSH ENC1_BASE._0x0012 // Upper Position Hold Register
#define ENC1_LPOSH ENC1_BASE._0x0014 // Lower Position Hold Register
#define ENC1_UINIT ENC1_BASE._0x0016 // Upper Initialization Register
#define ENC1_LINIT ENC1_BASE._0x0018 // Lower Initialization Register
#define ENC1_IMR   ENC1_BASE._0x001a // Input Monitor Registe
#define ENC1_TST   ENC1_BASE._0x001c // Test Registe
#define ENC1_CTRL2 ENC1_BASE._0x001e // Control 2 Register
#define ENC1_UMOD  ENC1_BASE._0x0020 // Upper Modulus Register
#define ENC1_LMOD  ENC1_BASE._0x0022 // Lower Modulus Register
#define ENC1_UCOMP ENC1_BASE._0x0024 // Upper Position Compare Register
#define ENC1_LCOMP ENC1_BASE._0x0026 // Lower Position Compare Register

