AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
// ENC 2
#define ENC2_BASE  MAP_16BIT_REGISTER(0x403cc000)
#define ENC2_CTRL  ENC2_BASE._0x0000 // Control Register
#define ENC2_FILT  ENC2_BASE._0x0002 // Input Filter Register
#define ENC2_WTR   ENC2_BASE._0x000h // Watchdog Timeout Registe
#define ENC2_POSD  ENC2_BASE._0x0006 // Position Difference Counter Register
#define ENC2_POSDH ENC2_BASE._0x0008 // Position Difference Hold Register
#define ENC2_REV   ENC2_BASE._0x000a // Revolution Counter Registe
#define ENC2_REVH  ENC2_BASE._0x000c // Revolution Hold Register
#define ENC2_UPOS  ENC2_BASE._0x000e // Upper Position Counter Register
#define ENC2_LPOS  ENC2_BASE._0x0010 // Lower Position Counter Register
#define ENC2_UPOSH ENC2_BASE._0x0012 // Upper Position Hold Register
#define ENC2_LPOSH ENC2_BASE._0x0014 // Lower Position Hold Register
#define ENC2_UINIT ENC2_BASE._0x0016 // Upper Initialization Register
#define ENC2_LINIT ENC2_BASE._0x0018 // Lower Initialization Register
#define ENC2_IMR   ENC2_BASE._0x001a // Input Monitor Registe
#define ENC2_TST   ENC2_BASE._0x001c // Test Registe
#define ENC2_CTRL2 ENC2_BASE._0x001e // Control 2 Register
#define ENC2_UMOD  ENC2_BASE._0x0020 // Upper Modulus Register
#define ENC2_LMOD  ENC2_BASE._0x0022 // Lower Modulus Register
#define ENC2_UCOMP ENC2_BASE._0x0024 // Upper Position Compare Register
#define ENC2_LCOMP ENC2_BASE._0x0026 // Lower Position Compare Register

// ENC 3
#define ENC3_BASE  MAP_16BIT_REGISTER(0x403d0000)
#define ENC3_CTRL  ENC3_BASE._0x0000 // Control Register
#define ENC3_FILT  ENC3_BASE._0x0002 // Input Filter Register
#define ENC3_WTR   ENC3_BASE._0x000h // Watchdog Timeout Registe
#define ENC3_POSD  ENC3_BASE._0x0006 // Position Difference Counter Register
#define ENC3_POSDH ENC3_BASE._0x0008 // Position Difference Hold Register
#define ENC3_REV   ENC3_BASE._0x000a // Revolution Counter Registe
#define ENC3_REVH  ENC3_BASE._0x000c // Revolution Hold Register
#define ENC3_UPOS  ENC3_BASE._0x000e // Upper Position Counter Register
#define ENC3_LPOS  ENC3_BASE._0x0010 // Lower Position Counter Register
#define ENC3_UPOSH ENC3_BASE._0x0012 // Upper Position Hold Register
#define ENC3_LPOSH ENC3_BASE._0x0014 // Lower Position Hold Register
#define ENC3_UINIT ENC3_BASE._0x0016 // Upper Initialization Register
#define ENC3_LINIT ENC3_BASE._0x0018 // Lower Initialization Register
#define ENC3_IMR   ENC3_BASE._0x001a // Input Monitor Registe
#define ENC3_TST   ENC3_BASE._0x001c // Test Registe
#define ENC3_CTRL2 ENC3_BASE._0x001e // Control 2 Register
#define ENC3_UMOD  ENC3_BASE._0x0020 // Upper Modulus Register
#define ENC3_LMOD  ENC3_BASE._0x0022 // Lower Modulus Register
#define ENC3_UCOMP ENC3_BASE._0x0024 // Upper Position Compare Register
#define ENC3_LCOMP ENC3_BASE._0x0026 // Lower Position Compare Register

// ENC 4
#define ENC4_BASE  MAP_16BIT_REGISTER(0x403d4000)
#define ENC4_CTRL  ENC4_BASE._0x0000 // Control Register
#define ENC4_FILT  ENC4_BASE._0x0002 // Input Filter Register
#define ENC4_WTR   ENC4_BASE._0x000h // Watchdog Timeout Registe
#define ENC4_POSD  ENC4_BASE._0x0006 // Position Difference Counter Register
#define ENC4_POSDH ENC4_BASE._0x0008 // Position Difference Hold Register
#define ENC4_REV   ENC4_BASE._0x000a // Revolution Counter Registe
#define ENC4_REVH  ENC4_BASE._0x000c // Revolution Hold Register
#define ENC4_UPOS  ENC4_BASE._0x000e // Upper Position Counter Register
#define ENC4_LPOS  ENC4_BASE._0x0010 // Lower Position Counter Register
#define ENC4_UPOSH ENC4_BASE._0x0012 // Upper Position Hold Register
#define ENC4_LPOSH ENC4_BASE._0x0014 // Lower Position Hold Register
#define ENC4_UINIT ENC4_BASE._0x0016 // Upper Initialization Register
#define ENC4_LINIT ENC4_BASE._0x0018 // Lower Initialization Register
#define ENC4_IMR   ENC4_BASE._0x001a // Input Monitor Registe
#define ENC4_TST   ENC4_BASE._0x001c // Test Registe
#define ENC4_CTRL2 ENC4_BASE._0x001e // Control 2 Register
#define ENC4_UMOD  ENC4_BASE._0x0020 // Upper Modulus Register
#define ENC4_LMOD  ENC4_BASE._0x0022 // Lower Modulus Register
#define ENC4_UCOMP ENC4_BASE._0x0024 // Upper Position Compare Register
#define ENC4_LCOMP ENC4_BASE._0x0026 // Lower Position Compare Register

/**
 * @brief: WDOG1_2, Watchdog Timer , Memory Map/Register
 * 56.8, p.3151
 *
 * WDOG1 base address: 400B_8000h.
 * WDOG2 base address: 400D_0000h.
 *
 **/

#define WDOG1_BASE MAP_8BIT_REGISTER(0x400b8000)
#define WDOG1_WCR  WDOG1_BASE._0x0000 // Watchdog Control
#define WDOG1_WSR  WDOG1_BASE._0x0002 // Watchdog Service
#define WDOG1_WRSR WDOG1_BASE._0x0004 // Watchdog Reset Status
#define WDOG1_WICR WDOG1_BASE._0x0006 // Watchdog Interrupt Control
#define WDOG1_WMCR WDOG1_BASE._0x0008 // Watchdog Miscellaneous Control

#define WDOG2_BASE MAP_8BIT_REGISTER(0x400d0000)
#define WDOG2_WCR  WDOG2_BASE._0x0000 // Watchdog Control
#define WDOG2_WSR  WDOG2_BASE._0x0002 // Watchdog Service
#define WDOG2_WRSR WDOG2_BASE._0x0004 // Watchdog Reset Status
#define WDOG2_WICR WDOG2_BASE._0x0006 // Watchdog Interrupt Control
#define WDOG2_WMCR WDOG2_BASE._0x0008 // Watchdog Miscellaneous Control

/**
 * @brief: RTWDOG, Real Time Watchdog Timer , Memory Map/Register
 * 58.5 p.3206
 *
 * WDOG3 (RTWDOG) base address: 0x400bc000
 *
 **/
#define RTWDOG_BASE  MAP_32BIT_REGISTER(0x400bc000)
#define RTWDOG_CS    RTWDOG_BASE._0x0000 // Watchdog Control and Status
#define RTWDOG_CNT   RTWDOG_BASE._0x0004 // Watchdog Counter
#define RTWDOG_TOVAL RTWDOG_BASE._0x0008 // Watchdog Timeout Value
#define RTWDOG_WIN   RTWDOG_BASE._0x000c // Watchdog Window

/**
 * @brief: EWM, External Watchdog Monitor , Memory Map/Register
 * 59.6 p.3221
 *
 * DEFAULT_NICKNAME base address: 0x400b4000
 **/
#define EWM_BASE         MAP_8BIT_REGISTER(0x400b4000)
#define EWM_CTRL         EWM_BASE._0x0000 // Control Register
#define EWM_SERV         EWM_BASE._0x0001 // Service Register
#define EWM_CMPL         EWM_BASE._0x0002 // Compare Low Register
#define EWM_CMPH         EWM_BASE._0x0003 // Compare High Register
#define EWM_CLKCTRL      EWM_BASE._0x0004 // Clock Control Register
#define EWM_CLKPRESCALER EWM_BASE._0x0005 // Clock Prescaler Register

/**
 * @brief: XBARA,  Inter-Peripheral Crossbar Switch B , Memory Map/Register
 * 61.4 p.3235
 *
 * base address: 0x403bc000
 *
 **/
#define XBARA_BASE   MAP_16BIT_REGISTER(0x403bc000)
#define XBARA1_SEL0  XBARA_BASE._0x0000 // CrossbarA Slct Reg. 0
#define XBARA1_SEL1  XBARA_BASE._0x0002 // CrossbarA Slct Reg. 1
#define XBARA1_SEL2  XBARA_BASE._0x0004 // CrossbarA Slct Reg. 2
#define XBARA1_SEL3  XBARA_BASE._0x0006 // CrossbarA Slct Reg. 3
#define XBARA1_SEL4  XBARA_BASE._0x0008 // CrossbarA Slct Reg. 4
#define XBARA1_SEL5  XBARA_BASE._0x000a // CrossbarA Slct Reg. 5
#define XBARA1_SEL6  XBARA_BASE._0x000c // CrossbarA Slct Reg. 6
#define XBARA1_SEL7  XBARA_BASE._0x000e // CrossbarA Slct Reg. 7
#define XBARA1_SEL8  XBARA_BASE._0x0010 // CrossbarA Slct Reg. 8
#define XBARA1_SEL9  XBARA_BASE._0x0012 // CrossbarA Slct Reg. 9
#define XBARA1_SEL10 XBARA_BASE._0x0014 // CrossbarA Slct Reg. 10
#define XBARA1_SEL11 XBARA_BASE._0x0016 // CrossbarA Slct Reg. 11
#define XBARA1_SEL12 XBARA_BASE._0x0018 // CrossbarA Slct Reg. 12
#define XBARA1_SEL13 XBARA_BASE._0x001a // CrossbarA Slct Reg. 13
#define XBARA1_SEL14 XBARA_BASE._0x001c // CrossbarA Slct Reg. 14
#define XBARA1_SEL15 XBARA_BASE._0x001e // CrossbarA Slct Reg. 15
#define XBARA1_SEL16 XBARA_BASE._0x0020 // CrossbarA Slct Reg. 16
#define XBARA1_SEL17 XBARA_BASE._0x0022 // CrossbarA Slct Reg. 17
#define XBARA1_SEL18 XBARA_BASE._0x0024 // CrossbarA Slct Reg. 18
#define XBARA1_SEL19 XBARA_BASE._0x0026 // CrossbarA Slct Reg. 19
#define XBARA1_SEL20 XBARA_BASE._0x0028 // CrossbarA Slct Reg. 20
#define XBARA1_SEL21 XBARA_BASE._0x002a // CrossbarA Slct Reg. 21
#define XBARA1_SEL22 XBARA_BASE._0x002c // CrossbarA Slct Reg. 22
#define XBARA1_SEL23 XBARA_BASE._0x002e // CrossbarA Slct Reg. 23
#define XBARA1_SEL24 XBARA_BASE._0x0030 // CrossbarA Slct Reg. 24
#define XBARA1_SEL25 XBARA_BASE._0x0032 // CrossbarA Slct Reg. 25
#define XBARA1_SEL26 XBARA_BASE._0x0034 // CrossbarA Slct Reg. 26
#define XBARA1_SEL27 XBARA_BASE._0x0036 // CrossbarA Slct Reg. 27
#define XBARA1_SEL28 XBARA_BASE._0x0038 // CrossbarA Slct Reg. 28
#define XBARA1_SEL29 XBARA_BASE._0x003a // CrossbarA Slct Reg. 29
#define XBARA1_SEL30 XBARA_BASE._0x003c // CrossbarA Slct Reg. 30
#define XBARA1_SEL31 XBARA_BASE._0x003e // CrossbarA Slct Reg. 31
#define XBARA1_SEL32 XBARA_BASE._0x0040 // CrossbarA Slct Reg. 32
#define XBARA1_SEL33 XBARA_BASE._0x0042 // CrossbarA Slct Reg. 33
#define XBARA1_SEL34 XBARA_BASE._0x0044 // CrossbarA Slct Reg. 34
#define XBARA1_SEL35 XBARA_BASE._0x0046 // CrossbarA Slct Reg. 35
#define XBARA1_SEL36 XBARA_BASE._0x0048 // CrossbarA Slct Reg. 36
#define XBARA1_SEL37 XBARA_BASE._0x004a // CrossbarA Slct Reg. 37
#define XBARA1_SEL38 XBARA_BASE._0x004c // CrossbarA Slct Reg. 38
#define XBARA1_SEL39 XBARA_BASE._0x004e // CrossbarA Slct Reg. 39
#define XBARA1_SEL40 XBARA_BASE._0x0050 // CrossbarA Slct Reg. 40
#define XBARA1_SEL41 XBARA_BASE._0x0052 // CrossbarA Slct Reg. 41
#define XBARA1_SEL42 XBARA_BASE._0x0054 // CrossbarA Slct Reg. 42
#define XBARA1_SEL43 XBARA_BASE._0x0056 // CrossbarA Slct Reg. 43
#define XBARA1_SEL44 XBARA_BASE._0x0058 // CrossbarA Slct Reg. 44
#define XBARA1_SEL45 XBARA_BASE._0x005a // CrossbarA Slct Reg. 45
#define XBARA1_SEL46 XBARA_BASE._0x005c // CrossbarA Slct Reg. 46
#define XBARA1_SEL47 XBARA_BASE._0x005e // CrossbarA Slct Reg. 47
#define XBARA1_SEL48 XBARA_BASE._0x0060 // CrossbarA Slct Reg. 48
#define XBARA1_SEL49 XBARA_BASE._0x0062 // CrossbarA Slct Reg. 49
#define XBARA1_SEL50 XBARA_BASE._0x0064 // CrossbarA Slct Reg. 50
#define XBARA1_SEL51 XBARA_BASE._0x0066 // CrossbarA Slct Reg. 51
#define XBARA1_SEL52 XBARA_BASE._0x0068 // CrossbarA Slct Reg. 52
#define XBARA1_SEL53 XBARA_BASE._0x006a // CrossbarA Slct Reg. 53
#define XBARA1_SEL54 XBARA_BASE._0x006c // CrossbarA Slct Reg. 54
#define XBARA1_SEL55 XBARA_BASE._0x006e // CrossbarA Slct Reg. 55
#define XBARA1_SEL56 XBARA_BASE._0x0070 // CrossbarA Slct Reg. 56
#define XBARA1_SEL57 XBARA_BASE._0x0072 // CrossbarA Slct Reg. 57
#define XBARA1_SEL58 XBARA_BASE._0x0074 // CrossbarA Slct Reg. 58
#define XBARA1_SEL59 XBARA_BASE._0x0076 // CrossbarA Slct Reg. 59
#define XBARA1_SEL60 XBARA_BASE._0x0078 // CrossbarA Slct Reg. 60
#define XBARA1_SEL61 XBARA_BASE._0x007a // CrossbarA Slct Reg. 61
#define XBARA1_SEL62 XBARA_BASE._0x007c // CrossbarA Slct Reg. 62
#define XBARA1_SEL63 XBARA_BASE._0x007e // CrossbarA Slct Reg. 63
#define XBARA1_SEL64 XBARA_BASE._0x0080 // CrossbarA Slct Reg. 64
#define XBARA1_SEL65 XBARA_BASE._0x0082 // CrossbarA Slct Reg. 65
#define XBARA1_CTRL0 XBARA_BASE._0x0084 // CrossbarA Cnrol Re. 0
#define XBARA1_CTRL1 XBARA_BASE._0x0086 // CrossbarA Cnrol Re. 1

/**
 * @brief: XBARB, Inter-Peripheral Crossbar Switch B , Memory Map/Register
 * 62.3 p.3278
 *
 * base address: 0x403c0000
 *
 **/
#define XBARB_BASE0 MAP_16BIT_REGISTER(0x403c0000)
#define XBARB2_SEL0 XBARB_BASE0._0x0000 // CrossbarB Select Reg. 0
#define XBARB2_SEL1 XBARB_BASE0._0x0002 // CrossbarB Select Reg. 1
#define XBARB2_SEL2 XBARB_BASE0._0x0004 // CrossbarB Select Reg. 2
#define XBARB2_SEL3 XBARB_BASE0._0x0006 // CrossbarB Select Reg. 3
#define XBARB2_SEL4 XBARB_BASE0._0x0008 // CrossbarB Select Reg. 4
#define XBARB2_SEL5 XBARB_BASE0._0x000A // CrossbarB Select Reg. 5
#define XBARB2_SEL6 XBARB_BASE0._0x000C // CrossbarB Select Reg. 6
#define XBARB2_SEL7 XBARB_BASE0._0x000E // CrossbarB Select Reg. 7

#define XBARB_BASE1 MAP_16BIT_REGISTER(0x403c4000)
#define XBARB3_SEL0 XBARB_BASE1._0x0000 // CrossbarB Slct Reg. 0
#define XBARB3_SEL1 XBARB_BASE1._0x0002 // CrossbarB Slct Reg. 1
#define XBARB3_SEL2 XBARB_BASE1._0x0004 // CrossbarB Slct Reg. 2
#define XBARB3_SEL3 XBARB_BASE1._0x0006 // CrossbarB Slct Reg. 3
#define XBARB3_SEL4 XBARB_BASE1._0x0008 // CrossbarB Slct Reg. 4
#define XBARB3_SEL5 XBARB_BASE1._0x000A // CrossbarB Slct Reg. 5
#define XBARB3_SEL6 XBARB_BASE1._0x000C // CrossbarB Slct Reg. 6
#define XBARB3_SEL7 XBARB_BASE1._0x000E // CrossbarB Slct Reg. 7

/**
 * @brief: AOI, And-Or-Inverter , Memory Map/Register
 * 63.4 p.3287
 *
 * base address: 0x403b4000
 * base address 2: 0x403b8000
 *
 **/

#define AOI_BASE0     MAP_16BIT_REGISTER(0x403b4000)
#define AOI1_BFCRT010 AOI_BASE0._0x0000
#define AOI1_BFCRT230 AOI_BASE0._0x0002
#define AOI1_BFCRT011 AOI_BASE0._0x0004
#define AOI1_BFCRT231 AOI_BASE0._0x0006
#define AOI1_BFCRT012 AOI_BASE0._0x0008
#define AOI1_BFCRT232 AOI_BASE0._0x000a
#define AOI1_BFCRT013 AOI_BASE0._0x000c
#define AOI1_BFCRT233 AOI_BASE0._0x000e

#define AOI_BASE1     MAP_16BIT_REGISTER(0x403b8000)
#define AOI2_BFCRT010 AOI_BASE1._0x0000
#define AOI2_BFCRT230 AOI_BASE1._0x0002
#define AOI2_BFCRT011 AOI_BASE1._0x0004
#define AOI2_BFCRT231 AOI_BASE1._0x0006
#define AOI2_BFCRT012 AOI_BASE1._0x0008
#define AOI2_BFCRT232 AOI_BASE1._0x000a
#define AOI2_BFCRT013 AOI_BASE1._0x000c
#define AOI2_BFCRT233 AOI_BASE1._0x000e

// CMP CONTROL REGISTERS, p.3301 - p.3324 in
// IMXRT1060_Processor_Reference_Manual CMP1
#define CMP_BASE   MAP_8BIT_REGISTER(0x40094000)
#define CMP1_CR0   CMP_BASE._0x000 // R/W, CMP Control Register 0
#define CMP1_CR1   CMP_BASE._0x001 // R/W, CMP Control Register 1
#define CMP1_FPR   CMP_BASE._0x002 // R/W, CMP Filter Period Register
#define CMP1_SCR   CMP_BASE._0x003 // R/W, CMP Status and Control Register
#define CMP1_DACCR CMP_BASE._0x004 // R/W, DAC Control Register
#define CMP1_MUXCR CMP_BASE._0x005 // R/W, MUX Control Register

