AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
// CMP2
#define CMP2_CR0   CMP_BASE._0x008 // R/W, CMP Control Register 0
#define CMP2_CR1   CMP_BASE._0x009 // R/W, CMP Control Register 1
#define CMP2_FPR   CMP_BASE._0x00a // R/W, CMP Filter Period Register
#define CMP2_SCR   CMP_BASE._0x00b // R/W, CMP Status and Control Register
#define CMP2_DACCR CMP_BASE._0x00c // R/W, DAC Control Register
#define CMP2_MUXCR CMP_BASE._0x00d // R/W, MUX Control Register

// CMP3
#define CMP3_CR0   CMP_BASE._0x010 // R/W, CMP Control Register 0
#define CMP3_CR1   CMP_BASE._0x011 // R/W, CMP Control Register 1
#define CMP3_FPR   CMP_BASE._0x012 // R/W, CMP Filter Period Register
#define CMP3_SCR   CMP_BASE._0x013 // R/W, CMP Status and Control Register
#define CMP3_DACCR CMP_BASE._0x014 // R/W, DAC Control Register
#define CMP3_MUXCR CMP_BASE._0x015 // R/W, MUX Control Register

// CMP4
#define CMP4_CR0   CMP_BASE._0x018 // R/W, CMP Control Register 0
#define CMP4_CR1   CMP_BASE._0x019 // R/W, CMP Control Register 1
#define CMP4_FPR   CMP_BASE._0x01a // R/W, CMP Filter Period Register
#define CMP4_SCR   CMP_BASE._0x01b // R/W, CMP Status and Control Register
#define CMP4_DACCR CMP_BASE._0x01c // R/W, DAC Control Register
#define CMP4_MUXCR CMP_BASE._0x01d // R/W, MUX Control Register

/**
 * @brief ADC, Analog to Digital Converter p.3325
 * The analog-to-digital converter (ADC) is a successive approximation ADC
 * designed foroperation within an integrated microcontroller
 */

// ADC1
// ADC MEMORY ADDRESS MAPPINGS p.3352-p.3370
#define ADC1_BASE MAP_32BIT_REGISTER(0x400c4000)
// // Control Registers for hardware triggers
#define ADC1_HC0 ADC1_BASE._0x0000
#define ADC1_HC1 ADC1_BASE._0x0004
#define ADC1_HC2 ADC1_BASE._0x0008
#define ADC1_HC3 ADC1_BASE._0x000c
#define ADC1_HC4 ADC1_BASE._0x0010
#define ADC1_HC5 ADC1_BASE._0x0014
#define ADC1_HC6 ADC1_BASE._0x0018
#define ADC1_HC7 ADC1_BASE._0x001c

// // Status Register for HW Triggers
#define ADC1_HS ADC1_BASE._0x0020

// // Data result registers for HW triggers
#define ADC1_R0 ADC1_BASE._0x0024
#define ADC1_R1 ADC1_BASE._0x0028
#define ADC1_R2 ADC1_BASE._0x002c
#define ADC1_R3 ADC1_BASE._0x0030
#define ADC1_R4 ADC1_BASE._0x0034
#define ADC1_R5 ADC1_BASE._0x0038
#define ADC1_R6 ADC1_BASE._0x003c
#define ADC1_R7 ADC1_BASE._0x0040

// // Other registers
#define ADC1_CFG ADC1_BASE._0x0044 // Config. Register
#define ADC1_GC  ADC1_BASE._0x0048 // General control register
#define ADC1_GS  ADC1_BASE._0x004c // General status register
#define ADC1_CV  ADC1_BASE._0x0050 // Compare value register
#define ADC1_OFS ADC1_BASE._0x0054 // Offset correction calue register
#define ADC1_CAL ADC1_BASE._0x0058 // Calibration value register

// ADC2
// ADC MEMORY ADDRESS MAPPINGS p.3352-p.3370
#define ADC2_BASE MAP_32BIT_REGISTER(0x400c8000)
// // Control Registers for hardware triggers
#define ADC2_HC0 ADC2_BASE._0x0000
#define ADC2_HC1 ADC2_BASE._0x0004
#define ADC2_HC2 ADC2_BASE._0x0008
#define ADC2_HC3 ADC2_BASE._0x000c
#define ADC2_HC4 ADC2_BASE._0x0010
#define ADC2_HC5 ADC2_BASE._0x0014
#define ADC2_HC6 ADC2_BASE._0x0018
#define ADC2_HC7 ADC2_BASE._0x001c

// // Status Register for HW Triggers
#define ADC2_HS ADC2_BASE._0x0020

// // Data result registers for HW triggers
#define ADC2_R0 ADC2_BASE._0x0024
#define ADC2_R1 ADC2_BASE._0x0028
#define ADC2_R2 ADC2_BASE._0x002c
#define ADC2_R3 ADC2_BASE._0x0030
#define ADC2_R4 ADC2_BASE._0x0034
#define ADC2_R5 ADC2_BASE._0x0038
#define ADC2_R6 ADC2_BASE._0x003c
#define ADC2_R7 ADC2_BASE._0x0040

/**
 * @brief ADC_ETC, Analog to Digital Converter p.3371
 */
// ADC_ETC
// ADC_ETC MEMORY ADDRESS MAPPINGS p.3376-p.3398
#define ADC_ETC_BASE MAP_32BIT_REGISTER(0x403b0000)
// // Control Registers for hardware triggers
#define ADC_ETC_GCR ADC_ETC_BASE._0x0000 // ADC_ETC Global Control Register
#define ADC_HC1     ADC_ETC_BASE._0x0004 // ETC DONE0 and DONE1 IRQ State Register
#define ADC_HC2     ADC_ETC_BASE._0x0008 // ETC DONE2 and DONE3 IRQ State Register
#define ADC_HC3     ADC_ETC_BASE._0x000c // ETC DMA Control Register

// TRIG0
#define ADC_TRIG0_CR        ADC_ETC_BASE._0x0010 // ETC TRIG0 Control Register
#define ADC_TRIG0_COUNTERR  ADC_ETC_BASE._0x0014 // ETC TRIG0 COUNTER Register
#define ADC_TRIG0_CHAIN_1_0 ADC_ETC_BASE._0x0018 // ETC TRIG0 Chain 0/1 Reg.
#define ADC_TRIG0_CHAIN_3_2 ADC_ETC_BASE._0x001c // ETC TRIG0 Chain 2/3 Reg.
#define ADC_TRIG0_CHAIN_5_4 ADC_ETC_BASE._0x0020 // ETC TRIG0 Chain 4/5 Reg.
#define ADC_TRIG0_CHAIN_7_6 ADC_ETC_BASE._0x0024 // ETC TRIG0 Chain 6/7 Reg.
#define ADC_TRIG0_RES_1_0   ADC_ETC_BASE._0x0028 // ETC TRIG0 Result Data 0/1 Reg.
#define ADC_TRIG0_RES_3_2   ADC_ETC_BASE._0x002c // ETC TRIG0 Result Data 2/3 Reg.
#define ADC_TRIG0_RES_5_4   ADC_ETC_BASE._0x0030 // ETC TRIG0 Result Data 4/5 Reg.
#define ADC_TRIG0_RES_7_6   ADC_ETC_BASE._0x0034 // ETC TRIG0 Result Data 6/7 Reg.

// TRIG1
#define ADC_TRIG1_CR        ADC_ETC_BASE._0x0038 // ETC TRIG1 Control Register
#define ADC_TRIG1_COUNTERR  ADC_ETC_BASE._0x003c // ETC TRIG1 COUNTER Register
#define ADC_TRIG1_CHAIN_1_0 ADC_ETC_BASE._0x0040 // ETC TRIG1 Chain 0/1 Reg.
#define ADC_TRIG1_CHAIN_3_2 ADC_ETC_BASE._0x0044 // ETC TRIG1 Chain 2/3 Reg.
#define ADC_TRIG1_CHAIN_5_4 ADC_ETC_BASE._0x0048 // ETC TRIG1 Chain 4/5 Reg.
#define ADC_TRIG1_CHAIN_7_6 ADC_ETC_BASE._0x004c // ETC TRIG1 Chain 6/7 Reg.
#define ADC_TRIG1_RES_1_0   ADC_ETC_BASE._0x0050 // ETC TRIG1 Result Data 0/1 Reg.
#define ADC_TRIG1_RES_3_2   ADC_ETC_BASE._0x0054 // ETC TRIG1 Result Data 2/3 Reg.
#define ADC_TRIG1_RES_5_4   ADC_ETC_BASE._0x0058 // ETC TRIG1 Result Data 4/5 Reg.
#define ADC_TRIG1_RES_7_6   ADC_ETC_BASE._0x005c // ETC TRIG1 Result Data 6/7 Reg.

// TRIG2
#define ADC_TRIG2_CR        ADC_ETC_BASE._0x0060 // ETC TRIG2 Control Register
#define ADC_TRIG2_COUNTERR  ADC_ETC_BASE._0x0064 // ETC TRIG2 COUNTER Register
#define ADC_TRIG2_CHAIN_1_0 ADC_ETC_BASE._0x0068 // ETC TRIG2 Chain 0/1 Reg.
#define ADC_TRIG2_CHAIN_3_2 ADC_ETC_BASE._0x006c // ETC TRIG2 Chain 2/3 Reg.
#define ADC_TRIG2_CHAIN_5_4 ADC_ETC_BASE._0x0070 // ETC TRIG2 Chain 4/5 Reg.
#define ADC_TRIG2_CHAIN_7_6 ADC_ETC_BASE._0x0074 // ETC TRIG2 Chain 6/7 Reg.
#define ADC_TRIG2_RES_1_0   ADC_ETC_BASE._0x0078 // ETC TRIG2 Result Data 0/1 Reg.
#define ADC_TRIG2_RES_3_2   ADC_ETC_BASE._0x007c // ETC TRIG2 Result Data 2/3 Reg.
#define ADC_TRIG2_RES_5_4   ADC_ETC_BASE._0x0080 // ETC TRIG2 Result Data 4/5 Reg.
#define ADC_TRIG2_RES_7_6   ADC_ETC_BASE._0x0084 // ETC TRIG2 Result Data 6/7 Reg.

// TRIG3
#define ADC_TRIG3_CR        ADC_ETC_BASE._0x0088 // ETC TRIG3 Control Register
#define ADC_TRIG3_COUNTERR  ADC_ETC_BASE._0x008c // ETC TRIG3 COUNTER Register
#define ADC_TRIG3_CHAIN_1_0 ADC_ETC_BASE._0x0090 // ETC TRIG3 Chain 0/1 Reg.
#define ADC_TRIG3_CHAIN_3_2 ADC_ETC_BASE._0x0094 // ETC TRIG3 Chain 2/3 Reg.
#define ADC_TRIG3_CHAIN_5_4 ADC_ETC_BASE._0x0098 // ETC TRIG3 Chain 4/5 Reg.
#define ADC_TRIG3_CHAIN_7_6 ADC_ETC_BASE._0x009c // ETC TRIG3 Chain 6/7 Reg.
#define ADC_TRIG3_RES_1_0   ADC_ETC_BASE._0x00a0 // ETC TRIG3 Result Data 0/1 Reg.
#define ADC_TRIG3_RES_3_2   ADC_ETC_BASE._0x00a4 // ETC TRIG3 Result Data 2/3 Reg.
#define ADC_TRIG3_RES_5_4   ADC_ETC_BASE._0x00a8 // ETC TRIG3 Result Data 4/5 Reg.
#define ADC_TRIG3_RES_7_6   ADC_ETC_BASE._0x00ac // ETC TRIG3 Result Data 6/7 Reg.

// TRIG4
#define ADC_TRIG4_CR        ADC_ETC_BASE._0x00b0 // ETC TRIG4 Control Register
#define ADC_TRIG4_COUNTERR  ADC_ETC_BASE._0x00b4 // ETC TRIG4 COUNTER Register
#define ADC_TRIG4_CHAIN_1_0 ADC_ETC_BASE._0x00b8 // ETC TRIG4 Chain 0/1 Reg.
#define ADC_TRIG4_CHAIN_3_2 ADC_ETC_BASE._0x00bc // ETC TRIG4 Chain 2/3 Reg.
#define ADC_TRIG4_CHAIN_5_4 ADC_ETC_BASE._0x00c0 // ETC TRIG4 Chain 4/5 Reg.
#define ADC_TRIG4_CHAIN_7_6 ADC_ETC_BASE._0x00c4 // ETC TRIG4 Chain 6/7 Reg.
#define ADC_TRIG4_RES_1_0   ADC_ETC_BASE._0x00c8 // ETC TRIG4 Result Data 0/1 Reg.
#define ADC_TRIG4_RES_3_2   ADC_ETC_BASE._0x00cc // ETC TRIG4 Result Data 2/3 Reg.
#define ADC_TRIG4_RES_5_4   ADC_ETC_BASE._0x00d0 // ETC TRIG4 Result Data 4/5 Reg.
#define ADC_TRIG4_RES_7_6   ADC_ETC_BASE._0x00d4 // ETC TRIG4 Result Data 6/7 Reg.

