AbsenceGameDev/imxrt1062/TBM_CC/Core/include/sys/memory_map.h
// TRIG5
#define ADC_TRIG5_CR        ADC_ETC_BASE._0x00d8 // ETC TRIG5 Control Register
#define ADC_TRIG5_COUNTERR  ADC_ETC_BASE._0x00dc // ETC TRIG5 COUNTER Register
#define ADC_TRIG5_CHAIN_1_0 ADC_ETC_BASE._0x00e0 // ETC TRIG5 Chain 0/1 Reg.
#define ADC_TRIG5_CHAIN_3_2 ADC_ETC_BASE._0x00e4 // ETC TRIG5 Chain 2/3 Reg.
#define ADC_TRIG5_CHAIN_5_4 ADC_ETC_BASE._0x00e8 // ETC TRIG5 Chain 4/5 Reg.
#define ADC_TRIG5_CHAIN_7_6 ADC_ETC_BASE._0x00ec // ETC TRIG5 Chain 6/7 Reg.
#define ADC_TRIG5_RES_1_0   ADC_ETC_BASE._0x00f0 // ETC TRIG5 Result Data 0/1 Reg.
#define ADC_TRIG5_RES_3_2   ADC_ETC_BASE._0x00f4 // ETC TRIG5 Result Data 2/3 Reg.
#define ADC_TRIG5_RES_5_4   ADC_ETC_BASE._0x00f8 // ETC TRIG5 Result Data 4/5 Reg.
#define ADC_TRIG5_RES_7_6   ADC_ETC_BASE._0x00fc // ETC TRIG5 Result Data 6/7 Reg.

// TRIG6
#define ADC_TRIG6_CR        ADC_ETC_BASE._0x0100 // ETC TRIG6 Control Register
#define ADC_TRIG6_COUNTERR  ADC_ETC_BASE._0x0104 // ETC TRIG6 COUNTER Register
#define ADC_TRIG6_CHAIN_1_0 ADC_ETC_BASE._0x0108 // ETC TRIG6 Chain 0/1 Reg.
#define ADC_TRIG6_CHAIN_3_2 ADC_ETC_BASE._0x010c // ETC TRIG6 Chain 2/3 Reg.
#define ADC_TRIG6_CHAIN_5_4 ADC_ETC_BASE._0x0110 // ETC TRIG6 Chain 4/5 Reg.
#define ADC_TRIG6_CHAIN_7_6 ADC_ETC_BASE._0x0114 // ETC TRIG6 Chain 6/7 Reg.
#define ADC_TRIG6_RES_1_0   ADC_ETC_BASE._0x0118 // ETC TRIG6 Result Data 0/1 Reg.
#define ADC_TRIG6_RES_3_2   ADC_ETC_BASE._0x011c // ETC TRIG6 Result Data 2/3 Reg.
#define ADC_TRIG6_RES_5_4   ADC_ETC_BASE._0x0120 // ETC TRIG6 Result Data 4/5 Reg.
#define ADC_TRIG6_RES_7_6   ADC_ETC_BASE._0x0124 // ETC TRIG6 Result Data 6/7 Reg.

// TRIG7
#define ADC_TRIG7_CR        ADC_ETC_BASE._0x0128 // ETC TRIG7 Control Register
#define ADC_TRIG7_COUNTERR  ADC_ETC_BASE._0x012c // ETC TRIG7 COUNTER Register
#define ADC_TRIG7_CHAIN_1_0 ADC_ETC_BASE._0x0120 // ETC TRIG7 Chain 0/1 Reg.
#define ADC_TRIG7_CHAIN_3_2 ADC_ETC_BASE._0x0124 // ETC TRIG7 Chain 2/3 Reg.
#define ADC_TRIG7_CHAIN_5_4 ADC_ETC_BASE._0x0128 // ETC TRIG7 Chain 4/5 Reg.
#define ADC_TRIG7_CHAIN_7_6 ADC_ETC_BASE._0x012c // ETC TRIG7 Chain 6/7 Reg.
#define ADC_TRIG7_RES_1_0   ADC_ETC_BASE._0x0130 // ETC TRIG7 Result Data 0/1 Reg.
#define ADC_TRIG7_RES_3_2   ADC_ETC_BASE._0x0134 // ETC TRIG7 Result Data 2/3 Reg.
#define ADC_TRIG7_RES_5_4   ADC_ETC_BASE._0x0138 // ETC TRIG7 Result Data 4/5 Reg.
#define ADC_TRIG7_RES_7_6   ADC_ETC_BASE._0x013c // ETC TRIG7 Result Data 6/7 Reg.

/**
 * @brief TSC, Touch Screen Controller p.3399
 */

// TSC MEMORY ADDRESS MAPPINGS p.3352-p.3370
#define TSC_BASE              MAP_32BIT_REGISTER(0x400e0000)
#define TSC_BASIC_SETTING     TSC_BASE._0x000
#define TSC_PRE_CHARGE_TIME   TSC_BASE._0x010
#define TSC_FLOW_CTRL         TSC_BASE._0x020
#define TSC_MEASURE_VALUE     TSC_BASE._0x030
#define TSC_INTRPT_ENABLE     TSC_BASE._0x40
#define TSC_INTRPT_SIG_ENABLE TSC_BASE._0x50
#define TSC_INTRPT_STATUS     TSC_BASE._0x60
#define TSC_DEBUG_MODE        TSC_BASE._0x70
#define TSC_DEBUG_MODE2       TSC_BASE._0x80

typedef enum
{
  DISABLE = 0x0,
  ENABLE = 0x1
} general_enable_type_e;

/**
 * @brief pointer to be able to source pin addresses to the interface
 * @param gpio_pin_addr const volatile uint32_t pointer to a gpio addr
 * @param pulse const uint8_t that indicates low or high pulse
 */
typedef void (*trigger_gpio_fp_t)(const uint8_t       gpio_device_id,
                                  const unsigned char pulse);

#endif // SYSTEM_MEMORY_MAP_H